{"id":"1261","observed":"Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').","classification":"Class A","county":"Valdez-Chitina-Whittier","state":"Alaska","locationDetails":"East side of Prince William Sound"}
{"id":"8000","observed":"Hello, My name is Doug and though I am very reluctant to post this story; I am going to do so anyways. The area that this happened  could not be a more unlikely area for a bigfoot occurance then or  especially now with all the development of the farmland in the last 25 years which has been extensive and at a phenominal rate. After reading many (if not every last report on this website) and coming across more that a few that have happened in improbable areas (bigfoot running down neighborhood streets and sightings/ vocalizations near condo areas), I decided there just might be some merit in submitting this for review. A skilled researcher might be able to shed some more light maybe. My friends parents owned a small somewhat defunct farm with (I'm guessing maybe 15-20 acres of land -not the best judge on that) They had 3 horses; 2 mares that were allowed out in the field areas; a stabled stallion, and a pony I believe. The barn was in dis-repair and part of the roof had collapsed years earlier. There was a large pond that was almost completely enclosed with an impenatrable thicket of briars ringing almost the whole cirmcuference of the pond, except for a small area that was kept open for access for the horses to water. Much of the property was overgrown with these same briars that tended to make big circular mounds here and there in the field. The house sat close to the road; the barn to the left and further behind. The extreme left side of their property was bordered by a small stream that edged along a small (100 ft x 30 ft) stand of very dense pine trees. These pines (species unknown) tend to have a very dense understory of almost horizontal dead, dry, branches due to years of growth an minimal sunlight. The lower end of this pine grove had a mowed lawn area (next door neighbors property who were also related to my friend family) You had to access the camping area through the neighbors propery as the overgrowth of briars and other weeds, brambles, trees made it impossible to get there directly for the E------- property. The pond in relation to the campsite was to the left if you were looking back up towards the road; with the stream running between. The dense pine grove then lay between you and the road; unless you skirted around it through the neigbors backyard. This is what happened. No sighting but a vocalization. We had gone down to the campsite had built a fire and been down there for about an hour. During this time we all felt uneasy even though we had been there before many times. This is a long time ago but to the best of my memory we had been joking; probably made something to eat over the fire but something felt really wrong this time. \"Wrong\" is the best word I can use to describe. I remember I felt like I couldn't just sit down by the fire and stay with the conversation though. From back in the pine grove was the occasional, deliberate braking of branches that were just a little too large (to the sophisticated human ear) and just had the sound of being \"up off the ground some ways\" This would start and stop. We would listen and comment on it. First we thought maybe the mares had gotten back into the woods, unusual but this later was confirmed not to be so because we found out the next day that they were stabled for the night. We then thought it might be some older boys who were trying to scare us into running. It would be quiet for awhile then there would be a sense of movement closer to where we were and then receeding. We shined a flashlight and ventured back alittle ways but saw or smelled nothing. The sounds began again this time definately agitated, insistent with a very permiable feeling. We started to get un-nerved  moved out into the neighbors backyard. The sound grew louder, with traceable movement and then this ear splitting scream cut right out into the night. One loud shriek louder than anything should have to be. It just cut right to the core of your soul. Like so many reports I've read on this website, it's virtually impossible to do it justice with a human description precisly because it sounded so inhuman. We just ran like hell back to the house, left everything behind. No sense of being followed at all. No visual sighting (I almost wish). No bad smells or odors. In terms of other reports this pales, I know. But this is what happened and I never forgot it. We knew what Sasquatch were at the time, but no one ever heard of sightings east of the Mississippi to the best of my memory then. We kind of joked that maybe that's what our unseen friend was. Years later when I read and saw the reports from the southern part of York County (report on file with your website.) did I ever give any serious thought.","classification":"Class B","county":"York","state":"Pennsylvania","locationDetails":"I would rather not have exact location (listing the nearest road) to repect the privacy of the family that still owns the property. I have long since had a falling out with my friend at the time and don't feel he or they would like being approache about this. I like my own privacy respected; so I must accord others the same. The general area at that time was more open farmland with some large housing developements (in which I lived) within a mile. There were a good deal of homes scattered here and there and others in smaller developments. A very large animal like a Sasquatch could conceivably navigate (migrate) through an area like this at night using farmland as cover; but absolutely not stay very long in an area like that even then without revealing it's presense. I can give you more specific details on topography. Farmland opens up eventually much more to the north with a State Park (Gifford Pinchot) at the north end of the county. Southern end of York county where the  sightings occurred is a more likely area given in terms of what I've read of similar topography of other sighting then. Also much more rural and forested in the early \"70's."}
{"id":"703","observed":"It was May 1984. Two friends and I were up in the hills nw of Yamhill, OR, late in the evening, around 10:30 pm. We heard the scream, a VERY low, very long howl. Not a coyote, bear or cougar. Have heard all of them before. This was nothing like anything I have ever heard. I still remember thinking to myself \"How in the hell can something make such a low howl.\" It scared us at first, but is sounded like it was far away, like maybe a mile or so. We were drinking a little beer, so after awhile we relaxed and forgot about it. It must have been about a half hour later when we heard it again. I swear that it had to be within 30 yards of us. Same loud, low howl, but MUCH closer. And it sounded pissed. I could feel the sound vibrations bouncing off the back of my neck. The hair stood up on the back of all of our necks. All of us turned white as hell, and our jaws dropped past our knees. The howl seemed to say \"GET OUT!\" Which is EXACTLY what we did. I just looked at the two other guys and said \"lets get the @#$ outta here \". We did not see anything, but felt the presence. I grew up within 10 miles of that spot. I had never heard that sound before, or since, EXCEPT on a television show that had a report of a bigfoot sighting. A guy in Idaho caught one on video (at least it looked like one), but when I saw the video, I heard that scream again. The guy taking the video threw the camera in the ditch, and hid. It was the SAME scream. ONLY other time that I have EVER heard it. It was EXACTLY the same scream. I saw this video on a news show, something like \"Real TV\" while in Fairfax, VA, in 1992 or 1993. I do not know EXACTLY what it is that we heard, but I know what I think it was. Bigfoot. That is my story, and I have two wittnesses to back me up.","classification":"Class B","county":"Yamhill","state":"Oregon","locationDetails":"Logging roads north west of Yamhill, OR, about 15 miles."}
{"id":"9765","timestamp":118022400,"title":"Motorist and children have daylight sighting near Burns Flat.","observed":"My two children and I were returning from Altus,  Oklahoma to Burns Flat, Oklahoma in the fall of 1973 when a very large black man-like creature crossed the highway moving from west to east. I was driving and my son (age 11) was sitting in the front seat beside me and my daughter (age 12) was sitting in the back seat leaning forward between the driver and passenger seat. It was a clear sunny day about 3 PM and there was a lull in the conversation. It was quiet in the car, we did not have the radio on and all three of us were happened to be looking straight ahead. I noticed a movement on the left side of the road and was amazed to see a what I percieved to be a very large black man-like creature rise from a squatting position and run across the two lane highway about 30 yards ahead. It ran across the highway, covering the distance in only three steps, I estimate the creature to have been at least 8 feet tall, it glanced briefly in the direction of the car and I instictively applied the brake so as not to hit it. It ran into the bar ditch on the east side of the road and ducked into some brush and large bushes between the ditch and the barbed wire fence. It had hair that looked rather silky as it ran, I remember seeing the hair move as it ran. The hair did not appear to be stiff like an animals hair but more soft and shiny. Both children saw it too and said \"What was that, mama?\" I said I didn't know, they wanted me to stop the car, but I was frightened that my children and I could be harmed by something I had never seen before in my life. I didn't tell anyone what I had seen and cautioned the children not to say anything either.","classification":"Class A","county":"Washita","state":"Oklahoma","latitude":35.3011,"longitude":-99.1702,"latlng":"-99.1702,35.3011","locationDetails":"The creature crossed from one cattle pasture to another, it may have been leaving a pond on the east side of the highway.","dewPoint":50.86,"humidity":0.73,"cloudCover":0.16,"moonPhase":0.07,"pressure":1017.29,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":6,"visibility":10,"highTemp":72.55,"midTemp":63.225,"lowTemp":53.9,"windBearing":263,"windSpeed":8.15}
{"id":"4983","timestamp":49852800,"title":"Sighting and vocalizations at a home in Wayne National Forest","observed":"I was staying the night with a friends of mine. It was late at night we were watching TV waiting on his parents to come home. We heard a noise out front and I looked out the window in the door to the mobile home. A large face was looking in the window. The face had a very heavy brow with deepest eyes, the nose was wide and flat with flared nostrils. The lips were thick and rubbery looking with thick block like teeth. The hair was about one inch long on the face and it sweptback from the brow with a large lump standing up on the top of the head. The head sat on the shoulders with no sigh of a neck. It let out a scream and it pushed off from the door. My friend grabbed his 22 rifle and we went out the back door in time to see it step NOT JUMP but step over a 3 strand barb wire fence and run in a hunched over motion with it's arms swinging it's hands below it's knees. The next day we looked for tracks but found none. We did measured the distance from the ground to the window of the door (there was no front steps) 7'6\".","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.38745,"longitude":-81.67339,"latlng":"-81.67339,39.38745","locationDetails":"Vincent, Ohio (In theWayne National Forest)","dewPoint":62.45,"humidity":0.82,"cloudCover":0.86,"moonPhase":0.32,"pressure":1022.74,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":6,"visibility":4.97,"highTemp":76.32,"midTemp":70.44,"lowTemp":64.56,"precipitationIntensity":0.0006,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":156,"windSpeed":3.02}
{"id":"26566","timestamp":1064016000,"title":"Man observes tall, white hair-covered creature during a family gathering near Lake Ontario","observed":"My family had moved from the city of Rochester to Wolcott, a small town about 50 miles east of Rochester in July 2003. We were living in an old farmhouse on approx. 77 acres of woods & creeks near Lake Ontario. This incident happened sometime between the 18th-20th of September. My sister's birthday is the 20th and I recall a small group of family and friends were visiting the house for that occasion. My future-stepfather took a small group, including his brother, my four sisters, and a few other friends out for a \"tour\" of the property. I was not present, I had stayed behind at the house. As the group returned to the house, my stepfather lingered behind in an area of the property where a strip of woods runs between two fields. My stepfather was in the field closer to the house, we'll refer to it as field #1. He noticed to his left something in the woods and turned to see a tall, white, hair covered creature standing just off the path in the woods. He ran ahead and told his brother, but did not tell the rest of the group. His brother rushed into the house to get me, telling me that something was in the woods and I should come see. I followed him outside where my stepfather relayed the story to me and the three of us walked back to the area of his sighting. As my stepfather showed me the spot where the creature had been standing, we all noticed that the creature was still present, but had moved further back, to field #2. At this point, the three of us were standing in field 1 and looking through a small strip of trees at the creature in field 2, maybe 200 yards away or so. My observations of the creature are as follows: It was approximately 7' tall, covered in hair, white but with a dark area on the face, think and lanky, with a head that came to a slight conic shape. It was too far to distinctly see its face but there was a definite darker colored area where the face would have been. The creature was clearly observing us, as it paced back and forth, looking around trees, standing up taller, ducking down, etc. to get a better look at us. After approximately 45 seconds, the creature retreated to an area where we couldn't see it clearly. I walked through the trees into field 2 to get a better look at it, but it had disappeared. The area where it had been walking was matted down, but there were no distinct prints. Judging by nearby trees, I estimated its height to be 6.5 - 7 feet.","classification":"Class A","county":"Wayne","state":"New York","latitude":43.27314,"longitude":-76.89331,"latlng":"-76.89331,43.27314","locationDetails":"East on Route 104, near town of Huron.","dewPoint":54.06,"humidity":0.75,"cloudCover":0.48,"moonPhase":0.81,"pressure":1020.75,"weatherSummary":"Partly cloudy until evening.","uvIndex":4,"visibility":9.53,"highTemp":67.62,"midTemp":58.16,"lowTemp":48.7,"precipitationIntensity":0.0006,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":253,"windSpeed":8.73}
{"id":"5692","timestamp":20995200,"title":"Father and son hear vocalizations on Peavine Mt","observed":"I grew up in Northwestern Nevada along the California border in the foothills of the Sierra's.  My father was a geologist who preferred working and camping in areas that were as sparsely populated as possible.  Between 1970 and 1983 I had a number of encounters in Nevada, California, and Washington states.  I plan to submit them individually in chronological sequence so that I can provide as much detail for researchers as possible. This first encounter occured in 1970 on Peavine Mountain Northwest of Reno, Nevada.  I was ten at the time and tagging along with my father, who was hunting deer.  We were on the Western side of the mountain, close to the California border.  We were between two ridges crossing a meadow on the Western face of the East ridge.  It was about 3:30 PM and the sun was beginning to drop behind the trees on the Western ridge.  There were no clouds and it was still very bright in the meadow, but the shallow draw between the two ridges was heavily shadowed. As my father and I neared the center of the meadow we heard an extended call coming from the West.  We had lived in Kansas until I was eight and the call reminded me of the World War II air raid siren they used for tornado alerts where we used to live.  It began low and relatively quiet and rose in both pitch and volume as it progressed.  It lasted for about fifteen to twenty seconds before rapidly dropping off.  After about ten seconds the call was repeated.  It seemed to me that it was coming from the draw a couple of hundred yards West and downhill from us.  Unlike the tornado siren I was familiar with, it had a mellow, rather than harsh, or mechanical, quality to it. As the second call ended I asked my father what was making the noise.  Annoyed, he told me that it was just the siren from a fire tower and picked up his pace.  That seemed reasonable, and I began looking around at the surrounding high ground for the tower when the call sounded a third time.  It seemed to be coming from the draw and seemed to be moving away from us. I caught up with my father and, being a curious ten-year old, asked him in rapid succession where the tower was and if he smelled any smoke.  He replied that it was on the other side of the far ridge and that they were just testing the siren.  I told him I thought the call was coming from the draw and at that point was told to shut up.  As the call sounded a fourth time, even further away, my father listened to it and then decided to call it a day.  We walked to the jeep and drove home without further incident.","classification":"Class B","county":"Washoe","state":"Nevada","latitude":39.592,"longitude":-119.975,"latlng":"-119.975,39.592","locationDetails":"The Western face of Peavine Mountain, Northwest of Reno Nevada.","dewPoint":43.89,"humidity":0.42,"moonPhase":0.02,"pressure":1011.96,"weatherSummary":"Clear throughout the day.","uvIndex":9,"visibility":9.76,"highTemp":88.56,"midTemp":70.22,"lowTemp":51.88,"windBearing":197,"windSpeed":1.96}
{"id":"438","observed":"heh i kinda feel a little dumb that im reporting this but its bothering me so here goes.. bout a month ago i was with a friend and her son, we were hanging out at a camp ground by Allamuchy state park, in Warren county NJ. i think the camp ground was part of Stephens state park either way it was on the Musconetcong river. it was late in the day and we were just walking on the trials by the river. we figured since her son was gonna stay with her folks that evening we would come back later and spend the night at the camp ground. we went home and got together some gear, just sleeping bags and sleeping pads. we stopped at a store got some hotdogs and rolls and a gallon of water then headed to the camp site. it was about 10pm when we got to the camp site and i think we took spot 19. it was close to the road one of the last spots before ya hit the road maybe 50 yards or so. we made a fire in the metal fire ring and just sat around till about 1am, there were maybe 5 or 6 sites that were camped that night one was taken by some boy scouts. at about 1am my friend got in her sleeping bag next to the fire, i was still up drinking hot chocolate and stareing into the fire, about 20min or so later i got into my bag next to her and was lieing on my side looking into the woods. i wasnt comfortable and i laid awake for a good hour or so just thinking and listening to the sounds of the woods and the river that was 100yards tops away from me. then i heard a sound like someone was lightly banging a fork or something against a plate. i thought maybe a bear was snooping around looking for a free meal, this is bear country and we have a very healthy black bear population, but maybe 30 seconds after i heard the metalic sound i heard someone or something bang a branch against a tree 4 or 5 times in a row, i thought that the bear maybe was getting a little to close to someones camp site. then i again heard banging against a tree but this time it was a bout 100yards into the woods and not near any camping area that i had seen in the daylight. then the tree banging came from the first spot as if answering the other position. the first tree banger was what seemed to be on or near the road by the middle of the camp ground. that kinda made my mind wander i was wondering what was going on..and who is up making all this noise. about 10minutes later i looked into the woods which were slightly iluminated by my dieing fire and i saw what looked like a bear looking into my camp about 20 feet away from behind a tree. i saw just the shadowy outline of it. i could see its head and shoulders slowly move out from behind the tree look in and then move back behind the tree. ive seen bears do this before in the day light but never this close. then i closed my eyes waited a few seconds and opened them just to make sure i wasnt seeing things. but this whatever it was had difined shoulders and a rounded kinda pointy on top head, it didnt have and ears like you would see on a bear, nor the flat head of a bear and if it was a bear its front arms wouldnt have given it the squared off shoulders that i was seeing in the silloette of this figure. i got kinda scared for a few moments and didnt move a at all. i thought for a second about jumping up and yelling at it but i didnt want so get it mad at me or scare it. i closed my eyes and tried my hardest just to fall asleep. i dozed off finally and was awoken by my friend who was yelling at me for not putting the bag of hotdogs in the car before going to sleep. we had in the bag a apple and a orange, rolls and a unopend pack of hotdogs, i tied the bag with a simple knot like you would tigh your shoes the night before, but when i got up the only thing left where the bag was, was the orange just sitting there on the ground. my friend said somthing along the lines of wow a bear came and stole our hotdogs. i kinda was wondering what was going on so i decided to have a look around where i saw the figure the night before, i remembered that the shadowy figure was hiding behind the tree and i could see a branch just above its head maybe a foot or so higher than the top of the figure. it was puzzleing because that branch must have been 8 or 9 feet off the ground and black bears where i come from dont stand that tall on there hind feet. i didnt try to tell her what i heard or saw the night before because she wouldnt have belived me anyway, but ive spend lots of time in the back country and woods hunting, fishing, rock climbing, and backpacking. i know what bears look like up close as well as from a distance. and this wasnt a bear and to tall for a person. i didnt smell anything but i think i was up wind anyway and we were burning wood in the fire and all i could really smell was the fire anyway. the thing that really bothers me is the tree banging its was allmost like something was comunicating with something else. it also bothers me that something waited until it was sure that i was asleep before coming into camp. in which case it woulda been 6 or 7 feet from where we were sleeping in order to open the bag and have a look in it, then disguard the orange and take the rest bag and all. it wouldve had to make some sound if it just tore the bag opened. i looked around before we left to see if i could find any tracks or anything but the ground is was just to hard, there was a few game trails but i didnt look very far or spend alot of time looking. i looked on the internet and found this sight and was surprized to see other sitings in new jersey.","classification":"Class B","county":"Warren","state":"New Jersey","locationDetails":"the road is off us rt 80, i dont know the exit number just how to get there if im driving will try to find out the details."}
{"id":"55269","timestamp":1465257600,"title":"Dawn sighting at Stevens Brook outside Claremont","observed":"I was on my way to Claremont from Lebanon on Rte 120 and was passing by some reeds in a marshy area next to the road that sounded like a huge flock of birds. The creature came out of the reeds and was crouched down looking at me through them. Surprisingly it got out of the reeds from crouched to standing turned around and ran towards the wooded area up a hill and was moving with it's arms brush and tree branches out of the way. It was incredibly fast runner and I got a good look at its coconut shaped head as it ran away. It was light brown/brown. It had incredibly broad shoulders. I went back the same day. The marsh went up to my knees and I could smell a bad odor like garbage. Myself and a friend went back to the sighting. We found a footprint and a hair sample. I could hear wood knocks when my friend James did a call and we also found a large bed of branches and some tree structures. The following month I went back to Claremont and I heard screeching in the woods while I was traveling Rte. 120 on a bicycle.","classification":"Class A","county":"Sullivan","state":"New Hampshire","latitude":43.41549,"longitude":-72.33093,"latlng":"-72.33093,43.41549","locationDetails":"Close to Claremont down 120 not far from Kingston road.","dewPoint":54.25,"humidity":0.73,"cloudCover":0.22,"moonPhase":0.1,"pressure":999.41,"weatherSummary":"Rain in the evening.","uvIndex":8,"visibility":9.47,"highTemp":75.83,"midTemp":65.75,"lowTemp":55.67,"precipitationIntensity":0.0057,"precipitationProbability":0.3,"precipitationType":"rain","windBearing":234,"windSpeed":2.47}
{"id":"6410","timestamp":299894400,"title":"Multiple witness sighting at night, 3 miles east of Mead, Nebraska","observed":"First of all this happened in the summer of 1979 on the 4th of July. This is the first of two possible encounters I have experienced over 22 years. The second occurred on November 10th in 2001. We had just finished lighting our 4th of July fireworks and were sitting around the patio talking and relaxing. There were probably 8 adults and 6 kids at my former InLaws farm house. It was around 11pm when a friend of ours jumped up from his chair screaming for everyone to look at the bean field across the highway from the house. As we all turned to look we noticed something very large walking West to East aproximately 300 yards into the feild. It was a fairly clear and the moon was very bright that night. The animal/creature walked at a very fast pace through the beans to a point behind a hill where we lost sight of it. I have hunted my entire life and have never seen anything like this before. It walked leaning slightly forward, swinging it's arms as it moved across the field. At the distance it was from us the only thing we could notice is the size. I had been target shooting earlier that day and had a fire arm in my truck. My brother InLaw and I decided to go see if we could get a closer look at it. My 4X4 Ford truck was a former security truck so it was equiped with spotlights. We enter the field and drove to a point where we could see the trail heading to the East which we began to follow in the truck. We came to a barbed wire fence where one could tell something had crossed the fence and headed off into a tree line some 50 to 75 yards from the fence. WE sat there for maybe five minutes scanning the tree line with the spotlights and noticed nothing. I don't know if it was fear or common sense but we looked at each other and decided that whatever tore up the ground around the fence was too close for us to be sitting out in the field looking around in the dark. I put the truck into reverse and backed the entire way back out to the highway. This area is close to an old military base which stored ammo and bombs during WWII. There are numerous under ground storage bunkers a couple miles south of this area. No one at the gathering ever mentioned or talked about it again. I divorced 3 years later and have had no contact with my InLaws since then. I later heard tha tthey moved away from the old farmhouse to another town. I will submit the second occurance on a seperate report. ","classification":"Class B","county":"Saunders","state":"Nebraska","latitude":41.2333,"longitude":-96.42668,"latlng":"-96.42668,41.2333","locationDetails":"Location was on the South side of Highway 92, 3 miles east of Mead,Nebraska.","dewPoint":66.52,"humidity":0.82,"cloudCover":0.96,"moonPhase":0.32,"pressure":1014.8,"weatherSummary":"Rain in the morning and afternoon.","uvIndex":6,"visibility":6.49,"highTemp":73.55,"midTemp":68.565,"lowTemp":63.58,"precipitationIntensity":0.0155,"precipitationProbability":0.78,"precipitationType":"rain","windBearing":63,"windSpeed":8.17}
