{"id":"1261","observed":"Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').","classification":"Class A","county":"Valdez-Chitina-Whittier","state":"Alaska","locationDetails":"East side of Prince William Sound"}
{"id":"8000","observed":"Hello, My name is Doug and though I am very reluctant to post this story; I am going to do so anyways. The area that this happened  could not be a more unlikely area for a bigfoot occurance then or  especially now with all the development of the farmland in the last 25 years which has been extensive and at a phenominal rate. After reading many (if not every last report on this website) and coming across more that a few that have happened in improbable areas (bigfoot running down neighborhood streets and sightings/ vocalizations near condo areas), I decided there just might be some merit in submitting this for review. A skilled researcher might be able to shed some more light maybe. My friends parents owned a small somewhat defunct farm with (I'm guessing maybe 15-20 acres of land -not the best judge on that) They had 3 horses; 2 mares that were allowed out in the field areas; a stabled stallion, and a pony I believe. The barn was in dis-repair and part of the roof had collapsed years earlier. There was a large pond that was almost completely enclosed with an impenatrable thicket of briars ringing almost the whole cirmcuference of the pond, except for a small area that was kept open for access for the horses to water. Much of the property was overgrown with these same briars that tended to make big circular mounds here and there in the field. The house sat close to the road; the barn to the left and further behind. The extreme left side of their property was bordered by a small stream that edged along a small (100 ft x 30 ft) stand of very dense pine trees. These pines (species unknown) tend to have a very dense understory of almost horizontal dead, dry, branches due to years of growth an minimal sunlight. The lower end of this pine grove had a mowed lawn area (next door neighbors property who were also related to my friend family) You had to access the camping area through the neighbors propery as the overgrowth of briars and other weeds, brambles, trees made it impossible to get there directly for the E------- property. The pond in relation to the campsite was to the left if you were looking back up towards the road; with the stream running between. The dense pine grove then lay between you and the road; unless you skirted around it through the neigbors backyard. This is what happened. No sighting but a vocalization. We had gone down to the campsite had built a fire and been down there for about an hour. During this time we all felt uneasy even though we had been there before many times. This is a long time ago but to the best of my memory we had been joking; probably made something to eat over the fire but something felt really wrong this time. \"Wrong\" is the best word I can use to describe. I remember I felt like I couldn't just sit down by the fire and stay with the conversation though. From back in the pine grove was the occasional, deliberate braking of branches that were just a little too large (to the sophisticated human ear) and just had the sound of being \"up off the ground some ways\" This would start and stop. We would listen and comment on it. First we thought maybe the mares had gotten back into the woods, unusual but this later was confirmed not to be so because we found out the next day that they were stabled for the night. We then thought it might be some older boys who were trying to scare us into running. It would be quiet for awhile then there would be a sense of movement closer to where we were and then receeding. We shined a flashlight and ventured back alittle ways but saw or smelled nothing. The sounds began again this time definately agitated, insistent with a very permiable feeling. We started to get un-nerved  moved out into the neighbors backyard. The sound grew louder, with traceable movement and then this ear splitting scream cut right out into the night. One loud shriek louder than anything should have to be. It just cut right to the core of your soul. Like so many reports I've read on this website, it's virtually impossible to do it justice with a human description precisly because it sounded so inhuman. We just ran like hell back to the house, left everything behind. No sense of being followed at all. No visual sighting (I almost wish). No bad smells or odors. In terms of other reports this pales, I know. But this is what happened and I never forgot it. We knew what Sasquatch were at the time, but no one ever heard of sightings east of the Mississippi to the best of my memory then. We kind of joked that maybe that's what our unseen friend was. Years later when I read and saw the reports from the southern part of York County (report on file with your website.) did I ever give any serious thought.","classification":"Class B","county":"York","state":"Pennsylvania","locationDetails":"I would rather not have exact location (listing the nearest road) to repect the privacy of the family that still owns the property. I have long since had a falling out with my friend at the time and don't feel he or they would like being approache about this. I like my own privacy respected; so I must accord others the same. The general area at that time was more open farmland with some large housing developements (in which I lived) within a mile. There were a good deal of homes scattered here and there and others in smaller developments. A very large animal like a Sasquatch could conceivably navigate (migrate) through an area like this at night using farmland as cover; but absolutely not stay very long in an area like that even then without revealing it's presense. I can give you more specific details on topography. Farmland opens up eventually much more to the north with a State Park (Gifford Pinchot) at the north end of the county. Southern end of York county where the  sightings occurred is a more likely area given in terms of what I've read of similar topography of other sighting then. Also much more rural and forested in the early \"70's."}
{"id":"703","observed":"It was May 1984. Two friends and I were up in the hills nw of Yamhill, OR, late in the evening, around 10:30 pm. We heard the scream, a VERY low, very long howl. Not a coyote, bear or cougar. Have heard all of them before. This was nothing like anything I have ever heard. I still remember thinking to myself \"How in the hell can something make such a low howl.\" It scared us at first, but is sounded like it was far away, like maybe a mile or so. We were drinking a little beer, so after awhile we relaxed and forgot about it. It must have been about a half hour later when we heard it again. I swear that it had to be within 30 yards of us. Same loud, low howl, but MUCH closer. And it sounded pissed. I could feel the sound vibrations bouncing off the back of my neck. The hair stood up on the back of all of our necks. All of us turned white as hell, and our jaws dropped past our knees. The howl seemed to say \"GET OUT!\" Which is EXACTLY what we did. I just looked at the two other guys and said \"lets get the @#$ outta here \". We did not see anything, but felt the presence. I grew up within 10 miles of that spot. I had never heard that sound before, or since, EXCEPT on a television show that had a report of a bigfoot sighting. A guy in Idaho caught one on video (at least it looked like one), but when I saw the video, I heard that scream again. The guy taking the video threw the camera in the ditch, and hid. It was the SAME scream. ONLY other time that I have EVER heard it. It was EXACTLY the same scream. I saw this video on a news show, something like \"Real TV\" while in Fairfax, VA, in 1992 or 1993. I do not know EXACTLY what it is that we heard, but I know what I think it was. Bigfoot. That is my story, and I have two wittnesses to back me up.","classification":"Class B","county":"Yamhill","state":"Oregon","locationDetails":"Logging roads north west of Yamhill, OR, about 15 miles."}
{"id":"9765","timestamp":118022400,"title":"Motorist and children have daylight sighting near Burns Flat.","observed":"My two children and I were returning from Altus,  Oklahoma to Burns Flat, Oklahoma in the fall of 1973 when a very large black man-like creature crossed the highway moving from west to east. I was driving and my son (age 11) was sitting in the front seat beside me and my daughter (age 12) was sitting in the back seat leaning forward between the driver and passenger seat. It was a clear sunny day about 3 PM and there was a lull in the conversation. It was quiet in the car, we did not have the radio on and all three of us were happened to be looking straight ahead. I noticed a movement on the left side of the road and was amazed to see a what I percieved to be a very large black man-like creature rise from a squatting position and run across the two lane highway about 30 yards ahead. It ran across the highway, covering the distance in only three steps, I estimate the creature to have been at least 8 feet tall, it glanced briefly in the direction of the car and I instictively applied the brake so as not to hit it. It ran into the bar ditch on the east side of the road and ducked into some brush and large bushes between the ditch and the barbed wire fence. It had hair that looked rather silky as it ran, I remember seeing the hair move as it ran. The hair did not appear to be stiff like an animals hair but more soft and shiny. Both children saw it too and said \"What was that, mama?\" I said I didn't know, they wanted me to stop the car, but I was frightened that my children and I could be harmed by something I had never seen before in my life. I didn't tell anyone what I had seen and cautioned the children not to say anything either.","classification":"Class A","county":"Washita","state":"Oklahoma","latitude":35.3011,"longitude":-99.1702,"latlng":"-99.1702,35.3011","locationDetails":"The creature crossed from one cattle pasture to another, it may have been leaving a pond on the east side of the highway.","dewPoint":50.86,"humidity":0.73,"cloudCover":0.16,"moonPhase":0.07,"pressure":1017.29,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":6,"visibility":10,"highTemp":72.55,"midTemp":63.225,"lowTemp":53.9,"windBearing":263,"windSpeed":8.15}
{"id":"4983","timestamp":49852800,"title":"Sighting and vocalizations at a home in Wayne National Forest","observed":"I was staying the night with a friends of mine. It was late at night we were watching TV waiting on his parents to come home. We heard a noise out front and I looked out the window in the door to the mobile home. A large face was looking in the window. The face had a very heavy brow with deepest eyes, the nose was wide and flat with flared nostrils. The lips were thick and rubbery looking with thick block like teeth. The hair was about one inch long on the face and it sweptback from the brow with a large lump standing up on the top of the head. The head sat on the shoulders with no sigh of a neck. It let out a scream and it pushed off from the door. My friend grabbed his 22 rifle and we went out the back door in time to see it step NOT JUMP but step over a 3 strand barb wire fence and run in a hunched over motion with it's arms swinging it's hands below it's knees. The next day we looked for tracks but found none. We did measured the distance from the ground to the window of the door (there was no front steps) 7'6\".","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.38745,"longitude":-81.67339,"latlng":"-81.67339,39.38745","locationDetails":"Vincent, Ohio (In theWayne National Forest)","dewPoint":62.45,"humidity":0.82,"cloudCover":0.86,"moonPhase":0.32,"pressure":1022.74,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":6,"visibility":4.97,"highTemp":76.32,"midTemp":70.44,"lowTemp":64.56,"precipitationIntensity":0.0006,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":156,"windSpeed":3.02}
{"id":"26566","timestamp":1064016000,"title":"Man observes tall, white hair-covered creature during a family gathering near Lake Ontario","observed":"My family had moved from the city of Rochester to Wolcott, a small town about 50 miles east of Rochester in July 2003. We were living in an old farmhouse on approx. 77 acres of woods & creeks near Lake Ontario. This incident happened sometime between the 18th-20th of September. My sister's birthday is the 20th and I recall a small group of family and friends were visiting the house for that occasion. My future-stepfather took a small group, including his brother, my four sisters, and a few other friends out for a \"tour\" of the property. I was not present, I had stayed behind at the house. As the group returned to the house, my stepfather lingered behind in an area of the property where a strip of woods runs between two fields. My stepfather was in the field closer to the house, we'll refer to it as field #1. He noticed to his left something in the woods and turned to see a tall, white, hair covered creature standing just off the path in the woods. He ran ahead and told his brother, but did not tell the rest of the group. His brother rushed into the house to get me, telling me that something was in the woods and I should come see. I followed him outside where my stepfather relayed the story to me and the three of us walked back to the area of his sighting. As my stepfather showed me the spot where the creature had been standing, we all noticed that the creature was still present, but had moved further back, to field #2. At this point, the three of us were standing in field 1 and looking through a small strip of trees at the creature in field 2, maybe 200 yards away or so. My observations of the creature are as follows: It was approximately 7' tall, covered in hair, white but with a dark area on the face, think and lanky, with a head that came to a slight conic shape. It was too far to distinctly see its face but there was a definite darker colored area where the face would have been. The creature was clearly observing us, as it paced back and forth, looking around trees, standing up taller, ducking down, etc. to get a better look at us. After approximately 45 seconds, the creature retreated to an area where we couldn't see it clearly. I walked through the trees into field 2 to get a better look at it, but it had disappeared. The area where it had been walking was matted down, but there were no distinct prints. Judging by nearby trees, I estimated its height to be 6.5 - 7 feet.","classification":"Class A","county":"Wayne","state":"New York","latitude":43.27314,"longitude":-76.89331,"latlng":"-76.89331,43.27314","locationDetails":"East on Route 104, near town of Huron.","dewPoint":54.06,"humidity":0.75,"cloudCover":0.48,"moonPhase":0.81,"pressure":1020.75,"weatherSummary":"Partly cloudy until evening.","uvIndex":4,"visibility":9.53,"highTemp":67.62,"midTemp":58.16,"lowTemp":48.7,"precipitationIntensity":0.0006,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":253,"windSpeed":8.73}
{"id":"5692","timestamp":20995200,"title":"Father and son hear vocalizations on Peavine Mt","observed":"I grew up in Northwestern Nevada along the California border in the foothills of the Sierra's.  My father was a geologist who preferred working and camping in areas that were as sparsely populated as possible.  Between 1970 and 1983 I had a number of encounters in Nevada, California, and Washington states.  I plan to submit them individually in chronological sequence so that I can provide as much detail for researchers as possible. This first encounter occured in 1970 on Peavine Mountain Northwest of Reno, Nevada.  I was ten at the time and tagging along with my father, who was hunting deer.  We were on the Western side of the mountain, close to the California border.  We were between two ridges crossing a meadow on the Western face of the East ridge.  It was about 3:30 PM and the sun was beginning to drop behind the trees on the Western ridge.  There were no clouds and it was still very bright in the meadow, but the shallow draw between the two ridges was heavily shadowed. As my father and I neared the center of the meadow we heard an extended call coming from the West.  We had lived in Kansas until I was eight and the call reminded me of the World War II air raid siren they used for tornado alerts where we used to live.  It began low and relatively quiet and rose in both pitch and volume as it progressed.  It lasted for about fifteen to twenty seconds before rapidly dropping off.  After about ten seconds the call was repeated.  It seemed to me that it was coming from the draw a couple of hundred yards West and downhill from us.  Unlike the tornado siren I was familiar with, it had a mellow, rather than harsh, or mechanical, quality to it. As the second call ended I asked my father what was making the noise.  Annoyed, he told me that it was just the siren from a fire tower and picked up his pace.  That seemed reasonable, and I began looking around at the surrounding high ground for the tower when the call sounded a third time.  It seemed to be coming from the draw and seemed to be moving away from us. I caught up with my father and, being a curious ten-year old, asked him in rapid succession where the tower was and if he smelled any smoke.  He replied that it was on the other side of the far ridge and that they were just testing the siren.  I told him I thought the call was coming from the draw and at that point was told to shut up.  As the call sounded a fourth time, even further away, my father listened to it and then decided to call it a day.  We walked to the jeep and drove home without further incident.","classification":"Class B","county":"Washoe","state":"Nevada","latitude":39.592,"longitude":-119.975,"latlng":"-119.975,39.592","locationDetails":"The Western face of Peavine Mountain, Northwest of Reno Nevada.","dewPoint":43.89,"humidity":0.42,"moonPhase":0.02,"pressure":1011.96,"weatherSummary":"Clear throughout the day.","uvIndex":9,"visibility":9.76,"highTemp":88.56,"midTemp":70.22,"lowTemp":51.88,"windBearing":197,"windSpeed":1.96}
{"id":"438","observed":"heh i kinda feel a little dumb that im reporting this but its bothering me so here goes.. bout a month ago i was with a friend and her son, we were hanging out at a camp ground by Allamuchy state park, in Warren county NJ. i think the camp ground was part of Stephens state park either way it was on the Musconetcong river. it was late in the day and we were just walking on the trials by the river. we figured since her son was gonna stay with her folks that evening we would come back later and spend the night at the camp ground. we went home and got together some gear, just sleeping bags and sleeping pads. we stopped at a store got some hotdogs and rolls and a gallon of water then headed to the camp site. it was about 10pm when we got to the camp site and i think we took spot 19. it was close to the road one of the last spots before ya hit the road maybe 50 yards or so. we made a fire in the metal fire ring and just sat around till about 1am, there were maybe 5 or 6 sites that were camped that night one was taken by some boy scouts. at about 1am my friend got in her sleeping bag next to the fire, i was still up drinking hot chocolate and stareing into the fire, about 20min or so later i got into my bag next to her and was lieing on my side looking into the woods. i wasnt comfortable and i laid awake for a good hour or so just thinking and listening to the sounds of the woods and the river that was 100yards tops away from me. then i heard a sound like someone was lightly banging a fork or something against a plate. i thought maybe a bear was snooping around looking for a free meal, this is bear country and we have a very healthy black bear population, but maybe 30 seconds after i heard the metalic sound i heard someone or something bang a branch against a tree 4 or 5 times in a row, i thought that the bear maybe was getting a little to close to someones camp site. then i again heard banging against a tree but this time it was a bout 100yards into the woods and not near any camping area that i had seen in the daylight. then the tree banging came from the first spot as if answering the other position. the first tree banger was what seemed to be on or near the road by the middle of the camp ground. that kinda made my mind wander i was wondering what was going on..and who is up making all this noise. about 10minutes later i looked into the woods which were slightly iluminated by my dieing fire and i saw what looked like a bear looking into my camp about 20 feet away from behind a tree. i saw just the shadowy outline of it. i could see its head and shoulders slowly move out from behind the tree look in and then move back behind the tree. ive seen bears do this before in the day light but never this close. then i closed my eyes waited a few seconds and opened them just to make sure i wasnt seeing things. but this whatever it was had difined shoulders and a rounded kinda pointy on top head, it didnt have and ears like you would see on a bear, nor the flat head of a bear and if it was a bear its front arms wouldnt have given it the squared off shoulders that i was seeing in the silloette of this figure. i got kinda scared for a few moments and didnt move a at all. i thought for a second about jumping up and yelling at it but i didnt want so get it mad at me or scare it. i closed my eyes and tried my hardest just to fall asleep. i dozed off finally and was awoken by my friend who was yelling at me for not putting the bag of hotdogs in the car before going to sleep. we had in the bag a apple and a orange, rolls and a unopend pack of hotdogs, i tied the bag with a simple knot like you would tigh your shoes the night before, but when i got up the only thing left where the bag was, was the orange just sitting there on the ground. my friend said somthing along the lines of wow a bear came and stole our hotdogs. i kinda was wondering what was going on so i decided to have a look around where i saw the figure the night before, i remembered that the shadowy figure was hiding behind the tree and i could see a branch just above its head maybe a foot or so higher than the top of the figure. it was puzzleing because that branch must have been 8 or 9 feet off the ground and black bears where i come from dont stand that tall on there hind feet. i didnt try to tell her what i heard or saw the night before because she wouldnt have belived me anyway, but ive spend lots of time in the back country and woods hunting, fishing, rock climbing, and backpacking. i know what bears look like up close as well as from a distance. and this wasnt a bear and to tall for a person. i didnt smell anything but i think i was up wind anyway and we were burning wood in the fire and all i could really smell was the fire anyway. the thing that really bothers me is the tree banging its was allmost like something was comunicating with something else. it also bothers me that something waited until it was sure that i was asleep before coming into camp. in which case it woulda been 6 or 7 feet from where we were sleeping in order to open the bag and have a look in it, then disguard the orange and take the rest bag and all. it wouldve had to make some sound if it just tore the bag opened. i looked around before we left to see if i could find any tracks or anything but the ground is was just to hard, there was a few game trails but i didnt look very far or spend alot of time looking. i looked on the internet and found this sight and was surprized to see other sitings in new jersey.","classification":"Class B","county":"Warren","state":"New Jersey","locationDetails":"the road is off us rt 80, i dont know the exit number just how to get there if im driving will try to find out the details."}
{"id":"55269","timestamp":1465257600,"title":"Dawn sighting at Stevens Brook outside Claremont","observed":"I was on my way to Claremont from Lebanon on Rte 120 and was passing by some reeds in a marshy area next to the road that sounded like a huge flock of birds. The creature came out of the reeds and was crouched down looking at me through them. Surprisingly it got out of the reeds from crouched to standing turned around and ran towards the wooded area up a hill and was moving with it's arms brush and tree branches out of the way. It was incredibly fast runner and I got a good look at its coconut shaped head as it ran away. It was light brown/brown. It had incredibly broad shoulders. I went back the same day. The marsh went up to my knees and I could smell a bad odor like garbage. Myself and a friend went back to the sighting. We found a footprint and a hair sample. I could hear wood knocks when my friend James did a call and we also found a large bed of branches and some tree structures. The following month I went back to Claremont and I heard screeching in the woods while I was traveling Rte. 120 on a bicycle.","classification":"Class A","county":"Sullivan","state":"New Hampshire","latitude":43.41549,"longitude":-72.33093,"latlng":"-72.33093,43.41549","locationDetails":"Close to Claremont down 120 not far from Kingston road.","dewPoint":54.25,"humidity":0.73,"cloudCover":0.22,"moonPhase":0.1,"pressure":999.41,"weatherSummary":"Rain in the evening.","uvIndex":8,"visibility":9.47,"highTemp":75.83,"midTemp":65.75,"lowTemp":55.67,"precipitationIntensity":0.0057,"precipitationProbability":0.3,"precipitationType":"rain","windBearing":234,"windSpeed":2.47}
{"id":"6410","timestamp":299894400,"title":"Multiple witness sighting at night, 3 miles east of Mead, Nebraska","observed":"First of all this happened in the summer of 1979 on the 4th of July. This is the first of two possible encounters I have experienced over 22 years. The second occurred on November 10th in 2001. We had just finished lighting our 4th of July fireworks and were sitting around the patio talking and relaxing. There were probably 8 adults and 6 kids at my former InLaws farm house. It was around 11pm when a friend of ours jumped up from his chair screaming for everyone to look at the bean field across the highway from the house. As we all turned to look we noticed something very large walking West to East aproximately 300 yards into the feild. It was a fairly clear and the moon was very bright that night. The animal/creature walked at a very fast pace through the beans to a point behind a hill where we lost sight of it. I have hunted my entire life and have never seen anything like this before. It walked leaning slightly forward, swinging it's arms as it moved across the field. At the distance it was from us the only thing we could notice is the size. I had been target shooting earlier that day and had a fire arm in my truck. My brother InLaw and I decided to go see if we could get a closer look at it. My 4X4 Ford truck was a former security truck so it was equiped with spotlights. We enter the field and drove to a point where we could see the trail heading to the East which we began to follow in the truck. We came to a barbed wire fence where one could tell something had crossed the fence and headed off into a tree line some 50 to 75 yards from the fence. WE sat there for maybe five minutes scanning the tree line with the spotlights and noticed nothing. I don't know if it was fear or common sense but we looked at each other and decided that whatever tore up the ground around the fence was too close for us to be sitting out in the field looking around in the dark. I put the truck into reverse and backed the entire way back out to the highway. This area is close to an old military base which stored ammo and bombs during WWII. There are numerous under ground storage bunkers a couple miles south of this area. No one at the gathering ever mentioned or talked about it again. I divorced 3 years later and have had no contact with my InLaws since then. I later heard tha tthey moved away from the old farmhouse to another town. I will submit the second occurance on a seperate report. ","classification":"Class B","county":"Saunders","state":"Nebraska","latitude":41.2333,"longitude":-96.42668,"latlng":"-96.42668,41.2333","locationDetails":"Location was on the South side of Highway 92, 3 miles east of Mead,Nebraska.","dewPoint":66.52,"humidity":0.82,"cloudCover":0.96,"moonPhase":0.32,"pressure":1014.8,"weatherSummary":"Rain in the morning and afternoon.","uvIndex":6,"visibility":6.49,"highTemp":73.55,"midTemp":68.565,"lowTemp":63.58,"precipitationIntensity":0.0155,"precipitationProbability":0.78,"precipitationType":"rain","windBearing":63,"windSpeed":8.17}
{"id":"751","timestamp":956275200,"title":"Hunter describes described being stalked near Minot","observed":"While this incident occurred a long time ago, it may be ofsome use, as I have never heard of any such sighting in North Dakota. Whilecoming back from a hunting trip outside of Minot, North Dakota in aroundthe third week of April, in 1962, a friend of mine and I were followedby a creature as we returned in the direction of the trailer park in whichwe lived. (My father was working for the Department of the Air Force onthe Missile site Installations at the time.) After walking back from somedistance out on the prairie, I had the distinct feeling that someone orsomething was following us. Eventually I became so uncomfortable that Idid look over my right shoulder and saw at a distance of about 50 yardsor so, what I thought at first was a great ape. I cannot describe to youwhat I felt at that moment. It fixed me with it's eyes and stood up onit's hind legs when it saw that it had been seen. As all I had was a singleshot .22, shooting it was out of the question. I got a real good closelook, long black shiny hair, oily looking, and it rose from all fours onto it's hind feet.(I am certain it had followed us for some time). Verytall. No hair on the face above it's nose or the palms of it's hands. Longarms. Very malevolent expression conveyed to me. I cannot overemphasizethis. It began to move in our direction. (I was with a partner). Both ofus ran as fast as we could. We didn't look back after this.","classification":"Class A","county":"Ward","state":"North Dakota","latitude":48.25422,"longitude":-101.3166,"latlng":"-101.3166,48.25422","locationDetails":"Ward County, Just outside of a the Minuteman Trailer Park,outside of Minot, North Dakota.","dewPoint":30.46,"humidity":0.31,"cloudCover":0.3,"moonPhase":0.6,"pressure":1011.97,"weatherSummary":"Partly cloudy until evening.","uvIndex":5,"visibility":9.48,"highTemp":79.1,"midTemp":59.085,"lowTemp":39.07,"windBearing":235,"windSpeed":9.79}
{"id":"3339","timestamp":574387200,"title":"Deep impressions seen in the snow","observed":"In early spring 1988, some friends of mine and I were traveling up the road to the top of Mt. Mitchell in a four-wheel drive vehicle. Mt. Mitchell is the highest peak east of the Mississippi River at 6,684 feet, and as a result, the mountain gets heavy snowfalls well into March and sometimes April. There had been some heavy snowfall in the weeks preceding our drive, and there were some deep snowdrifts piled up alongside the road, although the road had only a dusting of light snow on its surface. Almost no one goes up on the mountain in the wintertime, and as I remember it, we had to skirt our way around a barricade to even get on the road to the summit. We reached the top of the mountain, then turned around to drive back down. About a half mile below the summit, we went around a sharp, left-hand turn, and our headlights hit the steep bank beside the road. In the snow on the bank we could see several deep impressions that led up the bank and into the woods. We got out and examined the marks, but it was dark and we couldn't tell much about them. The next day, we drove back up and looked at the marks in the daylight. The tracks, as we took them to be, were in deep snow, and we could see mud at the bottom of them and measured the depth of the snow at 18 inches.  In the two tracks closest the road, there were faint outlines that could have been toe marks, but there were no claw marks visible as with bear tracks. The prints were apparently made by a bipedal animal, and led up a steep bank and disappeared over the top of the bank about 75 yards up the slope.  The bank beside the road was extremely steep, and it took my friend, who is 6-2 and athletic, eight long strides to climb the bank, but whatever left the prints needed only two steps. At one point, the animal had stepped over a fallen branch approximately three feet off the ground without breaking stride. I know sometimes big cats can leave footprints that appear to be two-legged, and there are still some panthers (mountain lions) left in the mountains of North Carolina, but if a cat made these marks it would have to have been the biggest panther in the world. They were about 14 inches long and seven inches wide. We thought perhaps the marks could have been made by clumps of snow falling from trees, but there were marks where there were no overhanging branches. We split up that day and two different groups walked along the road about a mile in each direction from the prints, but we never found where the animal had crossed the road, which means it was obviously using the road for traveling instead of trudging through the deep snow.","classification":"Class B","county":"Yancey","state":"North Carolina","latitude":35.74875,"longitude":-82.26195,"latlng":"-82.26195,35.74875","locationDetails":"Yancey County, North Carolina, near the summit of Mt. Mitchell","dewPoint":10.97,"humidity":0.49,"cloudCover":0.46,"moonPhase":0.91,"pressure":1015.08,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":6,"visibility":9.37,"highTemp":35.65,"midTemp":30.035,"lowTemp":24.42,"precipitationIntensity":0.0002,"precipitationProbability":0.23,"precipitationType":"snow","windBearing":322,"windSpeed":10.39}
{"id":"1757","timestamp":598147200,"title":"Two separate sets of large footprints found","observed":"The foot prints of two bigfoot creatures who had visited the ranch house my son and his family were renting. The day before these tracks appeared my daughter-in-law and I had hiked about a mile up the gulch looking for deer tracks. In backtracking the tracks of the two creatures we found that they had come upon our tracks at the head of the gulch and had followed them back to the  house and that the larger of the two had gone all around the house, barn and fields below the house. The smaller one stayed out by the rabbit hutches and had curiously curled feet.  The larger creatures prints measured 17 inches and the smaller one's prints measured 14 1/2 inches around the curved foot. We took pictures of the prints and the thing that struck us most about prints was that the creatures had to have been massive as it was very cold and the snow and ice on the ground was frozen so hard that we could jump up and down without breaking through to the ground, but every print of both creatures went completely through the ice.  We did not see the creatures them selves, only their prints.","classification":"Class B","county":"Silver Bow","state":"Montana","latitude":46.05292,"longitude":-112.571,"latlng":"-112.571,46.05292","locationDetails":"At Bull Run Gulch just northwest of Walkerville, Montana, a suburb of Butte, Montana.","dewPoint":3.96,"humidity":0.73,"cloudCover":0.22,"moonPhase":0.23,"pressure":1041.91,"weatherSummary":"Partly cloudy starting in the afternoon, continuing until evening.","uvIndex":1,"visibility":9.99,"highTemp":19.43,"midTemp":11.16,"lowTemp":2.89,"windBearing":216,"windSpeed":3.29}
{"id":"13494","timestamp":1136419200,"title":"Sundown sighting near Tishomingo State Park","observed":"At about 5pm January 5, 2006, I was returning home from a trip to Florence Alabama via the Natchez Trace Parkway. About fifty yards north of mile marker 307, a creature darted across the road between my car and another coming the opposite way. It was solid black and looked to be between 4 1/2 feet tall and 5 feet tall and was running on 2 legs. I could not clearly make out any features in part because it was near sunset and in part because of the speed at which it ran. It appeared to running alongside the road heading down the southbound lane and very quickly turned and crossed the road. It stumbled slightly at the edge of the road and swung its arms to regain balance then continued across the road and into the tree line. I don't care to speculate how fast it was moving but I'm sure it was faster than a human, maybe about as fast as a deer can run. I stopped when I got to where it crossed but I did not see anything else. My wife who was with me did not spot it and if the people in the oncoming car spotted it, they made no indication.","classification":"Class A","county":"Tishomingo","state":"Mississippi","latitude":34.60905,"longitude":-88.19894,"latlng":"-88.19894,34.60905","locationDetails":"Natchez Trace Parkway, approximately fifty yards north of mile marker 307.","dewPoint":33.86,"humidity":0.68,"cloudCover":0.43,"moonPhase":0.21,"pressure":1016.63,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":2,"visibility":9.04,"highTemp":51.42,"midTemp":43.535,"lowTemp":35.65,"windBearing":342,"windSpeed":9.13}
{"id":"27261","timestamp":1195344000,"title":"Couple witness rocks thrown and possible vocalizations between two animals on either side of a fishing dock near Williamsville","observed":"My wife and I were night fishing off the docks of chaonia landing at lake wappapello in late fall early winter 2007. At around midnight we heard rocks being thrown into the lake from across the bank.  we went to the end of the dock to see what was going on. coming down the bank along the waters edge rocks were being thrown into the water about every 50 feet or so, big rock the size of bowling balls. the bank I'm speaking of is actually an island with water on three sides of it for about 5-6 miles, and it ends right in front of the boat docks we were fishing. coming straight towards us along the bank something was throwing these boulders into the water, when out of the trees came a rock straight at us and landed in the water 6 feet in front of us followed by a very deep growl and grunt.  the distance from the end of the dock and the opposite bank is maybe 50 feet. we stood there looking into the trees desperately trying to see whatever was growling at us yet it stayed just inside the tree line.  the lights from the docks light up the whole opposite bank from point to point.  up and down the bank this creature went tossing rocks and growling and screaming.  then we noticed another creature on our side of the bank coming down towards us throwing rocks into the water howling after each rock hit the water.  the two were doing this in unison up and down the bank for over an hour while we were trapped on the dock in fear.  the one caught on the island worked his way into a huge angry fit. the two seemed to be letting the other one know where the other was.  there is so much we witnessed, heard saw that i cant possibly write all down here. for nearly two hours we stood terrified as we realized what we were experiencing. we have not really told our story to any other than family. its too unbelievable.","classification":"Class B","county":"Wayne","state":"Missouri","latitude":36.57869,"longitude":-90.21339,"latlng":"-90.21339,36.57869","locationDetails":"if you look at the location of chaonia landing you'll note it sits in the middle of three points of land surrounded by the waters of lake wappapello. these two creatures were across the water from each other trying to find a path back together. eventually they went off in the direction they came continueing to call to each other.","dewPoint":45.96,"humidity":0.79,"cloudCover":0.45,"moonPhase":0.28,"pressure":1019.67,"weatherSummary":"Mostly cloudy starting in the afternoon.","uvIndex":2,"visibility":7.16,"highTemp":64.8,"midTemp":61.935,"lowTemp":59.07,"windBearing":112,"windSpeed":2.6}
{"id":"1158","timestamp":-416966400,"title":"Child encounters a man-like creature in a shed.","observed":"As a child I was between 10 or 12 years old, at the time the incident happened. we were visiting my grandmothers house as we often did on the weekends. A bunch of the grandchildren including myself were playing hide & seek it was nearing sun down I kept getting caught early in the game & decided to venture outside of the fenced area and up the gravel road about 200 yards to an old corn crib in a field next to the road. If my memory serves me right the crib was next to empty, the door was facing away from the road and it was starting to get dark, I entered the crib in a hurry not paying any attention to what may be in the crib, while looking through the cracks in the crib towards the house to see if anyone had seen me enter, I heard a heavy breathing behind me, upon turning around what I saw was indescribable for a kid my age, this huge man like creature was standing over me just staring at me he was hairy and huge it made no sounds and smelled some what like a hog pen which everyone raised in that area and time. After wetting my pants and running like a bat outof hell back to the house crying and scared to death, I told my uncle what I had seen, only he did not take me serious and started making fun of me, because I had peed my pants. I will swear to this day what saw was a bigfoot.","classification":"Class A","county":"Washington","state":"Missouri","latitude":38.039,"longitude":-90.7517,"latlng":"-90.7517,38.039","locationDetails":"Between DeSoto & Potosi on old Missouri Highway 21.","dewPoint":52.63,"humidity":0.57,"cloudCover":0.65,"moonPhase":0.37,"pressure":1021.42,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":3,"visibility":9.82,"highTemp":81.64,"midTemp":70.22,"lowTemp":58.8,"windBearing":175,"windSpeed":6.51}
{"id":"30159","timestamp":627350400,"title":"Recollection of a possible nighttime encounter on a four-wheeler near Sullivan","observed":"It was winter of 1989.  What I saw scared the **** out of me.  Me, my sister and her friend found the keys to my brothers 4-wheeler and decided to sneak it out @ approx 10:30 pm on a snowy winter night. Nobody knew we were going to do this, so there is no way anyone could have been waiting for us in a costume or anything.  Plus nobody knew I even knew how to operate a 4 wheeler (including myself).   We headed out to the woods behind our parents house and half way down a steep hill the 4 wheeler took off flying and when I figured out what gear to put it in the 4 wheeler stopped and my sister and her friend jumped off.  I recall smelling something \"dead\" then I heard something that sounded like Monkeys (yes multiple) fighting.  When I looked towards the trees I see this huge monster walking out.  This thing was at least 7.5 or 8 ft tall and standing straight up with huge long arms and legs. As it was walking towards us it made a deep growling angry noise.  I took off on the 4- wheeler and my sister and her friend were running as fast as they could to catch up.  I looked back a few times and recall thinking- this thing is walking but one of it's steps was equal to 20 of mine.  We were in a panic we were all screaming and the louder our screams the deeper it's growl got. By the time my sisters friend had grabbed her arm and yanked her onto the 4 wheeler, it was within it's arms reach of us but never tried reaching out to hurt us. It was obvious he or she wanted us out of there.  I was only about 13 at the time so I wasn't wise enough to call someone to come research it.  I believe our parents just thought we were making it up.  And of course, I was way to scared to go back and track foot prints or anything.","classification":"Class B","county":"Washington","state":"Missouri","latitude":38.11468,"longitude":-91.06547,"latlng":"-91.06547,38.11468","locationDetails":"Do not post this information.  My parents have since sold a portion of this property and we do not want the new owners to be bothered.","dewPoint":14.35,"humidity":0.48,"cloudCover":0.23,"moonPhase":0.7,"pressure":1026.39,"weatherSummary":"Partly cloudy until afternoon.","uvIndex":2,"visibility":9.47,"highTemp":40.9,"midTemp":36.305,"lowTemp":31.71,"windBearing":293,"windSpeed":0.96}
{"id":"27800","timestamp":1274745600,"title":"Large unknown animal on all fours seen crossing a road near Patterson","observed":"WE WERE DRIVING ALONG HIGHWAY 35 THROUGH WAYNE COUNTY MO.  A SECTION OF THE HIGHWAY WITH THE TREELINES CLOSE TO BOTH SIDES OF THE HIGHWAY.  THERE WERE WAIST HIGH WEEDS LEADING FROM THE TREELINE TO THE ROAD.  AS WE APPROACHED A SMALL BRIDGE WE SAW A LARGE BLACK FIGURE COME FROM THE LEFT OUT OF THE TREE LINE AND THROUGH THE WEEDS.  IT WAS ABOUT 50 YARDS IN FRONT OF US SO WE SLOWED DOWN NOT TO HIT IT.  IT CROSSED THE ROAD IN A GALLUP, RUNNING DIAGONALLY AWAY FROM US. THE LARGE FIGURE, RUNNING ON ALL FOURS, HAD A LOT OF CURLY MATTED NASTY LOOKING HAIR.   IT HAD ALL KINDS OF DIRTY AND STRAW AND OTHER THINGS STUCK IN THE MATTED MESS.  ITS FRONT ARMS WERE LONG, MUCH LONGER THAN ITS SQUATTY REAR LEGS.  THE CREATURE HAD POWERFUL SHOULDERS AND HIPS.   I WOULD SAY IT LOOKED MALNOURISHED AND THAT IT HAD MANGE.  AS SOON AS IT WAS THERE IT WAS GONE.  THE ONLY WORDS WE COULD MUSTER WAS \"WHAT THE HELL WAS THAT\"?  I URGED MY FRIEND TO STOP THE CAR TO LOOK BUT HIS FOOT HIT THE ACCELERATOR AND WE DROVE OFF.  HE WOULDN'T SAY BUT HIS EYES WERE SO WIDE I COULD TELL HE WAS SPOOKED.  I WOULDN'T HAVE GOTTEN OUT.  IT WAS THE FREAKIEST THING I HAVE EVER SEEN.  IT WAS LIKE NO OTHER ANIMAL I HAVE EVER SEEN.  SOME HAD SUGGESTED IT WAS A FERREL HOG.   BUT IT WAS NO HOG,  I WOULD ACCEPT MAYBE A SICKLY BLACK BEAR,  BUT I SAW NO EARS OR SNOUT. JUST A MOUND OF LONG BLACK MATTED HAIR","classification":"Class B","county":"Wayne","state":"Missouri","latitude":37.18847,"longitude":-90.52135,"latlng":"-90.52135,37.18847","dewPoint":65.98,"humidity":0.76,"cloudCover":0.11,"moonPhase":0.43,"pressure":1015.83,"weatherSummary":"Clear throughout the day.","uvIndex":11,"visibility":7.79,"highTemp":86.2,"midTemp":76.61,"lowTemp":67.02,"precipitationIntensity":0.0018,"precipitationProbability":0.34,"precipitationType":"rain","windBearing":119,"windSpeed":1.68}
{"id":"39764","timestamp":1360972800,"title":"Possible night screams heard near Burnsville","observed":"I was out last night walking our dogs; I walk them one at a time which usually takes about 15 minutes.  I heard what sounded like what I've heard the investigators on FINDING BIGFOOT do when \"callling\" to a bigfoot.  It was coming from about 1 mile away from the Tombigbee Water Way.  We're on the west side of the waterway.  We're in a rural area and are accustomed to hearing a variety of animal noises but, I've never heard this sound before.  We hear coyotes all the time and I suppose it's possible this could have been a coyote but, it struck me as being a sound like I've heard the investigators making on tv.  I heard it twice during the time I was out with the dogs and even mentioned it to my husband when I came in. Please understand that I did NOT see anything.  I only heard what sounded like what I've heard on the television show which sounded nothing like what I'm used to hearing out here.","classification":"Class B","county":"Tishomingo","state":"Mississippi","latitude":34.735,"longitude":-88.26655,"latlng":"-88.26655,34.735","locationDetails":"Removed to protect privacy of witness.","dewPoint":18.8,"humidity":0.55,"cloudCover":0.29,"moonPhase":0.22,"pressure":1022.78,"weatherSummary":"Partly cloudy until evening.","uvIndex":3,"visibility":9.9,"highTemp":40.01,"midTemp":31.41,"lowTemp":22.81,"windBearing":330,"windSpeed":7.37}
{"id":"25662","timestamp":1187136000,"title":"Hiker spots a bigfoot in the mountains east of Butte","observed":"I live in Butte, Montana. This is a city mostly on a hill, but stretches down into a valley. On the east side, there is a great stretch of mountains known as the east ridge. This is where I was when I saw a sasquatch. In the middle of the hill, south of the Lady of the Rockies, there are two smaller hills jutting out of the middle of the hill. I was on the northern side of the southernmost small peak, heading down to go back to my vehicle. I was heading through some trees when I looked to the north at the other hill. This hill comes up further out from the main mountain than the hill that I was on. The peak is therefore more west, and then heading east it slopes down, flattens out, then heads back up the main mountain. I was looking through these trees I was heading through up at the flattened part of that hill. I was looking right at this tree. I'd say it was a good ten feet tall. I'd say I was about 200-300 yards away from this tree. He must have seen me, because when he walked out from behind that tree, I could tell he was looking right at me. And something about the way he timed it tells me he wanted to scare me. I'd say he was about 8 feet tall, judging from the distance, and he walked just like the saquatch in the old video of him walking through that small clearing in the forest. You all know the one. Probably the most popular one out there. His arms swayed back and forth, hanging limply from his shoulders. He walked about 15 feet then disappeared behind another tree. I have no doubt in my mind of what I saw.","classification":"Class A","county":"Silver Bow","state":"Montana","latitude":45.9754,"longitude":-112.4554,"latlng":"-112.4554,45.9754","locationDetails":"On the East Ridge, south of The Lady of the Rockies. About in the middle of the hill.","dewPoint":29.09,"humidity":0.32,"cloudCover":0.09,"moonPhase":0.09,"pressure":1015.38,"weatherSummary":"Clear throughout the day.","uvIndex":8,"visibility":4.32,"highTemp":87.61,"midTemp":69.43,"lowTemp":51.25,"precipitationIntensity":0.0025,"precipitationProbability":0.84,"precipitationType":"rain","windBearing":86,"windSpeed":0.4}
{"id":"30860","timestamp":1313884800,"title":"Daylight sighting by camper at Black Mountain Campground near Blue Ridge Parkway","observed":"My two friends and I were camping near Busick, NC, just east of the Smokey Mountain National Park.   We were northeest of Asheville, near the Blue Ridge Parkway.    (Busick is so small that google earth does not have a marker for it.)   On the first of the two nights we were there, we heard wierd yells going through the woods right after dark.   Later, while we were sitting near the campfire playing dominos, we heard the same yell and heard rustling in the woods nearby.   We couldn't distinguish what it was because there were some people singing christian hymns at a small theatre nearby.   Later that night, when I was asleep, my friends(they were brothers) were talking about the upcoming wedding of one of them this coming spring and the younger brother says that he saw it move through the woods very close to our camp.   He told me about it the next day and I got kind of scared, since I may have seen a bigfoot in New Mexico back in 1994 while in the boy scouts.   The next day the two brothers went on a long hike and I stayed in camp since I was experiencing foot problems and had no hiking boots.    I got really bored so I decided to walk down what seemed to be a game trail into the woods for a few hundred yards.   I noticed that there were a lot of trees that were broken, like something had bended them.   None of these trees were very thick, but there were a few that I knew I could not snap.   I started to get a little scared, like something wasn't right.   I was only about a 1/4 mile from the campground, and I saw it.   It scared the s**t out of me.   I only saw it for about 10-15 seconds(maybe, I was so scared it could've been 5 seconds or it could have been a minute), and the best way to describe it would be that it looked like the bigfoot from Harry and the Hendersons only it was heavier and a little bit darker.   I was probably about 15-30 feet from it when I saw it.   We stared at each other for the duration of my sighting, and then it walked away as if I wasn't anything to worry about.    I stood in that spot for a little while and then walked back to the campsite, stopping every now and then to look around for the thing.   I told my friends about it and after describing the thing the one brother who saw it the night before said that it was probably the same thing he saw.","classification":"Class A","county":"Yancey","state":"North Carolina","latitude":35.75278,"longitude":-82.22121,"latlng":"-82.22121,35.75278","locationDetails":"Pisgah National Forest, Black Mountain Campground","dewPoint":67.54,"humidity":0.81,"cloudCover":0.32,"moonPhase":0.74,"pressure":1014.78,"weatherSummary":"Light rain in the evening.","uvIndex":9,"visibility":7.25,"highTemp":84.9,"midTemp":76.275,"lowTemp":67.65,"precipitationIntensity":0.0049,"precipitationProbability":0.22,"precipitationType":"rain","windBearing":247,"windSpeed":2.21}
{"id":"13276","timestamp":1135123200,"title":"Motorist has nightime sighting near Harmony","observed":"I was coming home after work about 9:30 to 10 pm heading north on ridge road.  It recently rained. Something rain across the road on two legs.  It was about 50 to 100 yards away.  It appeared to be about as tall as the hood of my car. It stopped momentarily as my headlight hit, and looked at my car, and then it turned and continued to cross the road and disappeared into the woods. I was thinking, \"what the hell was that?\" I live  nearby and hunt throughout the surrounding woods. I know it wasn't a bear or any thing we normally see in the area.","classification":"Class B","county":"Warren","state":"New Jersey","latitude":40.76345,"longitude":-75.11044,"latlng":"-75.11044,40.76345","locationDetails":"forested wetland at the base of a ridge on southeast side and agricultural field on west. whatever it was it crossed west to east","dewPoint":13.72,"humidity":0.63,"cloudCover":0.35,"moonPhase":0.69,"pressure":1021.6,"weatherSummary":"Mostly cloudy starting in the afternoon.","uvIndex":2,"visibility":9.47,"highTemp":30.45,"midTemp":26.745,"lowTemp":23.04,"windBearing":265,"windSpeed":6.49}
{"id":"17550","timestamp":1175299200,"title":"Nighttime sighting by motorist near Mansfield","observed":"Some time in early December my friend had an encounter with something he could not explain.  It took place in Mansfield, NJ in Warren County.  It was around 9:30 - 10:00 pm.  He called me up to tell me what he saw.  It turns out that on Feb. 6th I was on my way home on the same road in the same location.  It was around 10:20 pm and I was doing about 50 mph.  I saw something run across the road extremely fast.  It was around the same height as the hood of my car and it was black in color.  It ran so fast I didnt even need to hit the breaks.  Being an avid outdoors man I can usually identify animals, but I was not able to identify this one.  It was defiantly on two legs and covered in black hair.  No bear can run that fast and it defiantly wasnt a coyote or fox.  I drove home as fast as I could; I was shocked by the encounter and called my friend to tell him.  Everything I explained was what my friend had experienced as well.","classification":"Class A","county":"Warren","state":"New Jersey","latitude":40.8192,"longitude":-74.85561,"latlng":"-74.85561,40.8192","dewPoint":22.95,"humidity":0.43,"cloudCover":0.44,"moonPhase":0.44,"pressure":1023.39,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":5,"visibility":9.84,"highTemp":54.28,"midTemp":47.155,"lowTemp":40.03,"precipitationIntensity":0.0015,"precipitationProbability":0.79,"precipitationType":"rain","windBearing":76,"windSpeed":2.78}
{"id":"27743","observed":"it was spring 1981 and I was driving around some country roads with a friend listening to music when the tape jammed. I pulled over to fix it but left the car running & headlights on. I looked up from the tape & saw the bushes moving on the opposite side of the road,I assumed it was deer. I was wrong. I started to fix the tape again when my buddy said \"what the hell is that\" I looked up to see a very large gray haired creature stepping out of the bushes. It walked on 2 legs like a man,was around 5 or 600 lbs & stood over 7ft tall. I'm basing the height on my buddy with me who was 6ft 8in tall. It walked out into the road about 15 yards in front of us & just stopped & looked at us for a few seconds then just walked across the road into the woods & started up a hill. it had human like hands,feet &face covered in long gray hair.","classification":"Class A","county":"Warren","state":"New Jersey"}
{"id":"49883","timestamp":1443744000,"title":"Recollection of a possible late night stalking on Waterloo Road in Allamuchy","observed":"It was August of 1977 and I had missed my ride home from Hacketstown NJ to Byram NJ. The road to get back to Byram is Waterloo Rd. It was about 9:30-10:00 PM so I decided to hitch hike it on Waterloo hoping that someone would give me a lift back to HWY-206. It was very dark and as I was walking past Stephens State Park and then the old Saxton Falls area, I could hear something that sounded like it was on 2 feet stalking me in the woods on the ridge side of Waterloo Rd. It got very interesting when I started sprinting, it also started sprinting keeping up with me for what seemed like at least a mile. When I would walk, it would walk. It was loud as it went thru the woods as I stayed on the road hoping for a car to pick me up. Eventually I did get a ride near a few houses after passing an old Tavern on the river side of Waterloo Rd.","classification":"Class B","county":"Warren","state":"New Jersey","latitude":40.89452,"longitude":-74.79077,"latlng":"-74.79077,40.89452","locationDetails":"Waterloo Road, near the Sussex - Warren County border.","dewPoint":44.65,"humidity":0.81,"cloudCover":0.36,"moonPhase":0.67,"pressure":1022.25,"weatherSummary":"Light rain starting in the afternoon and breezy in the evening.","uvIndex":2,"visibility":8.63,"highTemp":51.18,"midTemp":49.13,"lowTemp":47.08,"precipitationIntensity":0.0164,"precipitationProbability":0.82,"precipitationType":"rain","windBearing":42,"windSpeed":12.24}
{"id":"4904","timestamp":958521600,"title":"Professor and students discover series of large footprints crossing high mountain trail","observed":"My summer ecology class was hiking to Middle Fork Lake. As with most classes, some students walked faster than others. I was with the stragglers, a few of whom were suffering from the cold and thin air. The trail had only been opened, as I recall, the previous day, and ours was the first group of the season to make the ascent. Lots of snow remained in shaded areas and in many places on the trail, and it was obvious no one had walked ahead of us, although a couple of older men on four wheelers passed us at one point. We were getting fairly close, within a half mile or so, to the lake; the slope was very steep. I remember our little group went past a switchback and we were uphill from a stream. Somewhere in this stretch, crossing the trail at a right angle, was a series of very large, apparently bipedal, tracks. In shape and contour, the tracks appeared human. No details, such as toe impressions, remained or could be readily detected, but every indication was that the tracks had been made by bare feet, not boots. The students immediately starting exclaiming, Bigfoot, bigfoot! Doing my best to downplay the tracks, I told the students that they were probably those of a hiker and that they had become enlarged as a result of melting and refreezing. Privately, I didnt believe that story for a second. As far as I was concerned, the impressions were the record of something extremely unusual. The tracks were huge, at least sixteen inches or more in length and quite wide. The depth of the tracks in the snow and soil was far beyond what I could duplicate; it was obvious, even to the students, that whatever or whoever made the tracks had immense weight (I told them the hiker was probably carrying a very heavy pack). The distance between the tracks was on the order of four feet or more, an interval that was all the more impressive considering the extreme steepness of the mountain in that area. It did not seem possible to me for any human to duplicate such a feat (so to speak) as was performed by the mysterious maker of those tracks, especially considering the conditions of snow and slope. In addition, the tracks were not headed to Middle Fork Lake. Of course, that doesnt prove anything, but I found it strange that anyone would hike up the mountain, avoiding the trail, and heading to something besides the lake. As best as I could determine, the tracks appeared to be going in the direction of Bull-of-the-Woods Mountain.","classification":"Class B","county":"Taos","state":"New Mexico","latitude":36.599,"longitude":-105.4113,"latlng":"-105.4113,36.599","locationDetails":"We were on the trail to Middle Fork Lake. Approximately 36.5990 N, 105.4113 W.","dewPoint":15.31,"humidity":0.23,"cloudCover":0.18,"moonPhase":0.48,"pressure":1001.39,"weatherSummary":"Breezy until evening.","uvIndex":14,"visibility":9.96,"highTemp":63.61,"midTemp":47.77,"lowTemp":31.93,"windBearing":261,"windSpeed":15.27}
{"id":"16207","timestamp":1159747200,"title":"Possible vocalizations, knocks heard by hunters in the Gallegos peak area","observed":"From sept 30th-oct 4th,2006 I was hunting with a friend [name withheld by request] in northern New Mexico Mtns. at about 9,500ft. On the evening of the 2nd I was heading back to camp when I heard a strang sound, like a scream/howl. Now I have hunted the mtns for many years for elk, bear, deer, mtn lions, and turkey, and never heard anything like this before.When I got back to camp my friend, who had started supper made the comment that something strange had happened to him. He said that he heard two sticks being hit together just before he started to camp. I did not tell him about the sounds I heard that night. The next morning I left about an hour before sun-up and headed back toward the same area that I hunted last evening. After sitting for about an hour and a half I got up and moved down an old road to check an elk crossing when I heard the same scream/howl again. I tried to pinpoint the area but never heard it again. When I met my friend at lunch he said he had heard the sticks being hit together again. I asked him to point to the area and he pointed to an area about 200 yards from the area I had heard the scream/howl. I asked him if he heard any screams and he said no.","classification":"Class B","county":"Taos","state":"New Mexico","latitude":36.19625,"longitude":-105.5596,"latlng":"-105.5596,36.19625","locationDetails":"about 5 miles up forest rd 442 at the Gallegos peak area.","dewPoint":26.49,"humidity":0.31,"cloudCover":0.04,"moonPhase":0.34,"pressure":1016.05,"weatherSummary":"Clear throughout the day.","uvIndex":7,"visibility":10,"highTemp":74.57,"midTemp":60.215,"lowTemp":45.86,"windBearing":247,"windSpeed":2.52}
{"id":"26460","observed":"We were getting up early to hitch up our travel trailer and start home to Oklahoma.  My wife had gotten up first and then I got up and went into the bathroom.  My wife opened the door and said that someone was standing outside the entry door to the bedroom of the trailer.  I went back to the room and saw a large shadow in the window.  The window is privacy glass so they couldn't see inside.  I could see a chest, a head and about half of the arm.   I reached into the night stand a took out my pistol thinking that it was someone.  I then started toward the back of the trailer to the main entry door.  While I was doing this my wife thought to take photos.  She took 3 photos which does show the shadow of whatever it was very well.  When I was at the other end of the trailer I opened the door and turned on the outside light at the same time.  There was nothing there, I did hear what sounded like someone walking very quickly in the distance.  I went around the trailer but couldn't see anyone.  It was at this time that I realized that the window on the door is too high for someone to have been standing there.  I took pictures to show how high it is.  We waited until daylight to go back outside, I looked around the front and side of the trailer and noticed what appeared to be large tracks in the gravel.  I took pictures of these.  My friend who is a photographer took a copy of the pictures showing the shadow in the window and enlarged them while trying to keep the clarity and it is possible to make out some of the features.  His exact words are \" it kind of looks like Harry from Harry and the Hendersons\".  I don't know what it was but it was very strange and the photos are quite interesting.","classification":"Class A","county":"Taos","state":"New Mexico","locationDetails":"Withheld by request"}
{"id":"28886","timestamp":1298160000,"title":"Couple driving home has night time sighting near Tres Piedras","observed":"On Feb .20, 2011 my mother and father were on there way back to Antonito, Co from Espanola, New Mexico. It was probably between 10:00p.m.and 11:p.m when they were driving down  road 285 headed north a big,tall, black human looking thing was standing in the road upon the car coming up closer the black thing which stood over six feet tall, very husky, walked very fast like a gorilla walk across the road. The thing popped out from the east side of road 285 crossing to the west side of the road . It was a very scary situation according to my parents. They suggest that anybody, especially female drivers to PLEASE BE CAREFUL.","classification":"Class A","county":"Taos","state":"New Mexico","latitude":36.65339,"longitude":-105.9678,"latlng":"-105.9678,36.65339","locationDetails":"It was just North of the road on Hwy 285 from the flashing light of Tres Piedras, New Mexico right where there is a wall of rocks on each side of the road. by the Per-light.","dewPoint":14.86,"humidity":0.61,"cloudCover":0.69,"moonPhase":0.59,"pressure":1004.69,"weatherSummary":"Light snow (< 1 in.) in the morning and evening and breezy until afternoon.","uvIndex":4,"visibility":8.52,"highTemp":33.17,"midTemp":21.325,"lowTemp":9.48,"precipitationIntensity":0.0021,"precipitationProbability":0.98,"precipitationType":"snow","windBearing":249,"windSpeed":12.76}
{"id":"5697","timestamp":82684800,"title":"Three boys encounter sasquatch in eroded terrain","observed":"This is the second in a set of chronological reports that I am submitting regarding a series of encounters I had between 1970 and 1983 in Nevada, California, and Washington States. I grew up several miles Northwest of Reno, Nevada in the foothills of the Sierra's.  My father was a geologist who preferred sparsely populated areas, so we lived, camped, fished, gold panned, rockhounded, and hunted Indian and goldrush artifacts in some relatively remote places. This second encounter occured in August of 1972 in Lemmon Valley, Nevada.  Lemmon Valley is Northwest of Reno on US 395.  Though the area I am about to describe is now covered with housing developments, in 1972 there were only two developed areas in the valley.  Stead Air Force Base (deactivated in 1959)[N.B. below] was on the West side of the valley and the community of Lemmon Valley was on the East side.  The community of Lemmon Valley was, in reality, simply a strip of built up properties along Lemmon Valley road - just housing and few small businesses extending for about five miles toward the back of the valley and for a couple of hundred yards at most to either side of the road.  US 395 cut across the South and higher end of the valley at the base of Peavine Mountain's North slope.  Toward the back of the valley, the North or lower end, were a few small ranches.  Only a couple of improved dirt roads cut across the center of the valley connecting the community of Lemmon Valley to Stead. The climate was high desert.  Roughly 5000 feet in elevation with negligible year-round rainfall, but sometimes several feet of snow in the winter.  The humidity was generally less than ten percent and often as low as five.  Other than those planted near developed properties, there were no trees in the floor of the valley.  Scrub pine begins on the higher ridges about five miles West of the valley and thickens to fully developed arid pine forest as the elevation increases.  The dominant vegetation is sagebrush, mixed with a wide variety of large weeds and coarse grasses.  Jackrabbits, prairie dogs, and smaller rodents were very common, as were a wide variety of lizards and snakes.  Coyotes are common, but rarely seen.  Cougar and black bear are rare, but sometimes sighted in the area.  Deer stick to the surrounding higher elevations with more trees.  Other indigenous animals include hawks, falcons, and few burrowing owls.  Quail, and other ground nesting birds are also plentiful.  There is also a variety of large insect species (cicada, locusts, etc..) to round out the ecosystem.  At first glance, the area may not look like it supports much in the way of life, but it actually does.  Snow melt is the primary source of open water in the late spring and early summer and a small lake forms toward the back of the valley.  By late August this has usually dried up and the only sources of water are near human habitation. As I mentioned in my first report, the North face of Peavine Mountain was deforested in the late 1800's.  It has also eroded significantly over the last century as a natural result of the vegetation loss and due to hydraulic mining.  The runoff from the mountain was clearly heavy at some time in the past, because two deep washes cut through half the length of the valley flowing North from Peavine Mountain. These washes were eight to ten feet deep in places with vertical walls and averaged five to eight feet in width.  Walking down one was much like walking through a school hallway with slight curves.  Their depth would increase and decrease as they intersected the natural fingers and draws running down from the ridges that bounded the valley.  They were difficult to climb in and out of except at a few places where they shallowed out to a couple of feet as they intersected a draw.  Because they were shaded and contained a little more moisture than the surrounding terrain, they formed a small microclimate where certain species of lizard and an occassional scorpion could be found.  The sagebrush also grew a little taller (about three feet) along their edges.  Below, the floors of the washes were almost perfectly level, shaded, and protected from the wind.  Very little vegetation grew in the floors of the washes and was usually limited to tumbleweeds and some patches of coarse grass.  From the floor of the valley these washes were virtually invisible.  You could only tell where they were from a stripe of sagebrush running along their edges that was a little greener, thicker, and taller than the rest of the sagebrush in the valley.  You couldn't see them or see down into them until you were right on top of them. This encounter took place in the early afternoon in mid-August of 1972.  It was bright, sunny, and hot, about 85 degrees Fahrenheit, at the time.  The wind was less than five miles per hour.  I was twelve.  I was with my brother, who was ten, and a friend, David, who was also twelve.  For years, my brother and I had spent the summers exploring the surrounding hills and valley.  We knew all the best places to catch each type of lizard, the best places to look for arrowheads, where the trash dumps from the 1800's were (good for old bottles), and the best places to find old shell casings and such from when the airbase had been active.  We didn't often make it out as far as the dry washes, but when we did we made a point of exploring them because of the unique things like scorpions you could find in them.  We had just moved from Stead to the Lemmon Valley side of the valley and David, a new neighbor, was with us for the first and, as it turned out, only time. We had decided to go all the way out to the closest wash to show it to David, and were angling toward one of the shallow points where it would be easier to get into.  As we walked along we were searching the ground for horned toads, arrowheads, and anything else that might be interesting.  We were about twenty feet from the wash when we stumbled across an area with jasper and obsidian chips on the ground and started looking around in earnest for arrowheads and other stone tools.  My brother and I were seriously competitve when it came to hunting arrowheads. I was facing North, focusing on a piece of jasper I had just found, and had my back to my brother and David when I got a sudden feeling something was wrong.  I don't know whether I heard one of them gasp or just go abruptly quiet, but I knew there was a problem.  I had a sense of where my brother was a few feet behind me and turned to look at him.  As I turned clockwise from North to South I saw first David, about twenty-five feet away from me and a couple of feet from the rim of the wash, then what I perceived to be a giant black man about eight feet from David and about three feet away from the wash, and finally my brother, who was only about five feet behind me.  The giant black man was about thirty-five feet from me, standing still facing me with his arms at his sides looking directly at me (I guess he must have figured I was the lead male).  David was in shock, rooted to the ground, staring directly at him with his mouth wide open and his lower jaw level with his collarbones.  My brother was poised to run and looking from the \"man\", to me, and then to David in a panic.  As soon as I saw the man I took a step to run also, but realized David wasn't going anywhere and we'd need to help him if the \"man\" tried to do anything (we weren't that far from Reno and there are a lot of weird people who drift through that town - a man out of place in the desert is immediately considered dangerous).  I settled my weight and looked the \"man\" in the eye waiting for him to indicate his intentions. This all took about a second.  At this point my brother turned to me and screamed, \"That's not a man!  That's not a man!\"  Not breaking eye contact with the \"man\" I snapped back at him, \"Yes it is!\"  My brother immediately yelled \"No, it's not!\" and I snapped right back \"Then what is it?\"  which shut him up.  At that moment, in that situation, it was critically important to me that the \"man\" be nothing more than a man.  I also knew my brother and I could probably get away, but David was at risk and I intuitively sensed that it was important to control the fear, both by keeping the \"man\" just a man and by calming my brother. As I focused on the \"man\" I recognized that he was not overtly threatening but seemed stern and annoyed.  He didn't move a muscle and he didn't make a sound.  From his manner I gathered that he was not threatening us, but was determining if we were a threat to him - that we had disturbed him and he just wanted us to go away and leave him alone.  My brother and I would have been happy to oblige but David was still standing like a statue and we weren't leaving him behind so we all just stood there and stared at each other. I could see the \"man\" from the lower shins on up, and this is where it gets a little strange.  He was at least eight and a half feet tall, three and a half feet to four feet broad at the shoulder, and had a comparatively narrow waist.  His arms hung down to the top of his knees.  Not only was this \"man\" huge and slightly disproportionate, but in the middle of the afternoon, in the middle of August, to my perception, he was wearing a black down ski parka with the peaked hood up, matching black down ski pants, and black gloves.  Down ski-wear was a brand new fad with the skiers that came through Reno back then.  I thought to myself that it was strange that he had this brand new ski outfit, let alone one that fit his frame.  I thought he must have stolen it (I had already subconsciously assumed this guy was a hobo because we were at least a mile from the nearest road, there wasn't a vehicle in sight, and I couldn't think of a good reason for him to have apparently been hiding in the wash).  As I thought about it, the hobo assumption made sense.  The ski-suit was probably the only thing he had to wear and, at night, sleeping out in the open in the high desert it tended to get a little chilly, August or not.  There was even a little dirt on it in places, indicating he'd been lying on the ground in it. The \"man's\" bearing, though, didn't come across the way a homeless person's would.  He stood tall with his shoulders relaxed, but back.  His posture indicated a sense of self-worth that was almost regal and his gaze didn't flinch (as an afterthought, there was nothing about his eyes to give me the impression that he lacked human intelligence).  Even under the ski suit you could tell that he had a massively muscled upper body, and the ratio of shoulders to waist were those of a world-class athlete.  For a moment I considered that I was looking at fur-covered muscle and immediately killed the thought, then started to look a little closer anyway.  This was when he simply broke eye contact, turned, stepped down into the wash at the shallow point where he was standing and walked away down the wash without looking back (this was a little strange in retrospect because there was absolutely no indication in body language or eye movement to telegraph that he had decided our encounter was over - he simply turned and left without acknowledgement).  Within a couple of steps he disappeared around a slight curve in the wall of the wash as it cut through the next finger off of the ridge.  We had stood looking at each other for maybe forty-five seconds. I didn't move for a couple of seconds after he disappeared, waiting to give him time to go before moving to check on David.  I'd never seen anybody so afraid that they were frozen on the spot before and I was concerned about him.  As I walked up to David, looking cautiously down the wash as I got a better angle on it, my brother followed me and said in a voice that seemed to beg me to believe him, \"That wasn't a man.\"  Standing in front of David, I looked him in the eye and said, \"Yes it was.  It was just a big, black hobo.\"  That ended the discussion.  I asked David if he was ok.  He just shook his head yes and didn't say anything.  My brother moved up to the edge of the wash to see as far down it as he could and I asked if he could see the guy.  He couldn't and we started to leave when curiosity got the better of us and my brother asked, \"What do you think he was doing down there?\"  I thought about it for a second and decided I wanted to know, too, so we walked along the edge of the wash for a hundred yards or so to make sure he wasn't hiding close enough to threaten us (the guy wasn't carrying anything and I was worried that we would find his camp about the time he came back to it to get his belongings).  We walked back down to the shallow spot in the wash and jumped down into it.  I briefly recognized that the \"man\" had simply stepped down the three feet I had just jumped, but didn't say anything. We walked both up and down the wash a hundred feet or so looking for a campsite.  We didn't find one.  No firepit, no food wrappers, no trash, no drug paraphenalia, no signs that a human had been camping there.  The floor of the wash was granite sand so there really weren't any footprints that I could recognize to indicate where he may have been.  We did find a spot where someone had taken pieces of tumbleweed and sticker bush and embedded them in the wall of the wash.  Tumbleweed and pieces of bush were also arranged on the floor of the wash at the same spot.  Those embedded in the wall of the wash were arranged in a tall half-oval with the peak about four and a half feet high.  Those on the floor of the wash were also arranged in a half oval that joined the first.  It was about the right size for the guy to sit cross-legged in with his back against the wall of the wash. At that time I had never heard of Bigfoot, so it wasn't even an option for me to consider within the framework of the encounter.  Even though several things about the encounter were strange I convinced myself that we had been confronted by a man.  What else could it have been?  About ten days later, though, something happened that forced me to admit that there was something in the valley that was manlike but wasn't a man.  I'll submit that as my third report soon.","classification":"Class A","county":"Washoe","state":"Nevada","latitude":39.679,"longitude":-119.6665,"latlng":"-119.6665,39.679","locationDetails":"Described in context above.","dewPoint":26.36,"humidity":0.29,"cloudCover":0.41,"moonPhase":0.21,"pressure":1014.1,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":9,"visibility":9.68,"highTemp":74.49,"midTemp":58.43,"lowTemp":42.37,"windBearing":248,"windSpeed":3.23}
{"id":"5770","timestamp":83548800,"title":"Four feral dogs chase sasquatch","observed":"This is the third in a set of chronological reports that I am submitting regarding a series of encounters I had between 1970 and 1983 in Nevada, California, and Washington States. This third encounter occurred in August 1972, when I was 12, at my home, roughly ten days after our encounter at the dry wash. I have previously described nearby Peavine Mountain and Lemmon Valley.  Our house was located on the East side of the valley.  It was in a new development at the time, tucked back in a draw among several steep hills.  The surrounding hills rose from 50 to 250 feet above our neighborhood and were primarily granite outcroppings.  The soil was coarse granite sand interspersed with boulders of various sizes.  Where there was vegetation on the hills, it was predominantly sagebrush.  In the draws, the sand was less coarse and there were a variety of grasses and other weeds. We had just moved into the newly completed house a few weeks earlier and were getting to know our neighbors, all of whom had just moved into their new homes as well.  Like many of our neighbors, we were building a fence and otherwise improving our property.  At the time, there was only one thing to detract from the new neighborhood -- the presence of a pack of feral dogs. The pack was composed of four large dogs -- two Dobermans and a couple of mixed breeds.  They were a matter of some concern because many of the new residents had small children and the pack displayed absolutely no trace of fear of people.  They would generally appear around dusk, when it began to cool, and boldly range through the neighborhood.  At night you could often hear them in the surrounding hills, barking and baying occasionally.  It didn't take long to determine that they had no owner and one of our neighbors, an animal control officer for the city of Reno, told us that he had arranged for the county to do something about them. Our home was an \"L\" shaped ranch, with two of four bedrooms in the back, at the top of the \"L\", and a garage in front, at the bottom right of the \"L\", facing the street.  We had partially constructed a cedar plank fence around the property, starting in back and working our way around the property clockwise.  We had completed the fence on the side of the property at the top of the \"L\", and had built a small section of fence connecting the back left corner of the \"L\" to the fence on that side.  This created a small cul-de-sac behind the house.  Along the side of the property to the right of the \"L\", we had set the posts and rails.  Along the front, where we intended to connect it to the garage, at the lower right corner of the \"L\", we had set the posts, but hadn't yet put in the rails.  You could, essentially, walk right into our back yard from the street side of the house, but could not leave the yard on the back side without climbing over the fence. On the night of the encounter, I had picked up all of the two-by-fours we hadn't used as rails yet and I had stacked them horizontally along the base of the fence back in the cul-de-sac.  This was a precaution since they were pilferable and we weren't the only ones building a new fence. My bedroom was at the top, right corner of the \"L\".  The ground outside my window was about a foot and a half below the floor of my room.  My mother had already planted a small flowerbed of marigolds there.  To protect it, she had me put in one of those small, white-painted, wire trellises that reminds you of a bunch of coat-hangers welded together.  To put it in I had to heavily wet down the ground, then force it in.  Once the ground dried, the powdered granite and sand set like concrete.  It was about a foot high. The incident occurred between midnight and 12:30 am.  It was late summer and I was awake late reading.  I had my window open, but the drapes were closed.  That night, the pack of feral dogs had been more noisy than usual.  Every so often, their barking would become particularly strident, drawing my attention away from my book.  I remember thinking to myself, over the course of fifteen minutes or so, that they were chasing another jackrabbit, then deciding that it must be a coyote, since they'd been going at it for longer than usual, then wondering if they might have a cougar at bay, since they were still barking and baying loudly, but seemed stationary. I was just turning back to my book, when I realized that they had started moving again, and were coming down the street in the direction of the house.  I started to sit up, intending to go to the living room window to see what they were chasing, but realized that they would be well past the house before I could get to the living room in front.  As I listened, though, the noise of the pursuit didn't decrease the way I expected it to do as they chased their quarry past the opposite side of the house.  Instead it grew louder, and I realized that, whatever they were chasing, they were chasing it into our back yard.  I also realized that they might corner it behind the house in the cul-de-sac.  Excited, I started to get up to look out the window. Before I could get up, though, their quarry rounded the back right corner of the garage heading in the direction of my bedroom at the back right corner of the house.  For just a second, I could clearly hear it running, as the sound of the dogs was still partially masked around the corner of the garage.  As it covered the twenty feet between the two corners, I heard three distinct, heavy footfalls -- one just as it rounded the garage, one midway between the garage and the corner of the house, and the third just under my window, where the wire trellis was set firmly into the ground.  This was followed by an incredible impact into the corner of the house.  The force was so great that I could hear the four-by-four upright in the wall crack and the whole room shook.  The impact and cracking sound came from a point about five and a half feet above the level of the ground outside.  Simultaneously, there was a secondary impact about seven feet above ground level across the top right corner of my window as viewed from outside.  The window rattled violently in the frame and I was sure it was cracked.  Immediately following the two simultaneous impacts, there was a forced grunt as if the wind had been knocked out of whatever it was and I could hear its body fall heavily to the ground. My first thought was, \"Oh my God!  They're chasing a man!\"  The footfalls were clearly bipedal, the height of the impacts was too high for it to be anything four-legged, and the sound of it having its wind knocked out was manlike, if somewhat heavy.  Also from the sound of its fall, it went from an erect to a prone position.  At the same time I recognized that something was strange.  The \"man\" hadn't called for help, hadn't made any vocal noises at all, in fact.  He had covered twenty feet in what was essentially two strides, and had hit the house at a point too high for all but the largest of men.  The secondary impact across the outside corner of the window was also too high for most people to reach, and the force of the impact, strong enough to make the four-by-four in the house's frame crack, indicated much more mass than any normal person would have. I didn't spend any time really thinking about this, though.  Even though I had an underlying uneasiness because the sounds indicated that the guy was huge, I was sure the dogs were chasing a man.  The dogs closed on the man, snarling and barking.  I was afraid he was lying on the ground, injured or unconscious, and I realized that I had to do something.  I immediately threw my sheet off, jumped out of bed, and reached for the drapes, intending to throw them open and yell at the dogs -- about all I could do in the situation.  In the two or three seconds it took to do this, though, it didn't sound like the dogs were mauling the man.  They were about three feet from the house, stationary, barking and growling.  It sounded as if there were only three of them, two very aggressive and ready to attack, and one that was barking the way a dog would if it were afraid of you, but ready to attack if provoked. Just as my fingertips touched the drapes, the scariest thing I have ever experienced in my life happened (believe me, this is saying a lot for someone who has spent nineteen years in the military and lived through a parachute malfunction).  Somehow the man had recovered from hitting the house, having the wind knocked out of him, and falling.  He had somehow managed to stand up and get his breath back and just as I touched the drapes, from a point immediately outside my window, level with and about two feet from my head, He Growled Back at the dogs. The growl wasn't loud.  It was only about two and a half seconds long.  But it was the meanest, deepest, and most menacing growl I have ever heard in my life (to include those of trapped brown bears at Yellowstone).  It was almost as if he was keenly aware that there were people around, that he knew precisely how long he had to growl to get his point across, and that he didn't want to make any more noise than he absolutely had to. For the next several seconds there was absolute silence.  He didn't make any more noise.  The dogs didn't even make any sounds of movement.  And I was frozen in fear and shock, praying that he wouldn't notice I was there, and afraid he would hear me if I moved at all. It was like that for several long seconds, then, all but silently, I heard him step and brush around the corner of the house. A second later the dogs were after him, but the head start was all he needed.  I heard the stack of two-by-fours tumble down and the sound of him hitting the six foot cedar fence as he went over it, followed by the dogs hitting the fence and then scratching at it and barking.  After a few moments the dogs stopped trying to get over the fence and raced back around the house clockwise. As I heard the dogs racing down the street, I relaxed slightly and gulped for breath.  I hadn't even realized I'd been holding it.  I immediately choked.  The \"Thing\" had left an incredible stench.  It was overpowering.  It smelled like a combination of wet dog, stale urine, and rancid sweat.  There was also an acrid component a little like burnt rubber.  It was so bad that I staggered away from the window. I stood there for a few moments trying to decide what to do.  The thing was gone, the dogs were gone, and all I would accomplish by waking my parents would be to anger my father.  I decided it wasn't worth it.  I thought about going outside but really didn't want to poke around out there in the dark.  I was struggling with what I had just experienced.  Whatever had been outside my window was manlike, but clearly was not a man.  I had no frame of reference to place it in.  I didn't relate the experience to my encounter at the dry wash because I had so thoroughly convinced myself that that had been a man.  I closed my window (which to my amazement was not broken), got back in bed, and tried to read to get my mind off of the incident.  Eventually I fell asleep. The next morning I woke after my father had left for work.  I looked out my window and could see that the flowerbed -- trellis and all -- had been flattened.  I got dressed and went outside.  The ground was scuffed but there were no distinctive footprints.  I choked down my apprehension and walked back into the fenced cul-de-sac behind the house.  The stack of two-by-fours was lying there toppled.  I looked at the cedar fence.  The scratch marks from the dogs' nails were clear.  Caught on the top of one of the planks was a tuft of coarse hair.  I stepped up on the lower rail of the fence and looked at it closely in the bright morning sunlight.  It was dark black with hints of brownish red highlights and about three inches long.  It had enough oil on it make it shine if you looked at it closely.  I struggled with whether it had come from the \"thing\" or one of the dogs.  After several moments of consideration I decided it was possible one of the Dobermans could have had some three inch strands of hair, that the colors were within the appropriate range, and that one of the dogs might actually have managed to make it over the fence to leave it there.  I left it where it was. I went back to the window and examined it and the siding on corner of the house closely.  I didn't see any damage from the impacts.  I decided that the thing had been running, hadn't seen the trellis, and had tried to cut around the corner of the house too closely.  The trellis, strongly embedded in the cement-like soil, tripped it and it fell, throwing its left arm(?) up in an attempt to maintain balance (or maybe grab the roof to catch itself).  The primary impact would have been from its body.  The secondary impact could have been from the left arm slapping the side of the house across the corner of the window. I went in and told my mother about the incident.  I was still very troubled and wanted to know what I had heard.  I discussed it at length with my father when he got home.  He was uncharacteristically patient and explained that it had either been a bear or a cougar.  I couldn't accept either of these explanations.  It wasn't until about a year later that I ran across a tourist pamphlet in Oregon that was about Bigfoot.  I can't express how relieved I was at the time to learn that there was a potential explanation for what I had experienced. We never saw or heard the dogs again after that night.","classification":"Class B","county":"Washoe","state":"Nevada","latitude":39.679,"longitude":-119.6665,"latlng":"-119.6665,39.679","locationDetails":"Described in context above.","dewPoint":31.92,"humidity":0.31,"moonPhase":0.53,"pressure":1012.33,"weatherSummary":"Clear throughout the day.","uvIndex":9,"visibility":10,"highTemp":85.33,"midTemp":66.81,"lowTemp":48.29,"windBearing":43,"windSpeed":1.54}
{"id":"3180","timestamp":268358400,"title":"Early evening sighting by two children, near Layman","observed":"This may not even be relevant now because it happened so many years ago, but when I was about 10 years old my sister and I were out in our yard playing a yard dart game ( the kind where you throw the plastic flower onto a stake in the yard) the only reason I mention what kind of game it was is to let you know how vivid this still remains in my mind. But anyway, we were playing in the yard it was close to getting dark but still daylight enough so that you could still see.  I don't quite remember if I heard a noise or what made me look across our road but when I looked, across the road on the edge of the woods I saw an image, similar to drawings I've seen of actual encounters.   It was walking at the edge of the woods kind of stooped over, using its hands to push the trees back out of its way.   All I could do was just stand there and look at it not really knowing what I was seeing.   I really don't know how long I stood there but I remember yelling at my sister who was then 7 years old, and telling her to run into the house.   She then looked and saw the same thing. As soon as I yelled at my sister it stopped dead in its tracks and just stood there and looked at us.   My sister and I still remember the feeling of not being able to move, and to this day we still get cold chills and our eyes water every time we talk about this. So anyway we eventually ran inside the house.  When we got in the house I remember my mom asking what was wrong because she said that both of us were as white as sheet.  We then went on to tell her what we had seen and were terrified to have her go outside  and check things out. Neither one of my parents ever saw anything but still to this day say they believe we did see something, whether it was someone playing a joke or possibly a bear but I still think to this day that it was Bigfoot or something similar.","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.40877,"longitude":-81.73172,"latlng":"-81.73172,39.40877","dewPoint":61.85,"humidity":0.82,"cloudCover":0.99,"moonPhase":0.97,"pressure":1014.71,"weatherSummary":"Overcast throughout the day.","uvIndex":6,"visibility":4.09,"highTemp":71.53,"midTemp":66.82,"lowTemp":62.11,"precipitationIntensity":0.0003,"precipitationProbability":0.31,"precipitationType":"rain","windBearing":357,"windSpeed":5.36}
{"id":"7220","timestamp":278726400,"title":"A man relates a series of occurrences on the family farm involving an upright walking hair covered creature","observed":"I would like to share with you what I saw as a boy. I saw a Bigfoot standing over our burn barrel. I remember being very young when this happened. But I have never forgot what I saw. It was strong and tall but not real tall.  Maybe six foot ten to seven feet tall. It had a smell to him I will never forget. I knew he was still there down in the hollow where I was raised as a child. When we would cut firewood in the saw mill he would make us feel weird like he didn't want us there. My mom would say start the truck and don't stop until we get to the top of the ridge. We found footprints one winter that were very wide at the heel and very large in size like 17-20 inches long. I hope someone hears what I have to say. I would love to talk to someone about this. I know he is still there! It's a perfect place for him to live with so much forest and hills.","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.54739,"longitude":-81.39101,"latlng":"-81.39101,39.54739","locationDetails":"Between Whipple and Lower Salem, Ohio.","dewPoint":39.42,"humidity":0.76,"cloudCover":0.22,"moonPhase":0.03,"pressure":1025.79,"weatherSummary":"Partly cloudy until afternoon.","uvIndex":2,"visibility":6.18,"highTemp":58.56,"midTemp":45.375,"lowTemp":32.19,"windBearing":2,"windSpeed":3.37}
{"id":"4073","timestamp":457747200,"title":"White hair covered creature seen at the edge of a cornfield","observed":"It was July 4th, 1984. I was 17 and between my junior and senior year of high school. I went to the fireworks in Beverly, Ohio and had met a young lady (sorry I don't recall her name) who was staying with some friends that lived near Churchtown. We watched the fireworks, then I offered to drive her home. I don't know the township road, but it is off state Route 676. We parked for a while then drove on to where she was staying. On the way to the house she had fallen asleep with her head in my lap, so she didn't see a thing. As I drove about 15 mph along these backroads, I rounded a slight turn where the banks on either side rose about six feet. On both sides of the road were fence and cornfields. Then, on the left side of the road behind the fence was a large hair covered, gray or white colored figure standing by the fence line. I was stunned and didn't say a word and just kept driving along slowly looking at this thing. As I went by it just looked at me. I didn't have a clue what to do, so I kept going. When I looked in the rear view mirror I saw it turn and go back into the cornfield. I didn't tell anyone for a while, but eventually told a couple friends who just smiled.","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.46019,"longitude":-81.54855,"latlng":"-81.54855,39.46019","locationDetails":"A few miles off State Route 676 on a township road.","dewPoint":63.92,"humidity":0.75,"cloudCover":0.88,"moonPhase":0.2,"pressure":1012.61,"weatherSummary":"Rain starting in the evening.","uvIndex":6,"visibility":4.92,"highTemp":76.01,"midTemp":72.325,"lowTemp":68.64,"precipitationIntensity":0.0096,"precipitationProbability":0.63,"precipitationType":"rain","windBearing":198,"windSpeed":7.61}
{"id":"7085","timestamp":646790400,"title":"Three boys playing games witness a huge creature walking through their front yard","observed":"My two brothers, cousin, and I were out playing a little war game with our toy guns. We ranged from the ages of  8 to 14 me being the oldest. We divided up in teams of two, my brothers were on a team and were going to go hide to which me and my cousin would try and find them after giving them some time to hide. We heard them scream and we stood up and were kinda worried because we were on the opposite side of the house than them. So we got up to make sure they were all right, but they came around the house before we could get to far. They went on to tell us that they heard something really big running in the thick patch of woods. My brother was going into the thicket to hide. When he started in that's when he heard something take off running. The sun was about to disappear as night grew nearer and he was still spooked from the noise he heard and refused to go hide anymore. I just thought that it was probably a deer since our area is very populated with them. So we got off the porch and was walking around the corner of the house when I looked up towards the road. Now to give you a brief description of the terrain. From where the thicket ends there is about 20 yards of short mowed grass which meets up with State Route 550 then on the other side of the road it slopes down fairly sharp and then into a cornfield. As it was striding across the road is where I saw it. It's arms were swaying back and forth and I remember the hair hanging from its arms. The body was very thick, thicker than any human body I've ever seen. The head looked like it ended in a point rather than a rounded head like a humans. It seemed to run in slow motion as I stood there in amazement. It went over the bank when it got to the other side of the road. We jumped up onto the porch and went inside to tell my dad. He just laughed at us and so have most people that I have told this to since then. I can still see that image in my head as if it just happened.","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.3731,"longitude":-81.65929,"latlng":"-81.65929,39.3731","locationDetails":"It's roughly four miles from the four way stop in Barlow by the fairgrounds going towards Marietta.","dewPoint":64.22,"humidity":0.75,"cloudCover":0.57,"moonPhase":0.3,"pressure":1012.38,"weatherSummary":"Partly cloudy until evening.","uvIndex":7,"visibility":6.85,"highTemp":80.08,"midTemp":68.455,"lowTemp":56.83,"precipitationIntensity":0.0042,"precipitationProbability":0.27,"precipitationType":"rain","windBearing":324,"windSpeed":5.25}
{"id":"26830","timestamp":1256947200,"title":"Group finds possible Bigfoot track in Wayne National Forest - w/photos of track and cast","observed":"After getting online to your site we decided to go to a known sighting area as an afternoon excursion since the day was nice.  After walking up several steep inclines and falling often we came up to another ridge that was very difficult to climb for us. We spotted a foot print actually my boyfriend did. I knew he had found something when he called for me to come quick and climb up the last area. I climbed up and there it was a foot print.  I did not really believe in Bigfoot but now we are having second thoughts. Mind you we drove two hours one way, and walked for at least hour up hill off the trails.  We even went back the next day which was today 11/1/09 and made a cast of the print. Of course it was not as deep as yesterday but we still took the print and have pictures from yesterday on the cell phone.","classification":"Class B","county":"Washington","state":"Ohio","latitude":39.42635,"longitude":-81.37085,"latlng":"-81.37085,39.42635","locationDetails":"Wayne National Forrest","dewPoint":47.65,"humidity":0.76,"cloudCover":0.74,"moonPhase":0.42,"pressure":1010.92,"weatherSummary":"Light rain in the morning.","uvIndex":2,"visibility":8.83,"highTemp":60.8,"midTemp":47.195,"lowTemp":33.59,"precipitationIntensity":0.0135,"precipitationProbability":0.88,"precipitationType":"rain","windBearing":222,"windSpeed":7.59}
{"id":"3572","observed":"A large Man like creature covered in hair nearly seven foot tall covered in hair with a gait nearly four foot in length. The stories abounded while we were in school and many sightings would be seen during the begining and near the end of deer season.","classification":"Class B","county":"York","state":"Pennsylvania","locationDetails":"Peach Bottom Township, Village of Delta on the Mason Dixon Line near Cardiff and Whiteford Md. About 6 miles from where the Muddy Creek joins the Susquehanna  River down in a hollow south of the Muddy Creek between SR74 and SR851 lies a pastoral hollow near the creek where there is a clearing served by an old logging trail. During the summers of 1973 through 1976 inclusive there were repeated sightings of a bigfoot like creature that  was recounted by many of the students who attended Kennard Dale High School and would camp and party in that hollow during the summer. Also there were several abandoned Slate quarrys heavily wooded and they provided an incredible degree of nearly inaccessable habitat for the alleged beast."}
{"id":"31201","timestamp":1321920000,"title":"Night road crossing observed near El Dorado Springs","observed":"Large upright primate approx 7foot height.","classification":"Class A","county":"Vernon","state":"Missouri","latitude":37.85524,"longitude":-94.11218,"latlng":"-94.11218,37.85524","locationDetails":"Rt 54 eastbound just before right hand turn off toward mo rt 32","dewPoint":42.23,"humidity":0.92,"cloudCover":0.95,"moonPhase":0.91,"pressure":1017.3,"weatherSummary":"Rain in the morning.","uvIndex":1,"visibility":6.09,"highTemp":47.87,"midTemp":43.19,"lowTemp":38.51,"precipitationIntensity":0.0109,"precipitationProbability":0.93,"precipitationType":"rain","windBearing":335,"windSpeed":6.03}
{"id":"27341","timestamp":227232000,"title":"Childhood memory of a figure filling the window of her home near Evening Shade","observed":"I was nearly 13 years old at the time. We lived in a trailer park away from town, but I can't remember what road it was on. One evening I was home alone. My mother had gone to pick up my stepfather. It was around 8-9 pm. I was sitting in the living room watching TV when my dog starting acting strange. He stood up with his hackles raised and started to growl, staring at the back door of the trailer. The back door of the trailer was in the hallway just off the living room. We had an outside light on the telephone pole in the backyard which was shining into the privacy window of the back door. His behavior caught my attention because he was a gentle natured dog who loved people. This was the first and only time I ever heard him growl like that. As I looked up to see what was bothering him, I noticed a shadow filling the entire window of the back door. My dog lifted his nose to sniff in the direction of the door, and suddenly his posture changed in an instant. He started cowering, tucked his tail between his legs, and quickly came over to hide by me. I had never seen him act this way before. Then the shadow went by the living room window, and it nearly filled the entire window. The shadow stayed in place for a few seconds, then moved away from the trailer. I could smell a faint skunk-like odor as well. I didn't have the courage to open the door and look outside for the source of the shadow. I wasn't even about to walk down the hall to my bedroom until my mother got home. (My dog didn't want to walk down the hall either.) We were both petrified! We stayed on the couch until my mother and stepfather came home about 30-45 minutes later. I'm sure they were puzzled as to why I was huddled on the couch with my dog, instead of in bed. I was afraid to tell them about the incident. Now I wish I would have at least told my mother. I've always wondered what could have been large enough to fill the whole window like that.","classification":"Class B","county":"Texas","state":"Missouri","latitude":37.5656,"longitude":-92.1426,"latlng":"-92.1426,37.5656","locationDetails":"I don't remember how to get there.","dewPoint":42.48,"humidity":0.59,"cloudCover":0.27,"moonPhase":0.87,"pressure":1013.72,"weatherSummary":"Partly cloudy until evening.","uvIndex":4,"visibility":7.97,"highTemp":65.51,"midTemp":50.245,"lowTemp":34.98,"windBearing":288,"windSpeed":6.87}
{"id":"41427","timestamp":777600000,"title":"Memory told of a nighttime close encounter in the Henning Conservation Area near Branson","observed":"I've told this story to numerous people over the last 16 years and have been made fun of quite often. But though I have forgotten many things from my 20's the pictures in my mind .. even the sounds of breaking twigs .. everything from that night is still crystal clear. I have not questioned what we saw ever and still hold true to the fact that what we saw was nothing other than what is called \" big foot \". It was August I believe 1994, Ruth and Paul Henning Conservation Area outside of Branson Mo. 1:00 A.M. A friend of mine and I had just got off work and pulled over at what was then the scenic overlook. A trail at that time wound back and forth in appropriately 60 foot lengths as it progressed up the hill to an old fire tower. If i was there I could show you exactly where we were and where \" it \" was but i will do my best to describe. We had gone up the path two turns when we heard a loud snapping sound in the quiet night. we both instantly froze and looked up. Between the 3rd and fourth path turn we could see it. a huge large slightly slumped big foot. Long arms ... sillouetted almost by the city lights and open area behind it .. we just stood there. Shocked... the friend I was with after what seemed like 5 minutes of frozen still .. yelled HEY .. and then one foot from it ... a second slightly shorter one stood up and turned to look right at us then they both ran off. The running was so significant because they ran on back legs but hunched over with long arms and it was loud. Snapping twigs and pushing their bodies right through small trees in the way. We waited a moment and then walked the trail to where they had been standing. Using a close by tree to estimate the height of the tallest. it had to be at least 7.5 feet tall if it wasn't slumped. We heard another snap in the woods and ran full sprint to the fire tower at the top of the hill and stayed there the entire night. We didn't talk much about it ... still in shock I think ..  Please contact me for photos of the park and any information. Thank you.","classification":"Class A","county":"Taney","state":"Missouri","latitude":36.66887,"longitude":-93.29459,"latlng":"-93.29459,36.66887","locationDetails":"Ruth Henning conservation area - aka Henning Park scenic overlook","dewPoint":61.44,"humidity":0.69,"cloudCover":0.38,"moonPhase":0.58,"pressure":1018.18,"weatherSummary":"Partly cloudy until evening.","uvIndex":7,"visibility":9.54,"highTemp":83.79,"midTemp":74.19,"lowTemp":64.59,"windBearing":162,"windSpeed":6.02}
{"id":"15075","timestamp":174614400,"title":"School teacher remembers his close encounter with a sasquatch while hunting near Cape Fair","observed":"I was hunting with a friend and we had been out since early morning, it was hot and we were tired. We were just trying to get back to the car, which was parked, on a dirt road about a mile up a ridge that was directly in front of us. The brush we were walking through was thick, really difficult to get through. We were walking single file and I was behind my friend with my head down concentrating on just trying to get through the brush with out tripping. Suddenly I heard an incredibly loud disturbance to my left and at the same time my friend had froze in his tracks. As I looked to my left, this animal, there is no doubt a Bigfoot, came tearing down the ridge right in front of us. It could not have been 10-15 feet from us. It was so close, it must have been sleeping and we woke it, because something that big would have made a lot of noise crashing through the brush on approach, and I heard nothing until it was right on us. We both watched it run past us to our right, on down this ridge and disappear into the forest. It was huge, covered with black fur and long, long arms. As it went by us it turned its face toward us and its face was flat and hairless, but almost black, like its face had been caked with mud all its life. It was bent forward slightly, running and it was still 7-8 feet tall. I was shocked at the speed. This encounter took no longer than 10 seconds. We both stood there scared to death, really scared. We both were familiar with the concept of Bigfoot, and had heard the stories of \"monsters in the woods\". After we both got under control, I said, \"what was that\" and my friend said \"I dont know but I'm getting out of here\". We both started to run as best we could for the fence line and the road about a mile in front of us. When we reached the road, we were climbing a fence that lined the road, as were crossing this fence we heard the most bone chilling scream I have ever heard in my life. This just added to our terror and we continued to run for the car. We did make it out of there with nothing else to report. I had returned to that same area many times after, always with the same friend and never saw or heard another thing. That was 31 years ago and I can still remember it like it was this morning.","classification":"Class A","county":"Stone","state":"Missouri","latitude":36.67065,"longitude":-93.65774,"latlng":"-93.65774,36.67065","dewPoint":59,"humidity":0.61,"cloudCover":0.29,"moonPhase":0.24,"pressure":1020.33,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":9,"visibility":9.36,"highTemp":86.86,"midTemp":74.745,"lowTemp":62.63,"windBearing":157,"windSpeed":6.51}
{"id":"27410","timestamp":506044800,"title":" Man recalls his brief daylight sighting outside Bloomfield","observed":"It was winter of 1986, I was skipping school to ride around the Avert in Stoddard Co.MO. area looking for wildlife which I did often. I just crossed the Caster river bridge on the county road that now belongs to Golden Cat to transport their mineings. I saw a dark brown creature run across the road in front of me. It was on two legs jumped across the road and ran into the woods. Was gone in just seconds. I will never forget this, and have only told my wife until now. This is for real and I would like to hear from you!","classification":"Class A","county":"Stoddard","state":"Missouri","latitude":36.87593,"longitude":-89.86899,"latlng":"-89.86899,36.87593","locationDetails":"next to Golden Cat, Kitty Litter plant, between Hwy. Y and Ab","dewPoint":23.77,"humidity":0.59,"cloudCover":0.27,"moonPhase":0.15,"pressure":1018.78,"weatherSummary":"Partly cloudy until evening.","uvIndex":2,"visibility":8.97,"highTemp":50.95,"midTemp":36.35,"lowTemp":21.75,"precipitationType":"snow","windBearing":303,"windSpeed":3.31}
{"id":"1150","timestamp":959731200,"title":"Ape-like creature seen by a motorist crossing the road and enter a wooded area near Ozora, Missouri","observed":"Creature crossed small two lane paved road in front of vehicle late afternoon. No other vehicles in area, low volume road. Creature did not stop, but continued to cross the road and enter wooded area. My father is the witness, he described creature as tall, hairy {different shades of hair}, long arms, ape shaped face, with large stride, but almost limping.","classification":"Class A","county":"Ste. Genevieve","state":"Missouri","latitude":37.8602,"longitude":-90.0329,"latlng":"-90.0329,37.8602","locationDetails":"Hilly terrain, rural area, sparsely populated area, approximately 7 miles to nearest populated area.","dewPoint":66.04,"humidity":0.67,"cloudCover":0.15,"moonPhase":0.93,"pressure":1016.76,"weatherSummary":"Partly cloudy in the morning.","uvIndex":10,"visibility":9.32,"highTemp":89.05,"midTemp":78.025,"lowTemp":67,"windBearing":186,"windSpeed":7.67}
{"id":"23836","timestamp":214617600,"title":"Several incidents experienced by father and son outside St. Louis","observed":"This story has been told by my father, I remember him coming home as a kid an telling us his hunting stories,this story was the best, this story was never talked about again until this year when i learned about this site, I ask my father now in his late 60s about the story he told when we were kids, this happened in 1976, my father is an avid bowhunter, while leaving a deer stand and heading back to the house, he noticed a large man standing on the edge of a small  field, directly across from him. he had thought it was another hunter that hunted on the farm, my dad whistled at him to let him know he was there, there was no response, so he whistled again, no response, keep in mind this is a small winter wheat field.food plot.approx 100 yards across, my dad said he stopped and studied the figure and realized it was very tall, and it was not a man, he said his hair stood up, and he made his way to a dried up slough and headed towards the house, while navigating his way he said he could hear limbs popping behind him, when he stopped to listen it would stop, when he moved again it would move, he never seen the creature again until this year 32 years later in November 2008, while deer hunting again on the same farm, he called me and told me he seen something again, on the farm, this time he only got a glimpse of it, it was on its belly crawling up a deer trail out of a slough, he said it was black in color,and very large, he said he only got a glimpse of it and believed it to be one of the creatures. This area has very heavy jungle like foliage, if you have ever been in the river Missouri  bottoms, you know what I am describing, my dad would never tell this or report this to anyone. I have decided to do it so the info is out there.","classification":"Class A","county":"St. Louis","state":"Missouri","latitude":38.73802,"longitude":-90.53249,"latlng":"-90.53249,38.73802","locationDetails":"Missouri river bottoms above river from the 370 hwy bridge","dewPoint":34.87,"humidity":0.79,"cloudCover":0.66,"moonPhase":0.9,"pressure":1020.91,"weatherSummary":"Mostly cloudy until evening.","uvIndex":2,"visibility":6.21,"highTemp":46.12,"midTemp":39.585,"lowTemp":33.05,"precipitationIntensity":0.0003,"precipitationProbability":0.71,"precipitationType":"rain","windBearing":294,"windSpeed":8.54}
{"id":"36838","timestamp":1350259200,"title":"Man returns home at night to find a tall figure standing by his deer lick outside Farmington","observed":"I live outside Farmington MO and I have a deer lick just out side the wood line in my back yard and there is always deer. I was just getting home from work one night after I closed, it was about 11 and I like to see the deer just to see what we have around my house. And in the upper left hand corner of my yard about 25 yards away from my deer lick I saw a big figure about 7' maybe 8' tall. I was thinking it was a poacher in the yard killing deer. So I turned my brights on and started walking toward the figure. As I was walking I started to smell kinda like a smell of body odor and mildew smell and I was scared when I realized it wasn't a hunter. It took off down a game trail in the brush. I also need to say I'm not hunting off the lick, and the deer run when I pull up. I wasn't walking over there with a group of deer. But to continue, the next day I walked back into the woods and looked. There is a bunch of nesting spots for deer and a spot where it looks like a rock bed that smelled awful, like death.","classification":"Class A","county":"St. Francois","state":"Missouri","latitude":37.40025,"longitude":-90.23058,"latlng":"-90.23058,37.40025","locationDetails":"It's about 15 min out of Farmington.","dewPoint":46.13,"humidity":0.69,"cloudCover":0.02,"moonPhase":0.01,"pressure":1015,"weatherSummary":"Clear throughout the day.","uvIndex":4,"visibility":9.57,"highTemp":72.37,"midTemp":60.73,"lowTemp":49.09,"windBearing":276,"windSpeed":2.6}
{"id":"1148","timestamp":240451200,"title":"Family camping encounter large, fur covered creature. Footprints are discovered at the campsite","observed":"Large footprints and actually saw a large, fur covered creature of great size/height.","classification":"Class A","county":"St. Clair","state":"Missouri","latitude":37.9939,"longitude":-93.8794,"latlng":"-93.8794,37.9939","dewPoint":70,"humidity":0.76,"cloudCover":0.35,"moonPhase":0.02,"pressure":1016.44,"weatherSummary":"Humid and partly cloudy throughout the day.","uvIndex":8,"visibility":7.53,"highTemp":90.39,"midTemp":82.05,"lowTemp":73.71,"windBearing":154,"windSpeed":4.67}
{"id":"1356","timestamp":207705600,"title":"Husband and wife observe sasquatch at river's edge","observed":"My husband and I were jugging on the Missouri River.  We had the jugs all set out and was floating down behind them, when we saw something big and hairy on the bank getting a drink.  At first we could not see it that well, but the closer we got, the better we could see it.  It stood upon two legs and looked around for a few minutes.  It did not see us at first and it did not hear us because we had the motor off and I guess he finely saw us because he walked back up the bank into the tree area.  As he was walking, we could see trees falling, it looked like some type of machiner was going through there knocking them down, but there was no noise other than the sound of the trees being knocked down.  All my husband and I could do was look at each other.  I guess because neither one of us could believe what we saw for years.  We did not tell anyone because we did not want anyone to think we were crazy.","classification":"Class A","county":"St. Charles","state":"Missouri","latitude":38.655,"longitude":-90.675,"latlng":"-90.675,38.655","locationDetails":"St. Charles side of the Missouri River above the St. Louis Water Department","dewPoint":54.09,"humidity":0.62,"cloudCover":0.33,"moonPhase":0.2,"pressure":1018.93,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":8,"visibility":9.41,"highTemp":79.26,"midTemp":71.545,"lowTemp":63.83,"windBearing":23,"windSpeed":7.93}
{"id":"15236","timestamp":1150588800,"title":"Possible vocalizations heard by campers on the Current River","observed":"Hi, My brother and I were camping @ Jerktail Landing on the shores of the Current River in MO. It's about 2300hrs and we don't have the fire on yet.  We wanted to see what creatures would get close. This a fairly remote primitive campsite. About 30 feet from us in the woods, we heard the growl and scream of something big. Our instincts told both of us that it could be a Bigfoot. The fire came on really quick after that. We had such an adrenaline rush that we started to giggle like little girls. We never even spoke of bigfoot before and we were not expecting or hoping for something like that. We were there for 4 nights and that happened the first night. We ask the rangers the next day and they said that it could be a bobcat. When we got back home we search for all the sounds from creatures that live around that area, but nothing sound it like it....","classification":"Class B","county":"Shannon","state":"Missouri","latitude":37.2306,"longitude":-91.30804,"latlng":"-91.30804,37.2306","locationDetails":"The campsite its 7 miles into the Mark Twain Nat. Forest from HWY 19. The spot its a gravel bar near the shore of the river.","dewPoint":67.65,"humidity":0.78,"cloudCover":0.53,"moonPhase":0.75,"pressure":1012.83,"weatherSummary":"Mostly cloudy until evening.","uvIndex":8,"visibility":9.36,"highTemp":86.58,"midTemp":76.475,"lowTemp":66.37,"precipitationIntensity":0.0084,"precipitationProbability":0.57,"precipitationType":"rain","windBearing":216,"windSpeed":6.37}
{"id":"22448","timestamp":-14601600,"title":"Early morning sighting near Scott City Diversion Canal","observed":"the guy from scott city mo. i dont think is telling a tall tail. you see i am from scott city mo. and moved when i was young. but still have family there. there is a fishing spot called the barr pits in a perty remote area near the river, and my grandfather was the care taker for many years. when we would visit i would always go with grandpa to open the gates and close the gates.well to make a long story short i saw it and so did grandpa he said not to worry he wouldnt bother nothing he saw them every once in a while. i never said any thing till now","classification":"Class A","county":"Scott","state":"Missouri","latitude":37.236,"longitude":-89.55949,"latlng":"-89.55949,37.236","locationDetails":"Outside Scott City near the Diversion Canal.","dewPoint":74.42,"humidity":0.76,"cloudCover":0.27,"moonPhase":0.06,"pressure":1017.98,"weatherSummary":"Partly cloudy until evening and humid throughout the day.","uvIndex":9,"visibility":6.42,"highTemp":94.01,"midTemp":83.735,"lowTemp":73.46,"windBearing":157,"windSpeed":4.87}
{"id":"28080","timestamp":435888000,"title":"Woman remembers evening sighting while driving on Hwy. T near Oxly","observed":"My mother and I were on our way from church. As we drove down T Hwy. we observed a large creature standing in the center of the road. I stopped the car several feet away and it turned and looked at us and then in one big jump went from the middle of the road, over a fence and loped across the field. I hit the gas and got us home and we RAN into the house, locking the door behind us and making sure the windows were locked as well. We were both frightened for months but never saw it again.","classification":"Class A","county":"Ripley","state":"Missouri","latitude":38.21285,"longitude":-90.66216,"latlng":"-90.66216,38.21285","dewPoint":42.11,"humidity":0.7,"cloudCover":0.55,"moonPhase":0.62,"pressure":1025.51,"weatherSummary":"Mostly cloudy until afternoon.","uvIndex":3,"visibility":7.8,"highTemp":59.49,"midTemp":48.905,"lowTemp":38.32,"windBearing":333,"windSpeed":7.67}
{"id":"56388","timestamp":1405468800,"title":"Night driver snaps photo of bipedal animal on remote gravel road near Annapolis","observed":"I was on my way home from town between 10:30 and 11:00 pm. As I was coming around the gravel road I received a message on my phone. As I opened my phone to check my message I seen a creature walking upright across the road. It stood about 6 to 6 and a half ft tall. I quickly started backing out of my messages trying to access my camera on my phone. At the time I first seen it, I was about 50 yards from it. By time I came to a stop I was within 25 to 30 yards from the creature. When I first seen it, the creature was in the middle of the road in the process of walking straight across the road. It wasn't In a hurry, it calmly walked across the road and stopped about 5 ft. off the road still in sight. I was able to take a picture of it before it walked off into the woods. From the moment I seen it, it never took its eyes off me. I tried to switch my camera over to video but it was too late. It was gone. I was fortunate enough to take the picture I got before it was gone. That is definitely a night I will never forget.","classification":"Class A","county":"Reynolds","state":"Missouri","latitude":37.30427,"longitude":-90.83465,"latlng":"-90.83465,37.30427","locationDetails":"County road (removed for privacy)","dewPoint":53.14,"humidity":0.68,"cloudCover":0.11,"moonPhase":0.66,"pressure":1017.2,"weatherSummary":"Partly cloudy in the afternoon.","uvIndex":9,"visibility":9.79,"highTemp":75,"midTemp":64.865,"lowTemp":54.73,"precipitationIntensity":0.0003,"precipitationProbability":0.05,"precipitationType":"rain","windBearing":350,"windSpeed":2.41}
{"id":"38519","observed":"We have a farm with 100 acres, and it is thickly timbered, with lots of wildlife. We do regular ''squatch'' investigations also. We were doing one in late September to October. The early evening with the sun shining through the trees, and when my daughter turned the corner on our gator, as she looked ahead, there was a tall black figure picking leaves off of the tree. The sun was on the opposite side of the figure where you could see the tips/chunks of hair all over it. As we were leaving, we heard four huge howls that could not have been a coyote. We left immediately after this. A few weeks after this encounter in the morning we were just about to head back to the house and were finishing up with some wood-knocks, and rock-clacks. We did one last call, when all of a sudden a rock was thrown at our Polaris. We also got a picture of the animal. It was a very frightening experience and we immediately left and didn't return for a few weeks! Thank you so much for your time!! We would love for you to come to the squatchy Missouri.","classification":"Class A","county":"Ray","state":"Missouri","locationDetails":"In Richmond Missouri, at a little farm."}
{"id":"4421","timestamp":390268800,"title":"Soldier in basic training has daylight sighting at Fort Leonard Wood.","observed":"I was going through Army basic training at Fort Leonard Wood, MO.  Our platoon was on the last leg of our training and one of our final training events was guard duty at different locations throughout the post.  We were paired up and given our assignments, issued our weapons and three live rounds (Barney Fife-esque), and proceeded to load up on a deuce and a half (army 2.5 ton truck).  As we loaded up into the truck, I was the last one on since my last name starts with \"Y\", and we always did things alphabetically (significance to come later). It was mid to late afternoon and the trainee I was paired with and I were assigned to guard a bridge crossing training site that army engineers use.  It was the furthest guard site from main post, so we were to be dropped off first to guard it overnight (didn't really need any guarding since it was unoccupied at night and weekends, plus it was in the middle of nowhere - we were doing this merely for the training benefit.)  I don't really have any idea where the site was and didn't really care, all that I knew is that we must've been traveling for about 20 - 30 minutes from main post when my sighting occurred.  It must've been about 1600 - 1700 hours and we were on dirt roads.  I was sitting on the bed of the truck looking out the back, while everyone else in the platoon were able to snag bench seats on either side of the vehicle facing one another.  Everyone else was sleeping or drowsing at the time, except for me in my uncomfortable seat on the bed of the truck.  We came to a \"T\" intersection and turned left. About 30-40 feet from the intersection the other direction, I observed a bigfoot.  What is amazing to me to this day is that I am the sort of person who really doesn't believe anything unless I observe it myself, but at that initial glance, I knew immediately that it was a bigfoot - not a bear, not a big person dressed up, just a bigfoot, no doubt.  A bigfoot was on the road, looked in the direction of the vehicle, and ambled across the road into the woods.  My second thought was to scream and yell to notify someone else in the platoon, but I immediately quashed this idea since by the time I would be able to rouse anyone, the bigfoot would probably be in the woods by then.  No need for me to be rambling on about a bigfoot without any other eyewitnesses in this type of environment.  So I alone observed it. My sighting was of short duration, about 10 seconds if that, and I don't have a lot of details, but I remember that it was tall, had to be at least 6.5 feet to 7.5 feet.  I don't remember any distinctive features, except for one.  Bigfoot had brown to light brown hair/fir coloration.  I though this was extrodinary since every previous thought that I had about bigfoot comprised of black fir.  That's about it, except that during this short sighting, my mind went through all the possible explanations of what this could be besides a bigfoot and dismissed all of them.  No doubt in my mind that I saw a bigfoot. After my sighting, we were dropped of about 10 minutes later and I spent an extremely nervous night in the wilderness at this river crossing sight.  Kind of glad I had my 3 Barney Fife rounds.  I was not really surprised that they called this \"Fort Lost-In-The-Woods\" as a nickname, because it is really isolated.  I have never really made a big deal of this sighting, or do I plan to.  All I know is that bigfoot exists, and I saw it.  I am probably one of the most credible witnesses that I can imagine.  I spent 15 years in the army, most of them as an army intelligence officer, before taking an early out and now I am a civilian working for the Coast Guard as an intelligence specialist in a District office of law enforcement.","classification":"Class A","county":"Pulaski","state":"Missouri","latitude":37.714,"longitude":-92.173,"latlng":"-92.173,37.714","locationDetails":"All I know is that it was about 5-10 minutes drive from a river crossing training site somewhere on Fort Leonard Wood.","dewPoint":56.16,"humidity":0.66,"cloudCover":0.38,"moonPhase":0.74,"pressure":1014.22,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":9,"visibility":8.36,"highTemp":82.51,"midTemp":73.645,"lowTemp":64.78,"precipitationIntensity":0.0008,"precipitationProbability":0.49,"precipitationType":"rain","windBearing":192,"windSpeed":8.19}
{"id":"4116","timestamp":956275200,"title":"Woman hears nighttime screams near Polk.","observed":"I didn't actually see it.  But I heard it on 2-3 occasions in the middle of the night while I was wake in bed.  It was a very loud high pitched scream, loud enough to wake me up one time in the middle of the night.","classification":"Class B","county":"Polk","state":"Missouri","latitude":37.7664,"longitude":-93.5395,"latlng":"-93.5395,37.7664","locationDetails":"The area is open fields along with heavy wooded areas.  Mostly for cattle grazing.  We lived on a 200 acres farm at the time.  We lived on a gravel road about 3 miles outside of town.  It was road 157.","dewPoint":34.92,"humidity":0.54,"cloudCover":0.25,"moonPhase":0.6,"pressure":1017.81,"weatherSummary":"Partly cloudy in the morning.","uvIndex":10,"visibility":9.59,"highTemp":67.55,"midTemp":53.485,"lowTemp":39.42,"precipitationIntensity":0.0001,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":319,"windSpeed":10.91}
{"id":"3667","timestamp":995587200,"title":"Eerie vocals in the forests of Karlin.","observed":"My girlfriend and I both live in a small area, filled and surrounded by hills and forests.  During the summer I would often stay at my her house until midnight before going home.  Often (once or twice a week) I would hear strange noises coming from the woods next to her house as I walked to my car.  It sounded like people laughing, only a little different... it's tough to explain.  It was like laughter, but there was something off about it.  It just didn't sound like human laughter.  The sound was terrifying.  It was almost like it was artificial, but I know that it couldn't have been someone trying to play a trick.  There are very few people nearby, and they're all older people and farmers.  Anyway, the \"laughing\" continued for two or three months.  Eventually, my girlfriend admitted that on her daily walk through the hills she had heard strange sounds as well, but the calls she heard were more like babies crying rather than people laughing.  She also found it to be eerie and inhuman.  she eventually heard the laughter too, as did her mother and one of her neighbors.  it disappeared for some time, but then came back about a few weeks later, just in time to keep her and her visiting sister from sleeping.  After that, whatever it was became more bold.  It started venturing into her yard at almost exactly 2:00 AM every morning.  We would both hear it walking around outside, going through her trash, and knocking things over.  Her dogs would usually get riled up and bark at it for about an hour every night (until it left, I suppose). One dog was apparently kicked or attacked by it, because I heard it being struck and a sharp yelp, then the following day it seemed to limp a bit and was afraid of us.  After that, I didn't really hear much from whatever it was again.  The phenomena went on for over half a year, but as soon as it started getting cold things suddenly stopped.  Maybe it migrated, I don't know.  I don't know what it looked like either, since I never actually saw it.  I tried to find it, but never came up with any physical evidence other than missing apples and overturned garbage cans.  I've figured it was probably a MoMo, or something of that sort.  I can't say with certainty, but I can say that it wasn't normal.  Nothing that lives in Missouri makes sounds like that.","classification":"Class B","county":"Polk","state":"Missouri","latitude":37.54661,"longitude":-93.41,"latlng":"-93.41,37.54661","locationDetails":"4893, S. 136th Rd. Bolivar, MO. 65613.  The forests and hills of Karlin, between Bolivar and Morrisville.","dewPoint":72.33,"humidity":0.73,"cloudCover":0.09,"moonPhase":0.99,"pressure":1014.73,"weatherSummary":"Humid throughout the day.","uvIndex":10,"visibility":7.92,"highTemp":92.19,"midTemp":83.16,"lowTemp":74.13,"windBearing":179,"windSpeed":3.99}
{"id":"1138","timestamp":603504000,"title":"Family witness a 7-8 foot tall creature, covered with hair, standing in the middle of the road","observed":"I am not sure of the date. My daughter was 1-2 years old, so it would have had to have been in 1988 or 1989. We were going from Crocker, MO. to Waynesville/St. Robert, MO. to Wal-Mart.  We crossed the Waynesville/Crocker bridge on Hwy. 17 (North of Waynesville, South of Crocker) and were almost out of the \"Waynesville Corners\" --this highway has several corners and curves after the bridge because it has a bluff on one side and the Roubidoux Creek/Gasconade River on the other.  When we were almost through the corners and coming up on the \"40 MPH Speed Limit Sign\" which means that we are getting close to entering the Waynesville,  MO. city limits.  It was a winter night, about 7:00 pm and had been dark for about 2 hours .  We rounded a corner and were meeting a car--both of us had our headlights on -- and there in the middle of the road--standing right on the yellow line which separates the two lanes--is this \"thing.\"  It was about 7-8 feet tall and covered with hair.  It was almost \"frozen,\" much like a deer is when the headlights of a car hit it.  My husband was driving and he slammed on the breaks, as did the car that we had met.  At this time, we were just passed the creature, as was the other car.  But, both of us had stopped--and there standing on the yellow line of Hwy.17, and being illuminated by the tail lights of both vehicles--still stood this creature.  It stood there for about 30 seconds and then it sort of leaped off the roadway and into the Roubidoux Creek/Gasconade River.  At this time, I was extremely scared and was pleading with my husband to just \"GO!\"--so we took back off, as did the other car.  We continued on toward Waynesville and the other car continued on toward Crocker.  We did not get out to  investigate, and as far as I know, the other car didn't either. We had no weapons with us (just in case we would need them) and it was dark--and suddenly very eerie.  I have never heard of any  stories of this particular incident, so I assume that the other people who witnessed this had the same idea that we did--NEVER TELL A SOUL--we have discussed this with close friends and family,  but no one else--until now.  When I visited this web site and found out that there were acutally other sightings in the state of Missouri, I thought maybe there was some worth to telling about this night. (I forgot to add that it was drizzling that evening).","classification":"Class A","county":"Pulaski","state":"Missouri","latitude":37.82861,"longitude":-92.20055,"latlng":"-92.20055,37.82861","locationDetails":"This occured on Hwy. 17 North of Waynesville, MO. (Pulaski County) almost exactly even with the \"40 MPH Speed Limit Sign\" When we got on up to the junction of Hwy 17 and Bus. 44, there was a residential structure fire and the Waynesville Fire Dept. was there. They had their water hoses ran across the intersection and had a metal ramp laid across the hoses, so that cars could drive over them. It was a very cold night and the water was running across the roadway and freezing. This made the intersection extremely slick. So, this information should be fairly easy to obtain. (If I find out, I will add this to my report.)  37:49:43 N 092:12:02 W","dewPoint":32.25,"humidity":0.91,"cloudCover":1,"moonPhase":0.34,"pressure":1029.84,"weatherSummary":"Light rain in the morning.","uvIndex":2,"visibility":3.16,"highTemp":36.9,"midTemp":31.41,"lowTemp":25.92,"precipitationIntensity":0.0108,"precipitationProbability":1,"precipitationType":"rain","windBearing":7,"windSpeed":5.74}
{"id":"36407","timestamp":1346716800,"title":"Mother & daughter hear possible vocalizations outside a home near Richland","observed":"Highway 7 South, Richland, MO 2158 September 4, 2012 My daughter who had come to visit me was getting ready to leave.  We were taking a last minute look at my garden which is very close to the house.  We had only been out there a couple of minutes and then we heard the most unusual screaming sound.  My daughter asks if it was a coyote and I said NO and ushered her back to the house.  The call came less than 150 feet from the house.  It was loud and remarkable.  The dog that usually barks and runs after everything ran under the house. I did not say what I thought it was to her; instead we looked on the internet for sounds that might occur, like coyotes, panthers, fox, Barn owls, etc. After going through the whole directory.  She asks what the sound was.  We then listened to recorded sounds from Big Foot recordings.  Our stomachs turned. Yes, that is exactly what it sounded like.  I have lived in the country most of my life.  I grew up listening to coyotes and the occasional panther, bobcats, owls, Ferrell dogs and deer they all can make weird sounds.  But this, this is crazy.  I never thought that I would hear something like that in my woods.  I live in the river bottoms and I remember when I was young we heard the same sound, that was over thirty years ago. When I thought back on what happened, I realized that before we left the house my inside dog and cat were acting strange, pacing and panting. When we exited the house to go to the garden I should have known something was not quite right.  There were no night time sounds.. No crickets or frogs .. Just silence.. I finally put on my brave face and escorted my daughter to her car and pretended like everything is ok.  I could still hear snaps and cracks in the woods.  I watched her drive off then quickly got back in the house.  In the morning......I'll go look for other evidence, for now you couldn't pay me to go outside and I don't spook easy at all! When I calmed down I am sure I will wish I had walked towards the sound, but for now... I am glad I am inside.","classification":"Class B","county":"Pulaski","state":"Missouri","latitude":37.50983,"longitude":-92.22327,"latlng":"-92.22327,37.50983","locationDetails":"Approximatley .5 miles from the Gasconade River.  Four water supplies with in 1200 feet, abundant deer and wild life.  We don't hunt the land.  Approximately 100 acres, minimal population.","dewPoint":69.34,"humidity":0.72,"cloudCover":0.16,"moonPhase":0.64,"pressure":1011.05,"weatherSummary":"Partly cloudy in the morning.","uvIndex":8,"visibility":9.49,"highTemp":92.88,"midTemp":84.23,"lowTemp":75.58,"precipitationIntensity":0.0011,"precipitationProbability":0.22,"precipitationType":"rain","windBearing":141,"windSpeed":3.36}
{"id":"46676","timestamp":1412121600,"title":"Soldier reports possible vocalizations during a morning group run at Fort Leonard Wood","observed":"I am a Soldier stationed at Fort Leonardwood, MO.  Every morning we do physical exercises such as running.  That morning we did a 3.8 mile run on the \"Engineer Trail\".  The Engineer trail is a giant 3.8 mile track that has about 10 acres of land in the middle of the circle for land navigation exercises, and towards the back of the track opens up into a giant forest that feeds into Misty Mountain and the outer section of the post.  That land behind the track is 100+ acres I'd say.  On the morning of 1 October, 2014 around 0600- 0615, we (about 15 Soldiers) started our run individually, so we were spread out being some were faster than others.  About midway through the track, we came across a barrier.  A tree about 3-4 feet in diameter that looked to be healthy, not rotten, and relatively in good shape was laid across the track.  We haven't had any crazy wind storms that could've knocked it over, but at any rate myself and other soldiers didn't think anything of it.  As i continued on my run, I encountered another tree that was knocked over but it looked as if someone, maybe some soldiers, had drug it off the road.  Same diameter as the other one, but almost as if someone didn't want us on the track.  I continued on my run and about a mile and half I reached the the back side of the track where it meets the woods that go towards the eastern side of the border of post.  That's when I started hearing a yell that kind of sounded like \"whoops\".  It must've been around 200 feet away.  I immediately stopped running and started listening.  That's when I heard around 5 different \"whoops\".  I say around 5 because each time I heard it, I had to change the position of my head each time I heard one.  3 were from inside the circle of the track, and about 2-4 were on the border of track on the backside.  Being that I was out there alone, (I was in the lead of the pack of Soldiers) I didn't want to encounter what I was hearing I started running to get away from the back side of the track and back towards the civilization side with a quickness.  I know what I heard immediately being that I google, youtube, and watch a lot of documentaries on bigfoot.  The thing was when I got back to the start point, I didn't want to mention what I had heard in fear I might be made fun of or something.  So when the rest of the group caught up and finished.  They immediately started talking about the sounds.  A few of them even mentioned \"bigfoot calls\", with a seriousness.  Most people when they talk about bigfoot, you always get the guys who are sarcastic and snobby.  Well this group of Soldiers we all agreed, there was a family of them out there talking to each other out there on the track. On top of that, I have encountered this odor before when me and my wife will go ride trails on the 4 wheeler, a musky odor.  The entire run, all I could describe the odor as is like a musky/ sewage smell the entire route.  We have ran that route several times, and normally all you smell are the trees and weeds around.  This time it was completely odorless almost to a gagging kind of way.  I wouldn't think twice about saying me and the soldiers I ran with that day encountered a family of sasquatches.","classification":"Class B","county":"Pulaski","state":"Missouri","latitude":37.4504,"longitude":-92.5415,"latlng":"-92.5415,37.4504","locationDetails":"Engineer trail, Fort Leonard Wood MO","dewPoint":60.69,"humidity":0.68,"cloudCover":0.11,"moonPhase":0.25,"pressure":1009.79,"weatherSummary":"Rain in the evening.","uvIndex":5,"visibility":9.49,"highTemp":85.84,"midTemp":77.245,"lowTemp":68.65,"precipitationIntensity":0.0082,"precipitationProbability":0.09,"precipitationType":"rain","windBearing":162,"windSpeed":7.18}
{"id":"38339","timestamp":1352937600,"title":"Possible nighttime activity at a rural home near Rayville","observed":"First off I would like to say that I am not one to normally see much of anything, I am a believer in the possibility of many things but rarely see them.  In this instance, again I didn't so much see anything as hear it. The first incident took place in the middle of November of 2012.  It was in a rural area of Missouri outside the city of Rayville.  The area is a mix of farm and woodland.  It was approximately 9pm when I drove to a friend's house.  As I was walking from my car to his door I noticed what sounded like someone or something big walking about 30 or 40 yards away from me in the woods. It was just beyond the range of what I could see into the woods. When I stopped walking it stopped walking and when I started to walk it began again.  It was only about a 40 foot walk to the door and I walked slowly as I tried to figure this out.  About half way I stopped to think and it stopped once more.  From what I heard it was a sound of only 2 feet walking and was large.  It didn't sound at all like a 4 foot creature like a deer.  I went in to tell my friend but when we came out there was no sound.  About a week later I came out again and was walking to the door and jokingly called out \"are you there bigfoot?\" and laughed to myself. As I approached the door something flew out of the woods and hit my friends car.  Later in the evening when I left, in the distance I heard dogs going crazy and the sound of something large screaming.  It has been several weeks since I last heard anything but my friend says he too has heard the sound of something walking in the woods.  I have thought about if it was a person possibly playing a joke but no one knew I was going there.  Thought about it being another animal but it sounded too big to be a deer.  It has me extremely curious so I would love some feedback and your thoughts.  As I say I am not one quick to jump to conclusions and tend to be the first to look for other causes to things.","classification":"Class B","county":"Ray","state":"Missouri","latitude":39.20894,"longitude":-94.2908,"latlng":"-94.2908,39.20894","locationDetails":"This happened near Rayville, Mo.  From the town of Richmond MO go west on MO 10 for about 4.5 miles and then turn down Rayville RD (RR C) for about around 6 miles till you get to Orr road.  This is a gravel road.  Follow it till you reach 144th street where my friend's house is and where I heard what I heard.","dewPoint":31.38,"humidity":0.61,"cloudCover":0.21,"moonPhase":0.07,"pressure":1026.58,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":2,"visibility":9.89,"highTemp":55.08,"midTemp":43.63,"lowTemp":32.18,"windBearing":197,"windSpeed":2.73}
{"id":"46826","observed":"Me, my uncle and son was bow hunting for deer and had set us a camp alongside of a food plot that the state park had planted for the wildlife. The day was October the 17, 2014 at approximately 10 pm. We were at camp sitting around the camp fire, when these woops and low growls started happening around us. My uncle went into the camper and got his mag flashlight which produces a very bright light, and started scanning the food plot. As he was scanning it, we saw this reflection which resembled a light shining off of a mirror. Now the reflection came from behind a tree top or brush pile, when we saw it the whole tree top began to shake and move around. Soon the tree top stopped moving and then we heard these footsteps moving through the woods behind the food plot. Well, fear soon set in and we all made our way to the camper went in and locked the door behind us. After an hour or so, I had to bleed my bladder like something fierce. However, after what I saw, I refused to go outside by myself. So with a little persuasion, my uncle and son decided to go out with me. Almost immediately, the woops, howls, and the low growls started up. My uncle just could not resist himself, so the flashlight came on and started scanning the field again. After my business was complete, I parked myself beside the fire while my son and uncle done some more investigating. All of a sudden, hands started waving, and the call come here, come here, was told to me. Still afraid and shaken up by the previous experience, I wasnt too interested in what they were seeing. However, I made my way over to them to see what was going on. But for some reason, I just could not see what they were seeing. Look there by the tree, see it, see it. Soon I saw this movement, like an arm sliding down this tree, and behold there it was, a Big Foot. O my God, I could not believe it, there standing beside this White Oak tree this massive creature was standing there with his right arm wrapped around this tree trying to blend in with it I guess. The next morning we went and hunted again, and on our way back to camp, my son and I stopped on what we have named, Big Foot Ridge, because every time we hunt there, these Big Foots just will not leave us alone so we can hunt. However, a BFRO expedition was in progress there lead by Ron. My son and I stopped by to see if they were still there and thank God he was. We told him what had happened, he followed back to our campsite and done his own investigation, which included measuring what we had seen, and the creature stood approximately 75 All of my life I have heard tales of Big Foots, personal experiences, and never believed that I myself would ever see one, now I have.","classification":"Class A","county":"Reynolds","state":"Missouri"}
{"id":"49971","timestamp":1444521600,"title":"Possible whoops heard while stargazing near Van Buren","observed":"On 10-11-2015 at approximately 10 pm I was driving around and thought I would stargaze at the old conservation fire tower on 21 highway near the old 21 drive-in. I parked my truck by the picnic table. I turned off my truck and got out looking at the stars. It was just a moment and I noticed a whooping call it sounded like a monkey at the zoo. I listened for a good 20 minutes the call was the same a whoop whoop then a pause for a short time then another whoop whoop. It sounded like it was coming from the heavily wooded valley below me.","classification":"Class B","county":"Reynolds","state":"Missouri","latitude":37.05571,"longitude":-90.89388,"latlng":"-90.89388,37.05571","locationDetails":"From U.S. Highway 60 near Van Buren Missouri  Go north on 21 highway cross into Reynolds county the first county road on the right go to the end of the road and it will fork stay to the right through the sawmill you can see the fire tower from highway 21","dewPoint":49.25,"humidity":0.68,"cloudCover":0.01,"moonPhase":0.96,"pressure":1013.62,"weatherSummary":"Clear throughout the day.","uvIndex":5,"visibility":8.56,"highTemp":79.04,"midTemp":68.875,"lowTemp":58.71,"windBearing":187,"windSpeed":6.76}
{"id":"12528","timestamp":893462400,"title":"Campers have a night-time encounter in Mark Twain National Forest","observed":"About seven years ago some friends and I went camping.  At a lake called Fourche Lake.  The lake is a small sucluded lake about 10 acres or so and not very heavily used in the Mark Twain National Forest.  There is one road in and about 3-5 miles off the highway.  So I cant imagine anyone out there and if they came down the road we would have heared them unless the walked and it would have been a long walk.  We where all siting around the camp fire talking and something come runing out of the woods.  Just out of the distance of the light of our camp fire and ran down toward the lake.  Where the moon light was the fairly bright.  It ran around that area for awhile almost like it was running circles like it was confused.  It also was waving it arms and making a very strange noise.  Then ran back in the woods. It's appearance was diferent from most that people report.  It was about four feet tall like a baby bigfoot.  It was on two legs and very stalkey and the sounds it made were not like any of the ones on your web sight. A few years back I was whatching a t.v. show that was about bigfoot.  They had some audio of sounds much like the ones you have.  But there was a man in Colaorado that had a recording that was diferent he had it tested by some scientist and he said it was something unexplainable.  But it sounded just like what I herd. Now I dont know what I herd or saw was a big foot. But I know I can't explaing it.  I have done a lot of camping and hunting before and since this and have never seen or herd anything like it.","classification":"Class A","county":"Ripley","state":"Missouri","latitude":36.66708,"longitude":-90.9525,"latlng":"-90.9525,36.66708","locationDetails":"37 mileseast of Riverton Mo turn on V highway go five or so miles turn on the government road When you see the sign fo Fouche Lake go three to five miles down there to the lake.","dewPoint":51.07,"humidity":0.58,"cloudCover":0.13,"moonPhase":0.97,"pressure":1010.87,"weatherSummary":"Partly cloudy in the morning and breezy starting in the afternoon, continuing until evening.","uvIndex":10,"visibility":9.39,"highTemp":77.07,"midTemp":69.05,"lowTemp":61.03,"precipitationType":"rain","windBearing":183,"windSpeed":12.46}
{"id":"18278","timestamp":784512000,"title":"Late night sighting by young couple in a parked car on a rural lane outside Kelso.","observed":"[Editor's note:  The initial report was submitted by a friend and co-worker of the witness. The BFRO investigator eventually spoke with the witness by phone (see investigator's notes below). The witness never typed up the report himself. The friend's version of the story is more or less consistent with the story told by the witness, so it will remain accessible here.] I worked at plant that produces feed grade Amino Acid additives.  Our company is Japanese-owned and had just expanded, adding a new plant to the existing one.  As a shift worker, we work 2 weeks on the day shift, then switch to 2 weeks nights...it's hell on the body's sleep cycle. Anyway, in November of 2000, a fire started in the new plant and as a result, some of the new hires were assigned to work with us in the old plant while their facility was being repaired.  One night, we were sitting in the lunchroom, around midnight, grabbing a bite to eat.  I made the remark about a \"less than helpful\" co-worker to the tune of, \"he's like Bigfoot, occasionally there's a sighting\", eluding to the fact that this particular co-worker had a tendency to hide on midnights and leave all the work to the rest of us.  We all laughed, but one of the new guys got real quiet and his eyes got real big and serious...then he said, in the most serious tone...that sh@% is for real!  We all got very quiet and as we calmed to listen, he told his story. Now this is a guy who was well-liked because he was such a \"crack-up\" which is what you need to have in the manufacturing sector.  He went on to tell the story of how he encountered a Bigfoot when he was on a date in Chafee, Missouri. Him and his girlfriend were parked on a narrow dirt road, just off a county road near Scott City, Missouri.  They were doing what young folks do in a car on friday nights, and when they were ready to leave, they started the car and turned on the headlights.  About 20 yards ahead, they saw a creature, frozen, looking back at them with yellow eyes.  They couldn't turn around due to the narrow lane, so he put it in reverse and backed out about 100 feet to the road and made haste into town.  He said they were so scared, they believed the creature might be on top of their car, that they drove to a convenience store where a group of people were gathered, in the hopes that if people started to scatter, they were correct in their assumption that a Bigfoot was on top of their car. We all sort of laughed at his story, but he remained serious...and I've got to tell you, this seemed strange, because he is normally a very funny guy and his face was quite sullen as he told his story. I sort of believed him and inquired from some of the others as to what they thought. Some say there is a creature in Southeast Missouri known as Yehoo man, so it's not a new phenomenom.  I've been waiting seven years now and noone in this area has posted any reports of sightings here.  I check this site every once in a while and decided to finally tell this story because I believe the young man saw a Bigfoot and I even had him take me out to the location. It happens to be close to a residence, although out in the country, and located close to a stream with trees on both sides of the lane he claimed to be parked in.  It's just another one of those accounts that will probably add to the mystery of what I believe is the last frontier of animal science.","classification":"Class A","county":"Scott","state":"Missouri","latitude":37.286,"longitude":-89.6075,"latlng":"-89.6075,37.286","dewPoint":38.53,"humidity":0.7,"cloudCover":0.62,"moonPhase":0.3,"pressure":1023.7,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":2,"visibility":9.68,"highTemp":55.27,"midTemp":49.77,"lowTemp":44.27,"windBearing":70,"windSpeed":3.64}
{"id":"1141","timestamp":395539200,"title":"Two six foot tall creatures seen by witness.","observed":"In the summer of 1982, I was 12 years old and went to my first Scout summer camp, near Osceola, Missouri. The entire region is part of the \"Ozarks\" with thousands of square miles of wilderness. One afternoon Myself and another scout were assigned to go to the next camp over, Camp Lonestar, to work on a Tower-Building merit badge. We got tired of this after about 2 hours and decided to walk the 10 miles back to Camp Frontier where my troop was - maybe we'd make it back in time for dinner. We asked one Scoutmaster if there was a shortcut between the camps, he said yes, and pointed us in the right direction. This trail had been used until 1970, when a flood had washed out a bridge. We proceeded about 3 miles down this trail when the forest canopy became so dense, it virtually blocked out almost all sunlight. The foliage on the forest floor was just as dense - someone standing just feet away could be lost to view. Boulders & fallen trees were so thick the trail was soon lost, but we kept going in a Northeast direction, where we thought our camp was. We then heard a crashing sound through the underbrush coming from the Southeast. We stopped to listen & thought it might be a deer, which are common in this area. It was then I saw something that scared the Hell out of me. I saw 2 \"Creatures\" about 6 feet tall, covered in dark brown fur, about 100 feet away from us. They broke out of a thick stand of trees to my left, running faster than any human being could run, over serious obstacles such as large rocks, fallen trees, & thick undergrowth faster than I ever could. They then crossed the path we were about to take about 80 feet in front of me, ran down rocky, log-filled embankment, JUMPED a 10-foot wide stream, and scrabmled up the other side. They then disappeared into the forest on the other side of the stream. I froze with fear, not believing my own eyes. At first I thought I was looking at Chimpanzees, but these things were taller and bigger than me (I was 5'6\" at 12 years old). These things seemed like they were \"racing\" each other much like children do. I saw them for about 10 seconds before they disappeared, and they definitely were bipedal, similar to Human form, and they were swinging their arms over their heads each time they jumped over a large obstacle, just like Hurdlers would in race. There was no way I was going to go any further down this trail no matter what. We were scared out of our minds, and ran back the 4 or 5 miles to the main road as fast as we could. We then hitched a ride from a Scoutmaster back to our camp. When we returned, we told our Scoutmaster everything we saw. He didn't believe us - neither did anyone else. To this day I think of it, knowing that there is no way a human being could run that fast over logs & boulders & down a steep ravine like that in fur suit in 99 degree weather. When I read some of the other sightings in the southern part of Missouri - I know that there are still Unknown primates in that area. For anyone who has ever been in this region, the forests are so thick & there are so many limestone caves, ANYTHING could be hiding there.","classification":"Class A","county":"St. Clair","state":"Missouri","latitude":38.0944,"longitude":-93.5577,"latlng":"-93.5577,38.0944","locationDetails":"Near the H. Roe Bartle Scout Camp","dewPoint":69.98,"humidity":0.72,"cloudCover":0.62,"moonPhase":0.81,"pressure":1015,"weatherSummary":"Humid and mostly cloudy throughout the day.","uvIndex":7,"visibility":7.69,"highTemp":88.73,"midTemp":81.525,"lowTemp":74.32,"precipitationIntensity":0.0002,"precipitationProbability":0.25,"precipitationType":"rain","windBearing":173,"windSpeed":9.11}
{"id":"10927","timestamp":1129334400,"title":"Bow hunter observes animal lying down in the Creve Coeur bottoms.","observed":"While Bow-hunting in Creve Coeur bottoms, I had been in my stand all day and had no luck. So I got down right before dusk and proceded to stalk along side a trail leading to the river. I had come to a point were the trail turns and runs parelell to the river.When I started around the turn something moved in the corner of my eye off to my right. My first thought was that I was going to scare up a deer, So I drew my Bow and tried to take aim on the area of movement, But what I saw was not a deer. At first, I thought it was a man in camo laying on the ground, That freaked me out, so I let off my Bow. However, I was trying to make out this \"person\" laying on the ground, on thier belly, When it raised up on it's right arm, turned the upper half of it's body, And looked at me. This was no person. It was to dark to see any features, But I could see two legs stretched out behind it, Two arms in front, A large torso, And a head. It seemed to be covered in greyish-brown from head to toe. No visible gear, Which struck me as odd, So I continued to try and figure out what this was. I stared at it, And it at me, When I felt the need to LEAVE. I did not feel threatened, Just that I had to go. As I began to leave and head back toward the levee, I kept thinking about turning back because I could not believe what had happened, But something made me go out of the woods. I have grown up in woods all my life, Have hunted in south-central and eastern  Missouri, And grew up only a few miles from here, But never before have I seen Something I could not explain. If this thing had stood up, It would easy have been a foot or more taller than Me.","classification":"Class A","county":"St. Louis","state":"Missouri","latitude":38.69428,"longitude":-90.52987,"latlng":"-90.52987,38.69428","locationDetails":"This area was behind Chesterfield Golf  Club, and bordered up river by St. Louis County Water Works. This area is now fenced off and posted by Missouri Department of Conservation.","dewPoint":43.78,"humidity":0.6,"cloudCover":0.01,"moonPhase":0.44,"pressure":1019.27,"weatherSummary":"Clear throughout the day.","uvIndex":4,"visibility":9.65,"highTemp":73.03,"midTemp":56.825,"lowTemp":40.62,"precipitationIntensity":0.0002,"precipitationProbability":0.53,"precipitationType":"rain","windBearing":319,"windSpeed":4.11}
{"id":"717","timestamp":365472000,"title":"Unusual shadow seen through window near Branson. Large footprints found the next morning","observed":"When I was 11 it happened on a Saturday night. The moon was full. I had my curtains closed. This creature walked up to my window. It was very tall and was covered with hair. It breathed heavily and it's head was kind of pointed on top. I also noticed that it almost seemed like it had no neck. It stood in front of my window for 2 or 3 minutes like it was listening and trying to look in. I knew it was no joke because we had no neighbors at the time. I was very scared of it. Eventually it left the window and walked around the side of the house. The next day I told my sister what I had seen that night and we discovered footprints around the house. they measured about 20 inches. I never told my parents because I didn't think they would belive me. We also measured the window and discovered that the creature had to be at least 8.5 feet tall. I know that whatever I saw scared me so badly that I wouldn't go outside at night untill I was 15. It also rained on that Sunday and washed away the footprints.We followed them into the woods.","classification":"Class B","county":"Stone","state":"Missouri","latitude":36.63621,"longitude":-93.31413,"latlng":"-93.31413,36.63621","dewPoint":69.64,"humidity":0.8,"cloudCover":0.46,"moonPhase":0.06,"pressure":1019.96,"weatherSummary":"Humid and partly cloudy throughout the day.","uvIndex":9,"visibility":6.25,"highTemp":86.68,"midTemp":78.3,"lowTemp":69.92,"windBearing":143,"windSpeed":6.33}
{"id":"23581","observed":"At the time of this report, I lived in a home located a couple hundred yards from the shores of Tablerock Lake in Stone County, Missouri. Our house was situated at the back of a long cove and uphill from the lake. The Army Corps of Engineers maintains a zone around the Lake in which no development or clearing of land may be done without a permit so as to maintain a natural forested shoreline. The topography of the area is very rugged Ozark mountains and steep terrain. Large tracts of Mark Twain National Forrest make up the area and most land, even private, is still covered by forest. There was much development of homes and home sites taking place in my area at the time. Around the Fall or Winter of 2002 or 2003, myself and my family members began to hear whooping type animal vocalizations originating from a large tract of woods behind our home. The whoops sounded more mammalian then that of a bird and louder than that which would likely be produced by any readily identifiable forest animal. The calls varied, but often were produced as whoo whoo whoooooop, with a rise in the pitch on the last whoop. Around the same time, evidence of a mountain lion or cougars presence was found. A couple of neighbors, and a family member, had visual sightings of the large cat. I was screamed at once while in the woods and I had found numerous large cat tracts and claw sharpening evidence. Sometimes the cougar would scream in the evening. A few times the cougars scream was answered by the whoops or vice versa. On one occasion I was woken up in the middle of the night by the strangest and creepiest howls. They were very loud and the maker of them was moving very rapidly, up an extremely steep mountainside from the lake cove behind my house and was soon beside and then past my house, still moving up the hill and howling/screaming the whole while. I remember laying in bed thinking what in the world is making that howl!? I was honestly too frightened to look out my window into the woods to try to catch a glimpse of the maker. It sounded almost evil or malicious if that quality is appropriate to ascribe to a animals call. In the spring of 2003 or 2004, while scouting the back of the lake cove for animal evidence, I spotted a large hominid track. I frequently hiked to this area due to the abundance of deer, raccoon and sometimes cougar tracks that were easily identified in the mud. The footprint resembled that of a barefoot human but was approximately 12 or 13 inches in length and maybe 4 inches in width. Very flat footed if I remember correctly. It is possible that it was made by a very large human, but the conditions in which it was discovered caused me to doubt that possibility. It was a single print, but very clear and distinct. I could easy follow the outline of the toes and boundaries of the foot. It must have been made within days of my discovery of it. It was in the muddy washout at the back of the lake cove, where a small stream meets the cove and releases its silt and debris. The distance between the print and either edge of the washout was about 10 feet, yet there was no other prints in the mud of the washout. My own tracks were discernable in the mud of the washout as I walked about but, my own tracks were not near as deep as the print I mentioned. I weighed about 220 lbs at the time. On either side of the washout is a bare rocky shoreline of the lake. It is very difficult and extremely uncomfortable to walk on the sharp and varied sized rocks of that shoreline barefoot. Whatever left the print must have jumped from one shoreline to the middle of the washout, landing on one foot, only leaving the one print, and then bounding off the one foot  in a continuous motion to the other shoreline, landing on the sharp rocks. The distance traversed by the required leap is a distance nearly impossible for any human to accomplish. I also thought it was unlikely, though not impossible, that any human would even be walking barefoot in that area. It was remote. The only time humans venture into that area is during hunting season or to exit a boat to retrieve or relieve something. Because of the stumps, rocks and other obstacles in the cove, it wasnt likely that any fisherman or boater was that far back in the cove or that they would venture onto the rocky shore or woods barefoot. I later convinced my brother to come look at the print, which he did. We were both simply puzzled by it at the time. I submit this observation for what its worth, to the larger collection of possible evidence. The vocalizations and the footprint may have mundane origins. It is possible that all of this was produced by known animals and/or a very large barefoot human, but I dont want to rule out any options.","classification":"Class B","county":"Stone","state":"Missouri","locationDetails":"."}
{"id":"6656","timestamp":1100995200,"title":"Teenagers observe animal hiding behind trees in yard near Cape Fair.","observed":"It was July, 1978.  My family had just moved from Illinois to Cape Fair, Missouri a few weeks before. Our parents went back to Illinois for a funeral and my sisters (ages 16 & 14) and I (12 years old at the time) were there alone.  It was late at night around 11 or midnight when we all were startled by our dogs barking and growling on the porch.  Normally the dogs would go down to the driveway if they heard something.  This time they stayed on the porch looking towards the front yard barking and growling like I have never heard them do before.  What scared us was that the dogs were scared to go down off the porch. We turned all the lights off in the house and looked out the front windows and door to see if we could see headlights or something outside.  There was a flood light at the corner of the driveway that cast a light on the front yard.  The front yard was all uphill with a 5 ft barbed wire fence separating our yard from the pasture.  The front yard had huge black walnut trees spaced about 30-50 feet apart scattered around.  I was looking out the front window and saw a large figure standing partially behind a walnut tree.  I stared at it a few moments to focus in the dim light to see what it was.  I thought it was maybe a drunk camper who was lost.  You could walk down our back yard to the lake, so I thought maybe someone was looking for a way to the lake through our yard.  People would camp and fish very close by, so we thought somebody was lost.  All around our house it was dense forest and there was only one other house on our 1/2 mile road, so we were very isolated. My 16 yers old sister went to calm the dogs down.  The 14 year old and I were stioll looking out front.  Then after a few moments the figure dashed to the next tree about 50 feet away in about 3 or 4 strides.  I kept looking and before I could ask my 14 yr old sister if she saw that- she ran to the back porch to help my 16 yr old sister with the dogs.  By this time the dogs were freaking out.  Then I looked back to the front yard where I saw it go to another tree, then another tree-zigzagging its way up the hill towards the pasture.  Then to my amazement it cleared the barbed wire fence in one stride and was gone into the night.  My sisters were tending to the dogs so they didn't see all of what I saw.  My 14 year old sister said she saw something by the tree-but she never said anything more than that.  I don't know if they were trying to keep me from getting scared, but I think she saw it too.  I told my parents about it when they got home.  They just blew it off to a city kid seeing \"something\" in the country night.  While I lived there until 1984, I had heard stories of the \"Ozark Mountain Monster\" but thought it was just folklore. I did have several conversations with oldtimers from the area and heard stories of bigfoot sightings over the years, but never had the courage to \"go public\".  I am 37 now and do still believe to this day I saw a bigfoot.  I still get chills when I think about it and am having chills while I am typing this right now.  Too spooky!","classification":"Class B","county":"Stone","state":"Missouri","latitude":36.73,"longitude":-93.51,"latlng":"-93.51,36.73","dewPoint":47.1,"humidity":0.89,"cloudCover":0.99,"moonPhase":0.34,"pressure":1023.24,"weatherSummary":"Overcast throughout the day.","uvIndex":1,"visibility":7.33,"highTemp":54.24,"midTemp":52.08,"lowTemp":49.92,"precipitationIntensity":0.0071,"precipitationProbability":0.74,"precipitationType":"rain","windBearing":70,"windSpeed":5.73}
{"id":"22600","observed":"Location: Taney County  3 miles north of Forsyth  under-developed area comprising multiple 10-acre lots, heavily forested, served by a dirt/gravel road. Date: Late summer (July/August) 1998 Time: 8:30-ish pm My wife and I were living in a small \"park\" trailer (8x30) on our 10-acre lot just north of Forsyth, Missouri. The area is isolated, almost entirely undeveloped, and composed of heavily forested 10-acre lots. Access to the area was at that time a rather narrow dirt/gravel road which was barely able to handle two-way traffic. The area supports a variety of wildlife including possum, raccoons, bobcats, foxes, coyotes, and a large deer population. Black bears, small and scraggly, are relatively rare, but are reportedly making a comeback in the area and appear to be moving from Arkansas to the south. Both my wife and I had been to work very early in the day, and were quite tired. We were lying in our bedroom at the western end of the trailer with the windows open, reading before turning in for the night. We had small reading lamps turned on; there was still some light outside, but the sun had just dropped below the horizon/trees. We suddenly heard a long, drawn-out scream that was very reminiscent of a woman in fear or pain. Our two dogs began barking fiercely and jumping against their compound fence behind our trailer. The long cry was repeated, this time with an upward shift in tone toward the end, and I was reminded of the call of a peacock. I asked my wife what she thought it was, and did it sound like a peacock. She used to work at an amusement park where peacocks roamed freely, and she said that it was most definitely not a peacock call. When the scream sounded a third time both of us immediately came to the conclusion that someone was in trouble, and we headed for the door. I carried a big, multi-cell flashlight and went out the front door (facing south), while my wife stayed by the door, telephone in hand, prepared to dial 9-1-1 should the need arise. The only clearing that we had done on the entire property was the long driveway back to our trailer site, the actual clearing needed for the trailer itself, and the small amount of additional land clearing that was required for a well house (and access by the well-drillers for their large trucks). I moved westward, perhaps 100 feet, to the far side of the driveway clearing. There are no street lights in the area and with the sun already below the horizon darkness was falling rapidly. I shone the beam of the flashlight across the forested area from which the scream had come, sweeping it slowly left and right. There was a shuffling noise about 50 feet further west amidst a stand of several large cedars and oak trees. I swung the light to the spot where the sound seemed to originate and a dark shape moved behind the biggest of the trees. At the extreme range of the light beam I was alarmed to see two red/orange reflected eyes looking directly at me. No other details were apparent except for generic dark shadow. The two eyes were at a point well above the expected face height for a normal adult human. They blinked once or twice, then vanished as if the owner either closed them fully or turned away. It was growing darker by the second and the only clearly visible area was the cleared driveway and the partially cleared walk to the trailer. All else was in deep shadow. The shuffling noise came again, and a vague shadow moved quickly toward the southwest from behind the trees where I had seen the eyes. I attempted to use the flashlight to see the owner of the eyes, but could only see a tall shadow. It moved at a run, upright, and I initially thought it must be a tall, heavy-set man. I was still thinking that the screams had come from a female and that this must be her attacker. However, there was no one else in the area at the time. The 10-acre lots to the east and west of ours were unoccupied and completely undeveloped. While there is one house to the south, across the access road, it is set back from the road and was dark; the occupants were not home at the time. There were no further calls, screams, or noises in the forest, and our dogs ceased jumping against the fence, but continued to bark and wine in an agitated manner for another 10-15 minutes. I returned to the house and reported what Id seen to my wife. Without additional information we decided that a call to 9-1-1 was not advisable. Within a week we were attending a gathering of the Ozark Mountain Indian Heritage Association (OMIHA) and recounted the incident to several of the men in the group. More than one described having experienced similar encounters with such an \"animal,\" and one man in particular mentioned that he had actually attempted to give chase with his hunting dogs. The dogs got fairly close to where he suspected the \"animal\" was hiding but then returned to him, tails tucked and whining, refusing to pursue it further. He, too, noted that the eyes reflected red/orange in a flashlight. After that I made it a habit to have a fully loaded Marlin 30-30 by the bedside, but the incident was never repeated; we have not seen or heard anything similar since the original incident. The area is now more populated, all the lots having been sold/occupied, and several of the neighbors have free-roaming dogs. The deer and coyote population is either greatly reduced or they have gone elsewhere to avoid the neighbors dogs. We still have possum and raccoons, but they, too, are far less frequent to the area. Note: The air was still; no wind. I did not detect any unusual scents, although there was obviously enough for our two dogs to detect as they were highly agitated.","classification":"Class B","county":"Taney","state":"Missouri"}
{"id":"14150","timestamp":1142553600,"title":"Possible mid-day sighting by motorist on Hwy 465 outside Branson","observed":"This sighting happend Friday march 17 2006 . I was driving down hwy 465(Ozark Mountain High Road) going west bound about 1.5 miles from hwy 65 in taney county missouri  at approxiamtely 1:30 pm When I noticed off the side of the road a large cold black creature standing beside a large tree . It was standing on two legs and was the shape of a extremely large man.I know for sure there was know way this was a bear . What I saw was at least 9 feet tall and looked as if it was 3 foot wide . It was approximately 50 yrds. from the hwyThe following day I drove back buy where I saw the creature and it was not there . That told me for fact that what I saw  had to be real.","classification":"Class B","county":"Taney","state":"Missouri","latitude":36.71418,"longitude":-93.25712,"latlng":"-93.25712,36.71418","locationDetails":"take hwy 65 from branson missouri to hwy 465 go west about 1.5 miles to the north side of the hwy is where it was seen","dewPoint":31.37,"humidity":0.65,"cloudCover":0.46,"moonPhase":0.58,"pressure":1026.16,"weatherSummary":"Mostly cloudy until afternoon.","uvIndex":5,"visibility":8.41,"highTemp":50.76,"midTemp":45.58,"lowTemp":40.4,"precipitationIntensity":0.0001,"precipitationProbability":0.1,"precipitationType":"rain","windBearing":28,"windSpeed":6.1}
{"id":"25026","timestamp":1236556800,"title":"Possible late night sighting across the road from a house near Kirbyville","observed":"I let my dog out about 11 pm oct 3rd or 4th. It was pretty cool that night so he didnt go too far.across from my home in rural taney county there is thousands of acres bordering taneycomo and bull shoals lake. It was from there I heard stomping and my dog got scared. There is a street sign and a telephone pole across the road that when this thing passed showed to be about 8 ft tall in only a few seconds it was gone. my brother seen the same thing 2 days before.","classification":"Class B","county":"Taney","state":"Missouri","latitude":36.3881,"longitude":-93.1073,"latlng":"-93.1073,36.3881","dewPoint":41.08,"humidity":0.54,"cloudCover":0.24,"moonPhase":0.45,"pressure":1015.75,"weatherSummary":"Mostly cloudy starting in the evening.","uvIndex":5,"visibility":9.85,"highTemp":73.99,"midTemp":63.555,"lowTemp":53.12,"precipitationIntensity":0.0043,"precipitationProbability":0.69,"precipitationType":"rain","windBearing":149,"windSpeed":7.74}
{"id":"30442","observed":"My husband and I were woke around 12:30 am with some strange sounds coning through the baby moniter. The bed room the kids are in is right next to ours but we didnt hear anything from our room, it was only through the moniter that the sounds could be heard, at first. There was a squeaking that sounded like someone was messing with the window in the kids room. My husband went to the other room to turn the outside lights on, we have lights on every side of the house(installed after an attempted brake in) while I stayed in the kids room to see if I could see what was making the noise. I was standing beside the window peaking through the edge of the blinds when the lights came on. There was another noise, something hitting/ bumping the side of the house, the same side of the window I was standing on. Then there was a big shadow moving away from the house twoard the woods. The woods are only about 10 feet from that side of the house and this shadow moved very fast. My husband returned and he looked out the window, saw nothing. We waited looking out the window for several minuets but were able to see nothing. My husband left to turn the lights out, when he returned we stayed in the kids room for a few more minuets then as we were getting ready to go back to bed we heard a very loud \"whoop whoop\" then again \"whoop whoop\" I said its an owl, even thouth I'd never heard an owl sound like that before my husband, who is former militatry and has been in combat, said if it was an owl then it had to be at least 8ft tall, then he told me he didn't know what it was but it there was no way it was an owl.","classification":"Class B","county":"Taney","state":"Missouri"}
{"id":"40177","timestamp":1381795200,"title":"Early morning road crossing north of Branson","observed":"I was driving to work on Hwy 248 north of Branson MO traveling south on the road.  I came around a corner and was a good distance from the vehicle in front of me, approx 200 yards or so. And a Bigfoot crossed the road between us.  It was early morning so it was still dark and I saw it in the headlights of my jeep.  It crossed the road from left to right in front of me in maybe three or four steps.  It was taller than the truck that was in front of me, later as I caught up to the truck I found out t was a full size Chevy 1500.  The Bigfoot was upright on two legs and was brownish, grayish in color.  It disappeared off the right side of the road up a hill into the brush.","classification":"Class A","county":"Taney","state":"Missouri","latitude":36.39835,"longitude":-93.14626,"latlng":"-93.14626,36.39835","locationDetails":"Take hwy 248 north out of Branson approx 3-4 miles","dewPoint":57.64,"humidity":0.89,"cloudCover":0.11,"moonPhase":0.39,"pressure":1014.64,"weatherSummary":"Light rain in the morning.","uvIndex":4,"visibility":8.05,"highTemp":63.79,"midTemp":54.425,"lowTemp":45.06,"precipitationIntensity":0.0058,"precipitationProbability":0.52,"precipitationType":"rain","windBearing":274,"windSpeed":1.45}
{"id":"5064","timestamp":656294400,"title":"Driver has early morning sighting near bridge over Hog Creek.","observed":"I was driving to work one morning between Houston and Willow Springs, Missouri.  I was southbound on US 63, approximately 4 miles south of Houston.  As you approached the bridge over Hog Creek, the road descends a hill and curves to the left.  On the right side of the road there are some farm buildings, with a row of cedar trees planted right along the right-of-way. As I descended the hill, I saw a large, dark creature above the roadside.  It was upright and appeared to be covered in hair.  It was walking towards the cedar trees, and dodged into them as I approached.  My impression was it was over 6' in height, and rather broad through the chest. This would have been sometime around 6:30 in the morning, and there was only early sun.  Shadows were present as well, but I know I saw something.  It moved! When I got to work I mentioned my experience to a couple co-workers, and got a long razzing about it.  I pretty much shut up about it after that. On the way home that evening, I stopped of at the place where I saw \"it\".  There was no evidence of footprints, but some of the leaves and grass were stirred up as if something had come through there.  In comparing my height to the adjacent cedar trees, I also reaffirmed my belief in \"it's\" height.  It had to have been over 6' tall. There are/were bears in southern Missouri, but not as large as what I saw.  Also I don't think a bear can walk upright and take large strides.  I know I saw something there.","classification":"Class B","county":"Texas","state":"Missouri","latitude":37.27,"longitude":-91.985,"latlng":"-91.985,37.27","locationDetails":"There was a red pole-barn or out-building behind the row of cedars, set back maybe 50-60 feet.  The cedars looked as if they were planted as a sight-screen.  The site was maybe 1000-1500' north of the bridge over Hog Creek.","dewPoint":31.99,"humidity":0.56,"cloudCover":0.14,"moonPhase":0.04,"pressure":1019.66,"weatherSummary":"Partly cloudy until afternoon.","uvIndex":4,"visibility":9.27,"highTemp":63.9,"midTemp":54.455,"lowTemp":45.01,"windBearing":153,"windSpeed":7.93}
{"id":"33872","timestamp":1329868800,"title":"Grandmother has a possible night time sighting from her home in the city of Nevada","observed":"I literally live 200 yards from the Hwy 71/Camp Clark exit in Nevada, MO., its the very edge of town. My daughter and her children were gone that night and I was watching out the front door for the Church van to bring the kids home. There are only two street lights on this road and is mainly open fields around the 9 homes on in. There is a Wal-mart Super Center two blocks away and a new Pilot truck stop about three. The one big field across from the Pilot is where I saw this thing! It looked like it was cutting across the empty field and headed southward out of town. It was at least 8-9 foot tall (by measure of the trees in the field and quite large. The creature roared just like a cross between a lion and a wolf-both of which I have heard. It crossed behind the house across the street and started banging trash bins and continued on into the countryside.","classification":"Class B","county":"Vernon","state":"Missouri","latitude":37.8322,"longitude":-95.32129,"latlng":"-95.32129,37.8322","locationDetails":"Just off the Hwy71 Camp Clark exit","dewPoint":32.06,"humidity":0.54,"cloudCover":0.07,"moonPhase":0.03,"pressure":1002.26,"weatherSummary":"Partly cloudy overnight.","uvIndex":4,"visibility":10,"highTemp":66.76,"midTemp":55.48,"lowTemp":44.2,"windBearing":235,"windSpeed":6.61}
{"id":"36572","timestamp":1347926400,"title":"Trucker has nighttime sighting outside the city of Nevada","observed":"Recently at about 4am I was traveling east out of Fort Scott, Kansas. Just over the Missouri border the road gets narrow with heavy forest almost coming up to the edge of it. Ahead of me at the end of my headlights I saw something run across the road on 2 legs. It was covered with thick brown hair and it had to be big because in just 2 or 3 steps it was across the road and gone into the forest on the other side. It wasn't a bear or a farm animal because they run on 4 legs. And it wasn't a man either unless he had never had a shave or a haircut in his life. A man might be able to run fast, but he couldn't possibly have a stride long enough to come out of a forest, cross a road, and disappear again into the forest on the other side in just a couple of seconds. I only got a glimpse of it for just 2 or 3 seconds but I know what I saw and it wasn't like anything I'd ever seen or heard of outside of things associated with Bigfoot.","classification":"Class A","county":"Vernon","state":"Missouri","latitude":37.84203,"longitude":-94.6028,"latlng":"-94.6028,37.84203","locationDetails":"It was on the main highway east of Fort Scott, Kansas heading into Missouri. It is south of Kansas City near the Arkansas border.(Sighting happened on Missouri side of border.)","dewPoint":45.98,"humidity":0.65,"cloudCover":0.07,"moonPhase":0.09,"pressure":1017.79,"weatherSummary":"Clear throughout the day.","uvIndex":7,"visibility":9.95,"highTemp":69.6,"midTemp":60.92,"lowTemp":52.24,"precipitationIntensity":0.0003,"precipitationProbability":0.06,"precipitationType":"rain","windBearing":346,"windSpeed":4.51}
{"id":"40548","timestamp":1348185600,"title":"Motorist has a possible sighting on a rainy night near Schell City","observed":"It was raining and I thought I was coming up on someone walking in the ditch wearing a hooded rain slicker. As I got closer I thought what an idiot, they are wearing a fur coat. I thought I was looking at the back of someone but when I got even with them I noticed that it was not the back of someone standing but the side of something bending down. Just as I got even with it, it stood up and lifted its arms up as if making a tee like a cheerleader would. That's when I noticed what I believe was a deer between its legs. It all happened very fast as I was going about 55mph and only slowed down briefly. I took my foot off the brake and continued home. My own wife laughed at me about it but I know what I saw can not be explained.","classification":"Class B","county":"Vernon","state":"Missouri","latitude":37.91544,"longitude":-94.32079,"latlng":"-94.32079,37.91544","locationDetails":"About ten miles North east of Nevada, Missouri.","dewPoint":48.18,"humidity":0.52,"cloudCover":0.08,"moonPhase":0.21,"pressure":1011.96,"weatherSummary":"Clear throughout the day.","uvIndex":6,"visibility":9.82,"highTemp":81.75,"midTemp":66.51,"lowTemp":51.27,"precipitationIntensity":0.0057,"precipitationProbability":0.41,"precipitationType":"rain","windBearing":277,"windSpeed":3.51}
{"id":"40015","timestamp":1351036800,"title":"Driver has possible early morning sighting near Fort Scott","observed":"About the middle of Oct 2012 on my way to work I was heading west on 54 Highway from Nevada MO to Fort Scott KS to travel north on 69 North to the La Cygne power plant. At a point on 54 between the railroad tracks that has an overpass and going west to the top of the hill at the state line my head lights caught something upright on two legs very big, very dark, step off the road to the south side, I only got a look for second but it sent chills up my back. I told my wife about it, she thought I was nuts for watching Finding Bigfoot too much tonight, then I read your website about a trucker in the same area seeing something on 54.","classification":"Class B","county":"Vernon","state":"Missouri","latitude":37.84239,"longitude":-94.60359,"latlng":"-94.60359,37.84239","locationDetails":"There are some small oil rigs on the south side of the road. I would talk to someone about this but would not want it posted since I saw so little and have no proof.","dewPoint":63.06,"humidity":0.72,"cloudCover":0.14,"moonPhase":0.34,"pressure":1009.2,"weatherSummary":"Clear throughout the day.","uvIndex":3,"visibility":9.93,"highTemp":81.03,"midTemp":73.22,"lowTemp":65.41,"windBearing":184,"windSpeed":14.48}
{"id":"14237","observed":"I think it may have been about 1966. I was stationed at Leavenworth Kansas as a guard superviser. It was during the Missouri deer hunting season. I had a Missouri Licence for deer and got up long before dawn to go deer hunting. I went across the river into Missouri long before daylight at Leavenworth. It had snowed about a inch or two between 3 and five in the morning. I went north on a gravel road on the Missouri side of the river. It was fresh snow and no tracks but mine, evan on the gravel road. There was a field a few miles north about 1/2 mile across or so that led to the woods along the river. I got there before daylight. There were no tracks from anyone or anything. It was a fresh snow, not over a couple hours old. I walked to the edge of the woods along the river and found footprints that made me look like a little kid when I put my boot in them. It was like a barefoot person with really big feet. I tracked him for a little ways. He had come out of the wood to the edge of a river bottom field and walked along the egde of the woods, then backtracked himself in the edge of the woods to where if anything were following him they would go right by him. He then bent over some smaller willows and ate the bark off off them. From there he went back into the really thick stuff along the river. I did not attempt to follow. There is no doubt in my mind that it was a bigfoot. To question what I saw would be a insult to my itelligence.","classification":"Class B","county":"Platte","state":"Missouri"}
{"id":"21660","timestamp":1168300800,"title":"Woman describes childhood incidents -- possible tracks and vocalization near outside rural home near St.James/Rolla","observed":"My parents had just settled on a new house for our family the day before Christmas.  We were so excited that we couldn't wait, so we moved in on Christmas Day.  There were only two bedrooms in the back of the house, which were claimed by my parents and younger brother.  I was happy enough with a \"study\" in the front of the house, which had very large windows on two sides, practically covering the entire wall area.  Because of the unusual size and shape of the windows, we didn't have anything immediately to cover them, but we weren't concerned because we were in a secluded area off the road and woods all around.  Also, the front side of the house where my room was located, was on a slope, so no one could walk right up and actually see into my room without a ladder.  When I woke up that first morning in my new room, I was excited to see the beautiful layer of snow all around the wooded yard.  I was startled, though, to see a set of footprints coming from the back of the house, from the woods.  The footprints came up along the side of the house and then circled around to my front window.  I told my parents immediately, and my dad went out to investigate.  The footprints were huge, like twice the size of my dad's foot in width and almost twice as big in length.  My dad dismissed it as someone walking through the woods with boots on and not worried because the windows were too high for someone to see into.  The shape was not right for a boot, though. I would have dismissed that completey except that the early summer of 1981 , another incident occurred which my mom, brother and I have never been able to forget or quite reconcile.  We were standing outside at dusk.  My uncle had just dropped by to check on us because my dad had been away on a trip.  He had just driven out of our driveway and we turned to walk back inside.  There was an eery feeling and we all noticed how there was silence.  No crickets chirping or frogs croaking, or other usual evening animal sounds.  Then a monstrous roar came from the darkness of the woods behind us.  No one said a word, we just all three took off running for the front door.  I still get goosebumps when I think about that sound.  I've never heard anything like it in real life ever before or since.  It sent a chill of fear right to my core.  It was deep, and long and powerful.  My uncle did return an hour later and looked around the house with a flashlight.  He didn't see or hear anything.  We dismissed it as a panther scream but never really were convinced that it was that.","classification":"Class B","county":"Phelps","state":"Missouri","latitude":38.01223,"longitude":-91.64719,"latlng":"-91.64719,38.01223","locationDetails":"V Hwy. exit off Interstate I-44, about a mile or mile and a half west.  There is a housing development on the right and our house was maybe a quarter of a mile past that on the left, sitting back in the woods, near a secluded quary which was filled with water.  There was a pond just to the side of the house.  The house sits back from the road with many trees in front of it, hard to see from the road.  There are a few scattered houses right along that area.  My parents no longer live in that house, but are nearby in St. James.","dewPoint":22.72,"humidity":0.55,"cloudCover":0.43,"moonPhase":0.7,"pressure":1025.79,"weatherSummary":"Breezy in the morning and mostly cloudy until afternoon.","uvIndex":1,"visibility":9.68,"highTemp":42.63,"midTemp":32.815,"lowTemp":23,"precipitationIntensity":0.0001,"precipitationProbability":0.13,"precipitationType":"rain","windBearing":297,"windSpeed":12.4}
{"id":"15610","timestamp":-296006400,"title":"Children see creature emerging from abandoned barn near Caruthersville.","observed":"I was sitting on the front porch of the house into which my family had just moved.  The porch faced the state highway which was about 100 metes to the east.  The dirt road from the highway to the house was lined to the south with trees.  The house into which we had just moved seemed quite old.  However, between our house and the highway there was a ranch style brick house toward the north of the dirt road.  50 meters to the south of our house stood a barn with a hog pen in front.  The house had a full, flat porch facing the east with four pillars, three steps to the ground and no rail.  My 6 year old sister was closest to the barn.  My 4 year old brother was sitting on the steps.  I was standing next to the steps toward the north.  I heard my sister scream and start crying.  I looked to the barn as a large creature stood there.  It stood a foot taller than the opening of the barn door.  It turned toward the east, its' right, and taking long strides steped easily over the hog pen fence.  When it got to the corner of the barn it looked south then turned to walk west.  Mom came out of the house and told us to stay out of the barn.  Later that day I was over by the barn and saw the large foot prints repleat with toe marks.  Over the remaining time we lived in that house, through the next spring, we heard loud noises at times coming from the metal grain silos to the west of the barn.  Though, we never saw the creature again.","classification":"Class A","county":"Pemiscot","state":"Missouri","latitude":36.00565,"longitude":-89.67815,"latlng":"-89.67815,36.00565","locationDetails":"The house into which we had just moved was about 3-4 miles couth of Currotherville.","dewPoint":69.26,"humidity":0.71,"cloudCover":0.22,"moonPhase":0.79,"pressure":1019.19,"weatherSummary":"Partly cloudy until evening.","uvIndex":8,"visibility":9.37,"highTemp":91.13,"midTemp":81.57,"lowTemp":72.01,"windBearing":173,"windSpeed":1.59}
{"id":"5085","timestamp":1102204800,"title":"Family has nighttime sighting near Gainesville.","observed":"I was just a kid when I saw it.  I was sitting in the back of an old Chevy Citation at the time it was pretty new, my uncle was driving and my aunt was in the passenger seat and my little cousin who was around 4 or 5 at the time was sitting in the back with me, were coming home and I believe from visiting family or something.  My aunt & uncle lived down this old dirt road around 2 miles and right before their driveway which was on the left was and old dry branch or creek that ran across the road and it did not have a concrete slab to cross over it so you had to slow down a little to cross.  Directly to the right of the creek was an old driveway leading to an old abandoned house which no one had lived in for years.  It was dark so naturally we had the headlights on and as my uncle began slowing to pass over the rough gravel something in the corner of my right eye came into view.  My aunt kind of screamed but not loudly because we were amazed and terrified.  Something that looked to be around 8 foot tall, (I know as a 10-11 year old kid it was huge) came across the branch which led out of the old driveway and not running but walking briskly came directly in front the car.  We all just stared as it was some dream.  It was swinging it's arms a little and acted like we were not even there.  It walked across the creek and crossed the water gate which I don't remeber if it went under or over but what I do remeber is the branch had washed out the bank of my uncle's yard and his perimter fence was quite tall if you were staning in the branch and this bright red haired thing jumped over from the bed of the branch like nothing and into my uncles yard.  Mind you were still watching in the car.  We could see it walk up thru the yard and up the hill until we lost sight of it with the headlights.  My uncle turned into the drive and we had all locked the doors.  My aunt and uncle went thru the count of 3 thing and we open the doors and ran inside.  We got inside and my uncle got his hunting rifle out and went outside with his flood lite and looked for it and on his way back which he didn't walk far he tripped on the chord and it came unplugged then he yelled and got up and ran into the house and locked the door.  To this day if you ask him about what he saw he will say he saw something but he doesn't know what it was or that somebody was playing a joke on us.  My aunt will tell that she saw bigfoot and so will I.  My little cousin was to small to remeber much but I remeber and to this day I don't go out into the woods without a weapon.  To the best of my ability this is what it looked like.  It was around 7-8 foot tall, completly covered in red hair and 1 feature I remember is it looked like it's arms were almost as long as it's legs and that it was not afraid of us.  Also at that time there was a man I do not remember but lived in the area and was at the local store there in Souder, Mo. and was telling everyone he had seen bigfoot and no one believed him so none of us ever made much mention to it except to family or close friends.  But I believe. I know what I saw.","classification":"Class A","county":"Ozark","state":"Missouri","latitude":36.615,"longitude":-92.425,"latlng":"-92.425,36.615","locationDetails":"From 60 highway East from Springfield, Mo. take 5 Highway South to 95 Hwy. North and it is approx. 6 miles  then left county road.  Can't remember the # of the road.","dewPoint":39.71,"humidity":0.87,"cloudCover":0.6,"moonPhase":0.78,"pressure":1012.9,"weatherSummary":"Rain in the afternoon.","uvIndex":1,"visibility":6.36,"highTemp":59.27,"midTemp":53.76,"lowTemp":48.25,"precipitationIntensity":0.0134,"precipitationProbability":1,"precipitationType":"rain","windBearing":144,"windSpeed":5.37}
{"id":"27785","timestamp":1277164800,"title":"Nighttime roadside sighting by a motorist outside Joplin","observed":"It was a student at Missouri Southern State College at the time.  And a popular hangout was at Wildcat Park. One evening several students were out there and a friend of mine asked me to drive him out there.  Around midnite we were heading back to campus, I was taking a curve and as I got into the corner I saw a large ape-like, human-like creature standing just off the pavement. I would say it was 7.5'-8' tall and 350-400 pounds.  I'm not sure of the color since it was dark. I would say it was dark brown, but the moonlight and limited visibility gave it's coat a whiteish sheen. The vehicle I was driving was a 'lifted' pickup truck.  I was able to see eye-to-eye with it. The creature appeared to be much taller than the vehicle, but it was either squatting slightly or hunched down a bit. It had very broad shoulders, much larger than anything I had ever seen. They were close to 3' across. I looked right into it's face and it's eyes were a deep black. They could have been brown, and appeared darker due to the lack of light.","classification":"Class A","county":"Newton","state":"Missouri","latitude":37.03575,"longitude":-94.52888,"latlng":"-94.52888,37.03575","locationDetails":"This was out in an area close to Shoal Creek in Joplin, MO.","dewPoint":72.47,"humidity":0.67,"cloudCover":0.08,"moonPhase":0.38,"pressure":1015.31,"weatherSummary":"Humid throughout the day.","uvIndex":11,"visibility":9.69,"highTemp":94.01,"midTemp":84.29,"lowTemp":74.57,"windBearing":180,"windSpeed":8.62}
{"id":"5552","timestamp":1100908800,"title":"Youth bicyclist has daytime sighting near Gravois Mills.","observed":"I was living at in Missouri at the time, about a mile from where my sighting took place. I was on my way home from a friends house on my bike about to head up the hill. I heard something off in the woods to my left and looked to see what it was. I was very used to being in the woods, having grown up around them all my life. I expected to see a deer or some other type of wildlife that I was so familiar with. But, I turned and saw what I still believe was bigfoot. It was a little less than a hundred yards away, and walking perpendicular to me. The strides that it took were amazing, so fluid. There was no real bobbing of the head like I have heard of from other sightings, and the arms didn't swing out as much as others have reported, it was very human like. It's body was covered in a brown hair, not a very dark brown though. It was more the color sandstone, that's the best thing I can think of to compare the color. I watched it walk for about a minute, I was to scared to move at all, so I was just kind of frozen there watching it. Then it stopped right beside a large birch tree. I was afraid that it had seen me and didn't know what it would do, so I turned to look up the hill and contemplate running up the hill towards my house or to turn and run back to my friends house. I decided that I was going to leave my bike and run back to my friends since it wasn't up hill to his house. I turned to look back and see where the creature was at and couldn't see it anymore. I believe it hid behind the large birch that it stopped beside. That's when I ran, I was so scared I just ran to my friends house and didn't even knock, I just ran inside and told them what had happened. I made his dad drive me home, we picked up my bike on the way. I never went down that road again on my bike, I never had the nerve to.","classification":"Class A","county":"Morgan","state":"Missouri","latitude":38.3085,"longitude":-92.8254,"latlng":"-92.8254,38.3085","locationDetails":"I can't remember the exact road name that I spotted it from. But I do know that it was right next to \"The Captians Fancy\" a resort that my mother was the manager of at the time, that's where I lived at. It was about a mile away from there.","dewPoint":44.64,"humidity":0.86,"cloudCover":0.93,"moonPhase":0.3,"pressure":1020.28,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":1,"visibility":9.13,"highTemp":50.59,"midTemp":45.88,"lowTemp":41.17,"precipitationIntensity":0.0012,"precipitationProbability":0.62,"precipitationType":"rain","windBearing":335,"windSpeed":4.35}
{"id":"1132","timestamp":210384000,"title":"Witness noticed creature was human shaped.","observed":"The sighting was related to me by my father.(the witness) A large Bigfoot type creature was seen in field. My father was driving to work on a county road when he noticed a large dark shape in a hayfield/pasture. There was no livestock in the field at that time and thats what made him notice the dark figure. As he got closer he noticed it was human shaped, between 7 and 9 ft. tall and covered with black hair! The creature soon noticed the vehicle and made its way to the cover of a nearby creek.(Coon Creek) It moved quickly but didnt seem to be paniced. Both my father and I returned to the spot shortly after to look for clues but nothing was found. We told the property owner we wanted to get some sand from the creek. If he only knew! At his closest point he was maybe 100 yards from the creature.","classification":"Class B","county":"Montgomery","state":"Missouri","latitude":39.1405,"longitude":-91.419,"latlng":"-91.419,39.1405","locationDetails":"Near Middletown on a county road North of blacktop A.","dewPoint":56.32,"humidity":0.56,"cloudCover":0.84,"moonPhase":0.27,"pressure":1016.31,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":5,"visibility":8.93,"highTemp":83.22,"midTemp":71.75,"lowTemp":60.28,"windBearing":74,"windSpeed":3.17}
{"id":"8890","timestamp":1102204800,"title":"Truck driver has daylight sighting on country road near Marys Home.","observed":"Bigfoot standing in the middle of hwy 17. was 6 ft. tall or better very dark brown or black. It was looking down at the ground in a north west direction arms to it's side. It looked slim or gaunt. My brother was driving a feed truck back from Tuscumbia, Mo. going north on Hwy 17 about 2 miles from the Marys Home turn off. As he rounded a curve to the left was when he saw it in the road about 200 yds. ahead. He looked away for just a second and It was gone. When he got back to Jefferson City, Mo., in about 30 min, he called me and told me about it, and that he was taking another load down to meet him there. I did so. He showed the place and then he left to make his delivery. I walked up and down both sides of the road and found where somthing had walked up to the fence from the east. The grass was thick and mashed down but no imprints were left. I also noticed the cattal acting spooked. I am making this report for my brother, whom would not.","classification":"Class A","county":"Miller","state":"Missouri","latitude":38.305,"longitude":-92.411,"latlng":"-92.411,38.305","locationDetails":"About 200 to 400 yds.south of Buster Rd. on Hwy 17 in the middle of the highway.","dewPoint":37.42,"humidity":0.87,"cloudCover":0.54,"moonPhase":0.78,"pressure":1012.29,"weatherSummary":"Light rain starting in the afternoon, continuing until evening.","uvIndex":1,"visibility":7.34,"highTemp":52.55,"midTemp":49.59,"lowTemp":46.63,"precipitationIntensity":0.0102,"precipitationProbability":1,"precipitationType":"rain","windBearing":149,"windSpeed":6.6}
{"id":"48530","timestamp":1429833600,"title":"Brothers observe tall animal during early morning visit to hunting area near Lineville","observed":"My brother and I were looking at a piece of land to lease. We were sitting in a pickup truck when we noticed something large and black about 400 yards south of us in an open field, but close to the far timberline. It appeared to be kneeling or bending over. On seeing us it stood erect on two legs, turned, and walked into the timber disappearing from sight.","classification":"Class B","county":"Mercer","state":"Missouri","latitude":40.57773,"longitude":-93.64312,"latlng":"-93.64312,40.57773","locationDetails":"About 7 miles west of South Lineville Mo on south side of State Line Road, just barely in Mo","dewPoint":42.2,"humidity":0.64,"cloudCover":0.42,"moonPhase":0.21,"pressure":1009.33,"weatherSummary":"Partly cloudy in the morning.","uvIndex":6,"visibility":9.39,"highTemp":59.57,"midTemp":54.065,"lowTemp":48.56,"precipitationIntensity":0.0031,"precipitationProbability":0.35,"precipitationType":"rain","windBearing":140,"windSpeed":8.94}
{"id":"26306","timestamp":1253836800,"title":"Possible nighttime encounter at a rural home near the village of Jane","observed":"It was a dark night and I heard the dogs all barking from their cages, which was not that unusual as they would do this whenever a coyote would come close or a car would drive by. I grabbed my flashlight and turned on the back motion light and went outside with my .22 mag revolver thinking a coyote had stirred them. I hollered at the dogs to hush and they would not at first, but eventually did. It was at this time that I heard something walking in the woods behind the house that sounded as though it was on two legs. I then assumed that it had to be a person and called out asking if anyone was there. Immediately afterwards the walking stopped and I called out again as I began walking towards this little dirt road that separated our back yard from the woods. At this point it sounded as though the footsteps were coming towards me. Not wanting to shoot someone accidentally and still wanting to be safe I went back to the dog kennel and let out our red heeler who I add is usually fearless. I told her come \"come\" and began walking back towards the woods, the dog ran up to the treeline ears pointing up and alert and immediately ran back to her cage. I have never seen that dog back down from anything before or since so I yelled out one more time for whoever was out there that I was armed and to leave now. I heard the footsteps coming towards me again and the time in between audible steps indicated that whatever it was was very tall, at least seven or more feet. I then proceeded to fire two shots at the ground right in front of the woodline and whatever it was calmly began to walk away as though it was not afraid at all. I then put the dog up and went inside the house and have never had any further experiences.","classification":"Class B","county":"McDonald","state":"Missouri","latitude":36.50787,"longitude":-94.2319,"latlng":"-94.2319,36.50787","locationDetails":"A small group of houses surounded by Ozark hills and forrest, alot of woods where the incident ocurred have since been cleared. Take highway 71 to Bear Hollow and follow approx. 2 miles and turn on Tyson Rd. follow til turns to dirt and keep a goin until you see some houses right on the road.","dewPoint":52.98,"humidity":0.75,"cloudCover":0.1,"moonPhase":0.23,"pressure":1020.06,"weatherSummary":"Partly cloudy in the morning.","uvIndex":6,"visibility":8.45,"highTemp":75.22,"midTemp":65.57,"lowTemp":55.92,"precipitationIntensity":0.0009,"precipitationProbability":0.69,"precipitationType":"rain","windBearing":201,"windSpeed":1.96}
{"id":"1118","timestamp":866332800,"title":"Witness saw man-like creature in a corn field.","observed":"I was riding a four wheeler at my aunts out in the country. On an old gravel road I saw something that appeared to be a dog two-hundered yards ahead of me in a corn feild on my right side.  As I got closer I could tell it was not a dog but a man-like creature. It stood up from a kneel  and ran to the middle of the road it then turned to look at me and ran into the woods I gasped and set for a second. Then I turned arround and road off in fear it might come back.","classification":"Class A","county":"Marion","state":"Missouri","latitude":39.8397,"longitude":-91.6533,"latlng":"-91.6533,39.8397","locationDetails":"Between Palmyra and Philidelphia.","dewPoint":63.51,"humidity":0.71,"cloudCover":0.4,"moonPhase":0.33,"pressure":1009.93,"weatherSummary":"Partly cloudy throughout the day and breezy starting in the afternoon, continuing until evening.","uvIndex":9,"visibility":9.29,"highTemp":82.15,"midTemp":74.045,"lowTemp":65.94,"precipitationIntensity":0.001,"precipitationProbability":0.24,"precipitationType":"rain","windBearing":182,"windSpeed":10.07}
{"id":"2451","timestamp":517881600,"title":"Three-toed print found while cutting firewood","observed":"In May of 1986 my son-in-law and I found a freshly made footprint of something that still haunts me today.  We had been cutting firewood in a mostly remote area about 100 miles south of St Louis, MO.  It had rained hard all night prior to the morning of the sighting and the ground was well saturated.  The print looked almost like a human print except for the size and the number of toes.  The print was 14-1/2\" long, 4-3/4\" wide and was sunk in the ground almost 2\" deep it had to be something that had a lot of weight to it.  It also had three toes of which the inside toe was slightly larger than the other two.  Unfortunately we did not take a picture or  make a cast of it.  I wish I would have at least informed the conversation department about it.","classification":"Class B","county":"Madison","state":"Missouri","latitude":37.5562,"longitude":-90.2488,"latlng":"-90.2488,37.5562","locationDetails":"East of Fredericktown, MO.","dewPoint":66.6,"humidity":0.74,"cloudCover":0.42,"moonPhase":0.78,"pressure":1013.05,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":8,"visibility":6.96,"highTemp":85.12,"midTemp":76.76,"lowTemp":68.4,"precipitationIntensity":0.0022,"precipitationProbability":0.54,"precipitationType":"rain","windBearing":251,"windSpeed":3.04}
{"id":"2180","timestamp":241920000,"title":"Two sisters witness bipedal animal walk through yard","observed":"It was in 1977 and it was late summer or early fall.  I was about 6 or 7 years old and my younger sister and I were looking out our living room window and saw a big hairy ape-like creature walking upright. It walked across our yard and into the woods.  It looked like it came across the road from the angle it was walking but we didn't see it cross.  We didn't see until it was almost to the side of the house, it was only about 100 feet away from us and we got a good look at it.  I still live in the same house where this happened.  It was dusk but still bright enough outside to see well.  It looked right at us and of course it scared us at the time.  We told our mom but she didn't believe us, but to calm us she told us to hide in the bathroom. So we did.  It's hair was a dark redish brown but the red tint could of been from the sun going down. It was about 6'6\" or so, tall, stocky, broad shouldered, hairy, and naked.  It was not human, it had way too much hair for that. Most people in the area do not act too surprised when sasquatch are mentioned. I hope you can prove their existance for good but I hope that they don't get harmed in the prossess. They don't seem to harm anyone or anything and it would be a shame to harm them.  You never hear of anyone human or animal being attacked by them so why should we attack them?  I say take pics and film and sound but don't cage, cut, inject, tourcher, or harm them in any way. Leave them in peace and let them live like they are use to.","classification":"Class A","county":"Lawrence","state":"Missouri","latitude":37.11433,"longitude":-93.71506,"latlng":"-93.71506,37.11433","locationDetails":"The one I saw was right at Hwy. 174 and Hwy. N outside Mt. Vernon, MO.  Coming from I-44 you go towards Chesapeak and Republic on 174 about maybe a little less than 2 miles to N Hwy. and there is a convenient store on the corner that didn't use to be there.","dewPoint":69.21,"humidity":0.74,"cloudCover":0.61,"moonPhase":0.63,"pressure":1020.01,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":6,"visibility":9.25,"highTemp":88.62,"midTemp":78.965,"lowTemp":69.31,"windBearing":177,"windSpeed":4.64}
{"id":"36247","observed":"My husband and I were watching a movie in his brother's barn,  where we have set up a movie projector and screen.  It was during the last half of the second movie, when we started hearing loud splashing noises coming from the lake, not far from the opening of the barn door, where we were sitting.  My husband asked if I heard that, and I said \"yeah, it is probably fish jumping, or maybe a raccoon or something.\" We continued to watch the movie, still hearing loud splashing noises.  As the splashing continued,  it sounded too big and noisy to be fish jumping.  It sounded like something large walking along the shore.  When the movie was over, my husband went up into the loft of the barn to disconnect the projector and computer.  I stood at the barn entrance,  trying to see out towards the lake and see if I could see anything.  While trying to peer out into the dark,  I suddenly felt very uneasy,  like I was being watched.  The hairs at the back of my neck stood up, and I said to my husband \"I really want to you to come back down here!!\"  Now,  I keep horses at my brother-in-laws place, and I am out there all the time, all hours of the day and night.  I am very familiar with this property and the surrounding area, and have never felt uneasy like that before. When my husband came back down,  I handed him a small flashlight and asked him to shine the light down towards where the splashing noises were coming from.  He took the flashlight and walked down to the water's edge.  When he started walking towards the water, the noises stopped.  Then he shined the flashlight and there was nothing.  I was watching still from the barn.  After a second or two,  I heard the noises further down to my right.  When my husband would shine the light, the noises would stop,  then continue in a different area of the lakeshore.  He came back to the barn and said he wasn't sure what was going on, but that it \"definitely was not normal.\"  We both felt a little creeped out, and decided to go home. The next morning, I went to the barn to take care of my horses, and decided to look around the lake shore area and see if I could find any tracks or evidence of what was going on down there.  I came across a very large footprint!!  I stood there staring at it for a few minutes, trying to figure out if I was really looking at what I thought I was looking at.  It looks human in shape, but very large.  My husband wears a size 14 mens, and it was much bigger than his foot.  There were other prints that appeared to be partial, like a heel impression,  a half footprint, etc.  But this one was the only one that I could not reason off as anything else but perhaps a Bigfoot footprint! Especially when coupled with the events of the night before.","classification":"Class B","county":"Lafayette","state":"Missouri","locationDetails":"Please do not include exact directions in report online."}
{"id":"11823","timestamp":600739200,"title":"ATV'ers have daylight sighting near Hematite.","observed":"I can vividly remember the event. We lived on Stroup Road, which was about 10 miles west of Festus Mo.  It was in the winter and there was several inches of snow on the gound.  Me and my younger brother was riding our 4-wheerler on our property and was looking ahead up the trail and saw a large creature moving through some pine trees up at the end of the trail.  Even though I was about 13 at the time, I had a couple years of deer hunting and had seen a black bear before, the size of the animal or creature I had saw difenatly was not either of the two.  It was dark colored and and appeard to be at least 6 or 7 feet tall.  I couldn't make out any real features but it scared the heck out of me and my brother.  I turned around and hauled butt out of there.  I drove through a small creek and up a steep hill to get back to our house, was so scared that I left the 4-wheeler running. I was just happy that the 4-wheeler made it up the hill. Just talking about this brings goose bumps on my legs and arms.  I can remember this like it was yesterday.  People that I have told this to chuckle at the story, but they weren't there.","classification":"Class B","county":"Jefferson","state":"Missouri","latitude":38.21719,"longitude":-90.50072,"latlng":"-90.50072,38.21719","locationDetails":"The area is pretty rural.  I haven't been back in several years due to being in the military. I can give exact address if needed.","dewPoint":27.86,"humidity":0.84,"cloudCover":0.97,"moonPhase":0.25,"pressure":1020.73,"weatherSummary":"Snow (< 1 in.) in the morning.","uvIndex":1,"visibility":6.73,"highTemp":34.75,"midTemp":32.855,"lowTemp":30.96,"precipitationIntensity":0.0043,"precipitationProbability":0.6,"precipitationType":"snow","windBearing":201,"windSpeed":3.77}
{"id":"16294","timestamp":924134400,"title":"Mushroom hunter has early morning sighting near Festus.","observed":"I was driving east on hillsboro hematite rd. to go mushroom hunting. Coming into a curve to my left I noticed what I first thought was a person, as I got closer I saw that it was not a person but a large hump shoulderd black animal shuffleing across the road to north side.                                                       It was taller than first thought 6 foot est. and it started running into a cedar tree thicket. It swung arms back and forth as it walked like a ape, I stopped the car where it crossed and rolled down my window and turned off my engine and tryed to hear it going away but heard no sounds.                                                     Went to mushroom hunting spot and did not stop at site on the way home as I felt it would be taking a chance.","classification":"Class A","county":"Jefferson","state":"Missouri","latitude":38.22635,"longitude":-90.39488,"latlng":"-90.39488,38.22635","locationDetails":"West of Hematite approximately 2 miles.","dewPoint":45.18,"humidity":0.87,"cloudCover":0.97,"moonPhase":0.98,"pressure":999.48,"weatherSummary":"Rain in the morning and breezy starting in the afternoon.","uvIndex":5,"visibility":7.2,"highTemp":52.8,"midTemp":46.885,"lowTemp":40.97,"precipitationIntensity":0.0222,"precipitationProbability":1,"precipitationType":"rain","windBearing":285,"windSpeed":7.51}
{"id":"26919","timestamp":1259020800,"title":"Early A.M. sighting returning home from family event","observed":"I had just dropped my father off at his home at 1:50 AM in De Soto Missouri as I made my way down from Highway B onto NN heading north to my hometown Pacific MO. I was taking my time down NN traveling at around 30 mph to avoid any deer collisions due to the fact it is deer season.  I had seen frequent deer so I am very keen with knowing what animals in a field look like, especially through the peripheral vision of car headlights. I was about 5 miles from the Franklin County line when I saw a rabbit dart across the road and I slammed the brakes to avoid hitting it. I was at a 5 mph rolling stop when I looked where the rabbit had run from and I saw a 7 to 8 foot tall ape like animal running on it's hind legs at my vehicle as if it were aggressively charging at me. I did not get a look at it's face other than the clear outline of the creature. I was very frightened at the site, and the sense of knowing it was an animal not native to Missouri, and it had just made me start to reconsider what I had just seen. I have recently heard of the Missouri MOMO, and I have been very skeptical about it. I would like to know what animal in Missouri could run at that speed on it's hind legs, surely a Bear cannot. I also cannot understand why I would have angered a Bear in anyway from just stopping in the road. I debated on whether or not I should report this, because a lot of people treat you like an idiot when you tell them what you saw. I thank you for taking the time to read my report. ","classification":"Class B","county":"Jefferson","state":"Missouri","latitude":38.4063,"longitude":-90.7357,"latlng":"-90.7357,38.4063","locationDetails":"http://maps.google.com/maps?hl=en&q=cedar+hill+mo&ie=UTF8&hq=&hnear=Cedar+Hill,+Jefferson,+Missouri&gl=us&ei=YFQKS92QOIO6NY-v3LYK&ved=0CAgQ8gEwAA&ll=38.387688,-90.725956&spn=0.044335,0.076475&t=h&z=14","dewPoint":45.1,"humidity":0.82,"cloudCover":0.89,"moonPhase":0.25,"pressure":1013.06,"weatherSummary":"Rain until afternoon.","uvIndex":1,"visibility":8,"highTemp":53.75,"midTemp":49.03,"lowTemp":44.31,"precipitationIntensity":0.0096,"precipitationProbability":0.88,"precipitationType":"rain","windBearing":200,"windSpeed":7.41}
{"id":"46749","observed":"Where I work, they let us hunt and fish on the grounds. The last few years I have been hunting the west side of the property and every early Fall they or it is there. A few years ago, I had one violently shake a tree and run off just out of sight. Then, last year one let out not a scream and not a howl but a cross between the two so loud and close that I could feel it in my chest. I got to tell you it scared me half to death about a half hour before dark. I waited a little bit because I didn't know if it knew I was there or not and then I left. About a month ago I was doing a little scouting before deer season and heard some whoops and on Oct.9th I had, only what I can compare it to, is either 3 large rocks slammed on the ground or something stomped the ground hard enough to feel it in my feet three times and just far enough out of my view that I could not see it. I spoke out but got no reply. Nothing ran away or moved in the woods. I took it as a warning that I am here, go back, and that's what I did. I have hunted all my life and I know what a deer sounds like when it stomps its hoof, it was not that. I got to tell you, I have never been uncomfortable in the woods but this is getting kinda spooky.","classification":"Class B","county":"Jefferson","state":"Missouri","locationDetails":"Omitted, private property"}
{"id":"48339","timestamp":1423958400,"title":"Dark figure crosses the road at night in front of motorist near High Ridge","observed":"I was driving home on Carol Park Rd (south, off of Hwy 30) at approx 11:00 pm. I traveled about 200 feet south of Hwy 30 and was changing radio stations, when I looked up as I \"caught\" a glimpse of an \"upright type\" of animal, cross Carol Park Rd, from west to east. That area is heavily wooded on both sides. It is an area where the road runs thru the top part of a deep ravine, that leads down to a watershed (creek). I was pretty surprised, and told my wife when i got home. We both just shrugged it off. It wouldn't surprise either of us, at all, if it actually was a bigfoot. There is lots of wildlife in the area.","classification":"Class B","county":"Jefferson","state":"Missouri","latitude":38.45927,"longitude":-90.55145,"latlng":"-90.55145,38.45927","locationDetails":"Southwest of St Louis, MO (proper) Hwy 270, exit Gravois rd (Hwy 30) west, 11 miles to where Carol Park rd. exits to the left, as you go west on 30","dewPoint":-0.46,"humidity":0.51,"cloudCover":0.32,"moonPhase":0.88,"pressure":1032.37,"weatherSummary":"Snow (< 1 in.) overnight.","uvIndex":3,"visibility":9.1,"highTemp":18.79,"midTemp":17.475,"lowTemp":16.16,"precipitationIntensity":0.0007,"precipitationProbability":0.42,"precipitationType":"snow","windBearing":73,"windSpeed":8.27}
{"id":"41012","timestamp":1367020800,"title":"Two girls have a daytime close encounter on their family farm near Oak Grove","observed":"I was in the woods with my friend, it was 6:29pm, and the ground was wet. From 10 yards (or so) away between two trees a blackish figure (8 feet tall) moved and I saw it directly for only a split second. The cat we were with was on a tree stump near by and was looking right by where we saw it and her hair was all puffed up. Then we heard two splashes together (it crossed a puddle). Then the neighbor's dogs ran up to the fence (out of sight) and one barked, then the sound was repeated but in a more girthy tone, and then it was repeated over and over again on different sides of the lake. then everything got louder and very intense and we heard a cow moo from across the lake and they don't have any cows, then we went inside.","classification":"Class A","county":"Lafayette","state":"Missouri","latitude":39.30745,"longitude":-94.59565,"latlng":"-94.59565,39.30745","locationDetails":"Carter Buschardt knows how to get there","dewPoint":46.65,"humidity":0.86,"cloudCover":0.93,"moonPhase":0.57,"pressure":1019.54,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":5,"visibility":9.06,"highTemp":55.17,"midTemp":48.27,"lowTemp":41.37,"precipitationIntensity":0.0059,"precipitationProbability":0.77,"precipitationType":"rain","windBearing":68,"windSpeed":3.96}
{"id":"24767","timestamp":690163200,"title":"Motorist recalls possible early morning sighting north of Mt. Vernon","observed":"After reading the FAQ section, I have finally decided to tell someone of my \"sighting\". I am not saying for sure it was a bigfoot, but after reading the article you posted about   the young bigfoot caught on a game cam that some people say was \"just a bear\" made me realize that what I saw may have been a young bigfoot. My sighting was actually \"the near miss with a car\" experience. I am honestly not positive of the year, but it was near 1991 or 92. I was driving home from work, alone, about 1am. I had just turned onto the road I lived off of and was going down the first hill. Half way down, something ran across the road in front of me. I hit my brakes, natural instinct, barely missing it I was sure, and then I kept going.  It was merely seconds, but I knew what I saw was not something normal. It was on all fours, but the body and head seemed parallel to the ground, unlike the bears I have seen in zoos. (They seem to have a downward slope from their hip to their head.) The body was not large at the back half but evenly proportioned. The legs seemed to be easily defined. Not real thick at the top tapering down. The only way I can describe it would be that the legs came from the hip, no flap of skin coming from the belly region to the leg to make them look bigger at the body and it seemed the bending when it ran came from the hip and knee area. The thing that has bothered me all these years, the one thing I knew that separates this from your typical animal was the head. It was the way it looked in my direction as it ran. 1) In my experience, most animals running across the road like that don't even look at you.  2) What has bothered me the most, and I couldn't put my finger on til recently, was when it looked in my direction, it didn't turn it's head \"normally\". It brought it's head up a little, but it turned it sideways to see! (picture yourself on all fours, looking at the floor. Without lifting your head, look to the left. That is how it looked my way.) I did see two eyes and a mouth, it happened too quick to get a detailed look , but I saw a face, a face that did NOT have an extended snout. Lighter colored than the rest of the brown colored body. It seemed hairless, but again, I can't be positive how hairless it was. I had a radio on, so if there was anything to hear, I didn't hear it. The next day I drove past where I saw it and saw no signs of anything. Not then , or since then. I am from Muscatine, Iowa originally. We lived not too far from the river, right beside the levee actually, and back in the seventies there seemed to be a migratory path going thru the area. I recall hearing about an encounter with a neighbors dog, and going fishing at night only to be loaded very quickly back up into the truck by dad to leave the area because of large branches breaking in the woods. But in all the stories I have heard, I never realized that a young bigfoot is known to run on all fours so I never made the connection until I read your website. I have always assumed they walk on two legs all the time.","classification":"Class B","county":"Lawrence","state":"Missouri","latitude":37.19201,"longitude":-93.73122,"latlng":"-93.73122,37.19201","locationDetails":"Directions omitted upon wtiness' request","dewPoint":55.28,"humidity":0.88,"cloudCover":0.92,"moonPhase":0.29,"pressure":1017.44,"weatherSummary":"Foggy overnight.","uvIndex":2,"visibility":4.94,"highTemp":64.91,"midTemp":57.035,"lowTemp":49.16,"precipitationIntensity":0.0022,"precipitationProbability":1,"precipitationType":"rain","windBearing":203,"windSpeed":3.4}
{"id":"12470","timestamp":869270400,"title":"Fisherman has daytime sighting west of Mt. Vernon","observed":"When I saw it I was fishing on Spring River on SR V Highway due west of Mt. Vernon past Baptist Hill Assembly. It was in July 1997 I had been fishing near the bridge over Spring River and decided to move downstream a bit. As I came around a large group of oak trees I saw a figure walking from the stream towards the woods. At first I thought it was a hunter but realized it was too large to be a man 7-8 foot tall at least and probably over 600 pound ( I'm 6' 3\" and it was taller than me). It had long reddish brown hair kind of matted or curly looking. I was approximately 100 yards from it. I don't know if it saw me or not but it didn't seem to be in any rush to get into the woods. I watched it for at least five minutes before I couldn't see it anymore. I thought about trying to follow it but since I was alone I thought better of it, but I did go back the next day in the afternoon to see if I could find any footprints but didn't find anything that I could say definately belonged to the thing I saw.","classification":"Class A","county":"Lawrence","state":"Missouri","latitude":37.117,"longitude":-93.894,"latlng":"-93.894,37.117","locationDetails":"From Mt. Vernon go west on SR V highway past Baptist Hill Assembly to the first bridge over Spring River.","dewPoint":69.65,"humidity":0.72,"cloudCover":0.16,"moonPhase":0.48,"pressure":1015.19,"weatherSummary":"Partly cloudy starting in the afternoon, continuing until evening.","uvIndex":9,"visibility":8.37,"highTemp":90.77,"midTemp":80.875,"lowTemp":70.98,"windBearing":156,"windSpeed":1.47}
