{"id":"1261","observed":"Ed L. was salmon fishing with a companion in Prince William Sound. After anchoring off shore, his companion took a small boat up a river to check on the state of the salmon run. As the day wore on toward evening and he didn't come back at the expected time, Ed scanned upriver and across the adjacent land with binoculars. There he saw a sasquatch walking across the tundra, with long, smooth steps and with dark hair flowing from its shoulders, bouncing behind \"like a cape\" at every step. The sasquatch paid no attention to the boat (distance about 1,000').","classification":"Class A","county":"Valdez-Chitina-Whittier","state":"Alaska","locationDetails":"East side of Prince William Sound"}
{"id":"8000","observed":"Hello, My name is Doug and though I am very reluctant to post this story; I am going to do so anyways. The area that this happened  could not be a more unlikely area for a bigfoot occurance then or  especially now with all the development of the farmland in the last 25 years which has been extensive and at a phenominal rate. After reading many (if not every last report on this website) and coming across more that a few that have happened in improbable areas (bigfoot running down neighborhood streets and sightings/ vocalizations near condo areas), I decided there just might be some merit in submitting this for review. A skilled researcher might be able to shed some more light maybe. My friends parents owned a small somewhat defunct farm with (I'm guessing maybe 15-20 acres of land -not the best judge on that) They had 3 horses; 2 mares that were allowed out in the field areas; a stabled stallion, and a pony I believe. The barn was in dis-repair and part of the roof had collapsed years earlier. There was a large pond that was almost completely enclosed with an impenatrable thicket of briars ringing almost the whole cirmcuference of the pond, except for a small area that was kept open for access for the horses to water. Much of the property was overgrown with these same briars that tended to make big circular mounds here and there in the field. The house sat close to the road; the barn to the left and further behind. The extreme left side of their property was bordered by a small stream that edged along a small (100 ft x 30 ft) stand of very dense pine trees. These pines (species unknown) tend to have a very dense understory of almost horizontal dead, dry, branches due to years of growth an minimal sunlight. The lower end of this pine grove had a mowed lawn area (next door neighbors property who were also related to my friend family) You had to access the camping area through the neighbors propery as the overgrowth of briars and other weeds, brambles, trees made it impossible to get there directly for the E------- property. The pond in relation to the campsite was to the left if you were looking back up towards the road; with the stream running between. The dense pine grove then lay between you and the road; unless you skirted around it through the neigbors backyard. This is what happened. No sighting but a vocalization. We had gone down to the campsite had built a fire and been down there for about an hour. During this time we all felt uneasy even though we had been there before many times. This is a long time ago but to the best of my memory we had been joking; probably made something to eat over the fire but something felt really wrong this time. \"Wrong\" is the best word I can use to describe. I remember I felt like I couldn't just sit down by the fire and stay with the conversation though. From back in the pine grove was the occasional, deliberate braking of branches that were just a little too large (to the sophisticated human ear) and just had the sound of being \"up off the ground some ways\" This would start and stop. We would listen and comment on it. First we thought maybe the mares had gotten back into the woods, unusual but this later was confirmed not to be so because we found out the next day that they were stabled for the night. We then thought it might be some older boys who were trying to scare us into running. It would be quiet for awhile then there would be a sense of movement closer to where we were and then receeding. We shined a flashlight and ventured back alittle ways but saw or smelled nothing. The sounds began again this time definately agitated, insistent with a very permiable feeling. We started to get un-nerved  moved out into the neighbors backyard. The sound grew louder, with traceable movement and then this ear splitting scream cut right out into the night. One loud shriek louder than anything should have to be. It just cut right to the core of your soul. Like so many reports I've read on this website, it's virtually impossible to do it justice with a human description precisly because it sounded so inhuman. We just ran like hell back to the house, left everything behind. No sense of being followed at all. No visual sighting (I almost wish). No bad smells or odors. In terms of other reports this pales, I know. But this is what happened and I never forgot it. We knew what Sasquatch were at the time, but no one ever heard of sightings east of the Mississippi to the best of my memory then. We kind of joked that maybe that's what our unseen friend was. Years later when I read and saw the reports from the southern part of York County (report on file with your website.) did I ever give any serious thought.","classification":"Class B","county":"York","state":"Pennsylvania","locationDetails":"I would rather not have exact location (listing the nearest road) to repect the privacy of the family that still owns the property. I have long since had a falling out with my friend at the time and don't feel he or they would like being approache about this. I like my own privacy respected; so I must accord others the same. The general area at that time was more open farmland with some large housing developements (in which I lived) within a mile. There were a good deal of homes scattered here and there and others in smaller developments. A very large animal like a Sasquatch could conceivably navigate (migrate) through an area like this at night using farmland as cover; but absolutely not stay very long in an area like that even then without revealing it's presense. I can give you more specific details on topography. Farmland opens up eventually much more to the north with a State Park (Gifford Pinchot) at the north end of the county. Southern end of York county where the  sightings occurred is a more likely area given in terms of what I've read of similar topography of other sighting then. Also much more rural and forested in the early \"70's."}
{"id":"703","observed":"It was May 1984. Two friends and I were up in the hills nw of Yamhill, OR, late in the evening, around 10:30 pm. We heard the scream, a VERY low, very long howl. Not a coyote, bear or cougar. Have heard all of them before. This was nothing like anything I have ever heard. I still remember thinking to myself \"How in the hell can something make such a low howl.\" It scared us at first, but is sounded like it was far away, like maybe a mile or so. We were drinking a little beer, so after awhile we relaxed and forgot about it. It must have been about a half hour later when we heard it again. I swear that it had to be within 30 yards of us. Same loud, low howl, but MUCH closer. And it sounded pissed. I could feel the sound vibrations bouncing off the back of my neck. The hair stood up on the back of all of our necks. All of us turned white as hell, and our jaws dropped past our knees. The howl seemed to say \"GET OUT!\" Which is EXACTLY what we did. I just looked at the two other guys and said \"lets get the @#$ outta here \". We did not see anything, but felt the presence. I grew up within 10 miles of that spot. I had never heard that sound before, or since, EXCEPT on a television show that had a report of a bigfoot sighting. A guy in Idaho caught one on video (at least it looked like one), but when I saw the video, I heard that scream again. The guy taking the video threw the camera in the ditch, and hid. It was the SAME scream. ONLY other time that I have EVER heard it. It was EXACTLY the same scream. I saw this video on a news show, something like \"Real TV\" while in Fairfax, VA, in 1992 or 1993. I do not know EXACTLY what it is that we heard, but I know what I think it was. Bigfoot. That is my story, and I have two wittnesses to back me up.","classification":"Class B","county":"Yamhill","state":"Oregon","locationDetails":"Logging roads north west of Yamhill, OR, about 15 miles."}
{"id":"9765","timestamp":118022400,"title":"Motorist and children have daylight sighting near Burns Flat.","observed":"My two children and I were returning from Altus,  Oklahoma to Burns Flat, Oklahoma in the fall of 1973 when a very large black man-like creature crossed the highway moving from west to east. I was driving and my son (age 11) was sitting in the front seat beside me and my daughter (age 12) was sitting in the back seat leaning forward between the driver and passenger seat. It was a clear sunny day about 3 PM and there was a lull in the conversation. It was quiet in the car, we did not have the radio on and all three of us were happened to be looking straight ahead. I noticed a movement on the left side of the road and was amazed to see a what I percieved to be a very large black man-like creature rise from a squatting position and run across the two lane highway about 30 yards ahead. It ran across the highway, covering the distance in only three steps, I estimate the creature to have been at least 8 feet tall, it glanced briefly in the direction of the car and I instictively applied the brake so as not to hit it. It ran into the bar ditch on the east side of the road and ducked into some brush and large bushes between the ditch and the barbed wire fence. It had hair that looked rather silky as it ran, I remember seeing the hair move as it ran. The hair did not appear to be stiff like an animals hair but more soft and shiny. Both children saw it too and said \"What was that, mama?\" I said I didn't know, they wanted me to stop the car, but I was frightened that my children and I could be harmed by something I had never seen before in my life. I didn't tell anyone what I had seen and cautioned the children not to say anything either.","classification":"Class A","county":"Washita","state":"Oklahoma","latitude":35.3011,"longitude":-99.1702,"latlng":"-99.1702,35.3011","locationDetails":"The creature crossed from one cattle pasture to another, it may have been leaving a pond on the east side of the highway.","dewPoint":50.86,"humidity":0.73,"cloudCover":0.16,"moonPhase":0.07,"pressure":1017.29,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":6,"visibility":10,"highTemp":72.55,"midTemp":63.225,"lowTemp":53.9,"windBearing":263,"windSpeed":8.15}
{"id":"4983","timestamp":49852800,"title":"Sighting and vocalizations at a home in Wayne National Forest","observed":"I was staying the night with a friends of mine. It was late at night we were watching TV waiting on his parents to come home. We heard a noise out front and I looked out the window in the door to the mobile home. A large face was looking in the window. The face had a very heavy brow with deepest eyes, the nose was wide and flat with flared nostrils. The lips were thick and rubbery looking with thick block like teeth. The hair was about one inch long on the face and it sweptback from the brow with a large lump standing up on the top of the head. The head sat on the shoulders with no sigh of a neck. It let out a scream and it pushed off from the door. My friend grabbed his 22 rifle and we went out the back door in time to see it step NOT JUMP but step over a 3 strand barb wire fence and run in a hunched over motion with it's arms swinging it's hands below it's knees. The next day we looked for tracks but found none. We did measured the distance from the ground to the window of the door (there was no front steps) 7'6\".","classification":"Class A","county":"Washington","state":"Ohio","latitude":39.38745,"longitude":-81.67339,"latlng":"-81.67339,39.38745","locationDetails":"Vincent, Ohio (In theWayne National Forest)","dewPoint":62.45,"humidity":0.82,"cloudCover":0.86,"moonPhase":0.32,"pressure":1022.74,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":6,"visibility":4.97,"highTemp":76.32,"midTemp":70.44,"lowTemp":64.56,"precipitationIntensity":0.0006,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":156,"windSpeed":3.02}
{"id":"26566","timestamp":1064016000,"title":"Man observes tall, white hair-covered creature during a family gathering near Lake Ontario","observed":"My family had moved from the city of Rochester to Wolcott, a small town about 50 miles east of Rochester in July 2003. We were living in an old farmhouse on approx. 77 acres of woods & creeks near Lake Ontario. This incident happened sometime between the 18th-20th of September. My sister's birthday is the 20th and I recall a small group of family and friends were visiting the house for that occasion. My future-stepfather took a small group, including his brother, my four sisters, and a few other friends out for a \"tour\" of the property. I was not present, I had stayed behind at the house. As the group returned to the house, my stepfather lingered behind in an area of the property where a strip of woods runs between two fields. My stepfather was in the field closer to the house, we'll refer to it as field #1. He noticed to his left something in the woods and turned to see a tall, white, hair covered creature standing just off the path in the woods. He ran ahead and told his brother, but did not tell the rest of the group. His brother rushed into the house to get me, telling me that something was in the woods and I should come see. I followed him outside where my stepfather relayed the story to me and the three of us walked back to the area of his sighting. As my stepfather showed me the spot where the creature had been standing, we all noticed that the creature was still present, but had moved further back, to field #2. At this point, the three of us were standing in field 1 and looking through a small strip of trees at the creature in field 2, maybe 200 yards away or so. My observations of the creature are as follows: It was approximately 7' tall, covered in hair, white but with a dark area on the face, think and lanky, with a head that came to a slight conic shape. It was too far to distinctly see its face but there was a definite darker colored area where the face would have been. The creature was clearly observing us, as it paced back and forth, looking around trees, standing up taller, ducking down, etc. to get a better look at us. After approximately 45 seconds, the creature retreated to an area where we couldn't see it clearly. I walked through the trees into field 2 to get a better look at it, but it had disappeared. The area where it had been walking was matted down, but there were no distinct prints. Judging by nearby trees, I estimated its height to be 6.5 - 7 feet.","classification":"Class A","county":"Wayne","state":"New York","latitude":43.27314,"longitude":-76.89331,"latlng":"-76.89331,43.27314","locationDetails":"East on Route 104, near town of Huron.","dewPoint":54.06,"humidity":0.75,"cloudCover":0.48,"moonPhase":0.81,"pressure":1020.75,"weatherSummary":"Partly cloudy until evening.","uvIndex":4,"visibility":9.53,"highTemp":67.62,"midTemp":58.16,"lowTemp":48.7,"precipitationIntensity":0.0006,"precipitationProbability":0.21,"precipitationType":"rain","windBearing":253,"windSpeed":8.73}
{"id":"5692","timestamp":20995200,"title":"Father and son hear vocalizations on Peavine Mt","observed":"I grew up in Northwestern Nevada along the California border in the foothills of the Sierra's.  My father was a geologist who preferred working and camping in areas that were as sparsely populated as possible.  Between 1970 and 1983 I had a number of encounters in Nevada, California, and Washington states.  I plan to submit them individually in chronological sequence so that I can provide as much detail for researchers as possible. This first encounter occured in 1970 on Peavine Mountain Northwest of Reno, Nevada.  I was ten at the time and tagging along with my father, who was hunting deer.  We were on the Western side of the mountain, close to the California border.  We were between two ridges crossing a meadow on the Western face of the East ridge.  It was about 3:30 PM and the sun was beginning to drop behind the trees on the Western ridge.  There were no clouds and it was still very bright in the meadow, but the shallow draw between the two ridges was heavily shadowed. As my father and I neared the center of the meadow we heard an extended call coming from the West.  We had lived in Kansas until I was eight and the call reminded me of the World War II air raid siren they used for tornado alerts where we used to live.  It began low and relatively quiet and rose in both pitch and volume as it progressed.  It lasted for about fifteen to twenty seconds before rapidly dropping off.  After about ten seconds the call was repeated.  It seemed to me that it was coming from the draw a couple of hundred yards West and downhill from us.  Unlike the tornado siren I was familiar with, it had a mellow, rather than harsh, or mechanical, quality to it. As the second call ended I asked my father what was making the noise.  Annoyed, he told me that it was just the siren from a fire tower and picked up his pace.  That seemed reasonable, and I began looking around at the surrounding high ground for the tower when the call sounded a third time.  It seemed to be coming from the draw and seemed to be moving away from us. I caught up with my father and, being a curious ten-year old, asked him in rapid succession where the tower was and if he smelled any smoke.  He replied that it was on the other side of the far ridge and that they were just testing the siren.  I told him I thought the call was coming from the draw and at that point was told to shut up.  As the call sounded a fourth time, even further away, my father listened to it and then decided to call it a day.  We walked to the jeep and drove home without further incident.","classification":"Class B","county":"Washoe","state":"Nevada","latitude":39.592,"longitude":-119.975,"latlng":"-119.975,39.592","locationDetails":"The Western face of Peavine Mountain, Northwest of Reno Nevada.","dewPoint":43.89,"humidity":0.42,"moonPhase":0.02,"pressure":1011.96,"weatherSummary":"Clear throughout the day.","uvIndex":9,"visibility":9.76,"highTemp":88.56,"midTemp":70.22,"lowTemp":51.88,"windBearing":197,"windSpeed":1.96}
{"id":"438","observed":"heh i kinda feel a little dumb that im reporting this but its bothering me so here goes.. bout a month ago i was with a friend and her son, we were hanging out at a camp ground by Allamuchy state park, in Warren county NJ. i think the camp ground was part of Stephens state park either way it was on the Musconetcong river. it was late in the day and we were just walking on the trials by the river. we figured since her son was gonna stay with her folks that evening we would come back later and spend the night at the camp ground. we went home and got together some gear, just sleeping bags and sleeping pads. we stopped at a store got some hotdogs and rolls and a gallon of water then headed to the camp site. it was about 10pm when we got to the camp site and i think we took spot 19. it was close to the road one of the last spots before ya hit the road maybe 50 yards or so. we made a fire in the metal fire ring and just sat around till about 1am, there were maybe 5 or 6 sites that were camped that night one was taken by some boy scouts. at about 1am my friend got in her sleeping bag next to the fire, i was still up drinking hot chocolate and stareing into the fire, about 20min or so later i got into my bag next to her and was lieing on my side looking into the woods. i wasnt comfortable and i laid awake for a good hour or so just thinking and listening to the sounds of the woods and the river that was 100yards tops away from me. then i heard a sound like someone was lightly banging a fork or something against a plate. i thought maybe a bear was snooping around looking for a free meal, this is bear country and we have a very healthy black bear population, but maybe 30 seconds after i heard the metalic sound i heard someone or something bang a branch against a tree 4 or 5 times in a row, i thought that the bear maybe was getting a little to close to someones camp site. then i again heard banging against a tree but this time it was a bout 100yards into the woods and not near any camping area that i had seen in the daylight. then the tree banging came from the first spot as if answering the other position. the first tree banger was what seemed to be on or near the road by the middle of the camp ground. that kinda made my mind wander i was wondering what was going on..and who is up making all this noise. about 10minutes later i looked into the woods which were slightly iluminated by my dieing fire and i saw what looked like a bear looking into my camp about 20 feet away from behind a tree. i saw just the shadowy outline of it. i could see its head and shoulders slowly move out from behind the tree look in and then move back behind the tree. ive seen bears do this before in the day light but never this close. then i closed my eyes waited a few seconds and opened them just to make sure i wasnt seeing things. but this whatever it was had difined shoulders and a rounded kinda pointy on top head, it didnt have and ears like you would see on a bear, nor the flat head of a bear and if it was a bear its front arms wouldnt have given it the squared off shoulders that i was seeing in the silloette of this figure. i got kinda scared for a few moments and didnt move a at all. i thought for a second about jumping up and yelling at it but i didnt want so get it mad at me or scare it. i closed my eyes and tried my hardest just to fall asleep. i dozed off finally and was awoken by my friend who was yelling at me for not putting the bag of hotdogs in the car before going to sleep. we had in the bag a apple and a orange, rolls and a unopend pack of hotdogs, i tied the bag with a simple knot like you would tigh your shoes the night before, but when i got up the only thing left where the bag was, was the orange just sitting there on the ground. my friend said somthing along the lines of wow a bear came and stole our hotdogs. i kinda was wondering what was going on so i decided to have a look around where i saw the figure the night before, i remembered that the shadowy figure was hiding behind the tree and i could see a branch just above its head maybe a foot or so higher than the top of the figure. it was puzzleing because that branch must have been 8 or 9 feet off the ground and black bears where i come from dont stand that tall on there hind feet. i didnt try to tell her what i heard or saw the night before because she wouldnt have belived me anyway, but ive spend lots of time in the back country and woods hunting, fishing, rock climbing, and backpacking. i know what bears look like up close as well as from a distance. and this wasnt a bear and to tall for a person. i didnt smell anything but i think i was up wind anyway and we were burning wood in the fire and all i could really smell was the fire anyway. the thing that really bothers me is the tree banging its was allmost like something was comunicating with something else. it also bothers me that something waited until it was sure that i was asleep before coming into camp. in which case it woulda been 6 or 7 feet from where we were sleeping in order to open the bag and have a look in it, then disguard the orange and take the rest bag and all. it wouldve had to make some sound if it just tore the bag opened. i looked around before we left to see if i could find any tracks or anything but the ground is was just to hard, there was a few game trails but i didnt look very far or spend alot of time looking. i looked on the internet and found this sight and was surprized to see other sitings in new jersey.","classification":"Class B","county":"Warren","state":"New Jersey","locationDetails":"the road is off us rt 80, i dont know the exit number just how to get there if im driving will try to find out the details."}
{"id":"55269","timestamp":1465257600,"title":"Dawn sighting at Stevens Brook outside Claremont","observed":"I was on my way to Claremont from Lebanon on Rte 120 and was passing by some reeds in a marshy area next to the road that sounded like a huge flock of birds. The creature came out of the reeds and was crouched down looking at me through them. Surprisingly it got out of the reeds from crouched to standing turned around and ran towards the wooded area up a hill and was moving with it's arms brush and tree branches out of the way. It was incredibly fast runner and I got a good look at its coconut shaped head as it ran away. It was light brown/brown. It had incredibly broad shoulders. I went back the same day. The marsh went up to my knees and I could smell a bad odor like garbage. Myself and a friend went back to the sighting. We found a footprint and a hair sample. I could hear wood knocks when my friend James did a call and we also found a large bed of branches and some tree structures. The following month I went back to Claremont and I heard screeching in the woods while I was traveling Rte. 120 on a bicycle.","classification":"Class A","county":"Sullivan","state":"New Hampshire","latitude":43.41549,"longitude":-72.33093,"latlng":"-72.33093,43.41549","locationDetails":"Close to Claremont down 120 not far from Kingston road.","dewPoint":54.25,"humidity":0.73,"cloudCover":0.22,"moonPhase":0.1,"pressure":999.41,"weatherSummary":"Rain in the evening.","uvIndex":8,"visibility":9.47,"highTemp":75.83,"midTemp":65.75,"lowTemp":55.67,"precipitationIntensity":0.0057,"precipitationProbability":0.3,"precipitationType":"rain","windBearing":234,"windSpeed":2.47}
{"id":"6410","timestamp":299894400,"title":"Multiple witness sighting at night, 3 miles east of Mead, Nebraska","observed":"First of all this happened in the summer of 1979 on the 4th of July. This is the first of two possible encounters I have experienced over 22 years. The second occurred on November 10th in 2001. We had just finished lighting our 4th of July fireworks and were sitting around the patio talking and relaxing. There were probably 8 adults and 6 kids at my former InLaws farm house. It was around 11pm when a friend of ours jumped up from his chair screaming for everyone to look at the bean field across the highway from the house. As we all turned to look we noticed something very large walking West to East aproximately 300 yards into the feild. It was a fairly clear and the moon was very bright that night. The animal/creature walked at a very fast pace through the beans to a point behind a hill where we lost sight of it. I have hunted my entire life and have never seen anything like this before. It walked leaning slightly forward, swinging it's arms as it moved across the field. At the distance it was from us the only thing we could notice is the size. I had been target shooting earlier that day and had a fire arm in my truck. My brother InLaw and I decided to go see if we could get a closer look at it. My 4X4 Ford truck was a former security truck so it was equiped with spotlights. We enter the field and drove to a point where we could see the trail heading to the East which we began to follow in the truck. We came to a barbed wire fence where one could tell something had crossed the fence and headed off into a tree line some 50 to 75 yards from the fence. WE sat there for maybe five minutes scanning the tree line with the spotlights and noticed nothing. I don't know if it was fear or common sense but we looked at each other and decided that whatever tore up the ground around the fence was too close for us to be sitting out in the field looking around in the dark. I put the truck into reverse and backed the entire way back out to the highway. This area is close to an old military base which stored ammo and bombs during WWII. There are numerous under ground storage bunkers a couple miles south of this area. No one at the gathering ever mentioned or talked about it again. I divorced 3 years later and have had no contact with my InLaws since then. I later heard tha tthey moved away from the old farmhouse to another town. I will submit the second occurance on a seperate report. ","classification":"Class B","county":"Saunders","state":"Nebraska","latitude":41.2333,"longitude":-96.42668,"latlng":"-96.42668,41.2333","locationDetails":"Location was on the South side of Highway 92, 3 miles east of Mead,Nebraska.","dewPoint":66.52,"humidity":0.82,"cloudCover":0.96,"moonPhase":0.32,"pressure":1014.8,"weatherSummary":"Rain in the morning and afternoon.","uvIndex":6,"visibility":6.49,"highTemp":73.55,"midTemp":68.565,"lowTemp":63.58,"precipitationIntensity":0.0155,"precipitationProbability":0.78,"precipitationType":"rain","windBearing":63,"windSpeed":8.17}
{"id":"751","timestamp":956275200,"title":"Hunter describes described being stalked near Minot","observed":"While this incident occurred a long time ago, it may be ofsome use, as I have never heard of any such sighting in North Dakota. Whilecoming back from a hunting trip outside of Minot, North Dakota in aroundthe third week of April, in 1962, a friend of mine and I were followedby a creature as we returned in the direction of the trailer park in whichwe lived. (My father was working for the Department of the Air Force onthe Missile site Installations at the time.) After walking back from somedistance out on the prairie, I had the distinct feeling that someone orsomething was following us. Eventually I became so uncomfortable that Idid look over my right shoulder and saw at a distance of about 50 yardsor so, what I thought at first was a great ape. I cannot describe to youwhat I felt at that moment. It fixed me with it's eyes and stood up onit's hind legs when it saw that it had been seen. As all I had was a singleshot .22, shooting it was out of the question. I got a real good closelook, long black shiny hair, oily looking, and it rose from all fours onto it's hind feet.(I am certain it had followed us for some time). Verytall. No hair on the face above it's nose or the palms of it's hands. Longarms. Very malevolent expression conveyed to me. I cannot overemphasizethis. It began to move in our direction. (I was with a partner). Both ofus ran as fast as we could. We didn't look back after this.","classification":"Class A","county":"Ward","state":"North Dakota","latitude":48.25422,"longitude":-101.3166,"latlng":"-101.3166,48.25422","locationDetails":"Ward County, Just outside of a the Minuteman Trailer Park,outside of Minot, North Dakota.","dewPoint":30.46,"humidity":0.31,"cloudCover":0.3,"moonPhase":0.6,"pressure":1011.97,"weatherSummary":"Partly cloudy until evening.","uvIndex":5,"visibility":9.48,"highTemp":79.1,"midTemp":59.085,"lowTemp":39.07,"windBearing":235,"windSpeed":9.79}
{"id":"3339","timestamp":574387200,"title":"Deep impressions seen in the snow","observed":"In early spring 1988, some friends of mine and I were traveling up the road to the top of Mt. Mitchell in a four-wheel drive vehicle. Mt. Mitchell is the highest peak east of the Mississippi River at 6,684 feet, and as a result, the mountain gets heavy snowfalls well into March and sometimes April. There had been some heavy snowfall in the weeks preceding our drive, and there were some deep snowdrifts piled up alongside the road, although the road had only a dusting of light snow on its surface. Almost no one goes up on the mountain in the wintertime, and as I remember it, we had to skirt our way around a barricade to even get on the road to the summit. We reached the top of the mountain, then turned around to drive back down. About a half mile below the summit, we went around a sharp, left-hand turn, and our headlights hit the steep bank beside the road. In the snow on the bank we could see several deep impressions that led up the bank and into the woods. We got out and examined the marks, but it was dark and we couldn't tell much about them. The next day, we drove back up and looked at the marks in the daylight. The tracks, as we took them to be, were in deep snow, and we could see mud at the bottom of them and measured the depth of the snow at 18 inches.  In the two tracks closest the road, there were faint outlines that could have been toe marks, but there were no claw marks visible as with bear tracks. The prints were apparently made by a bipedal animal, and led up a steep bank and disappeared over the top of the bank about 75 yards up the slope.  The bank beside the road was extremely steep, and it took my friend, who is 6-2 and athletic, eight long strides to climb the bank, but whatever left the prints needed only two steps. At one point, the animal had stepped over a fallen branch approximately three feet off the ground without breaking stride. I know sometimes big cats can leave footprints that appear to be two-legged, and there are still some panthers (mountain lions) left in the mountains of North Carolina, but if a cat made these marks it would have to have been the biggest panther in the world. They were about 14 inches long and seven inches wide. We thought perhaps the marks could have been made by clumps of snow falling from trees, but there were marks where there were no overhanging branches. We split up that day and two different groups walked along the road about a mile in each direction from the prints, but we never found where the animal had crossed the road, which means it was obviously using the road for traveling instead of trudging through the deep snow.","classification":"Class B","county":"Yancey","state":"North Carolina","latitude":35.74875,"longitude":-82.26195,"latlng":"-82.26195,35.74875","locationDetails":"Yancey County, North Carolina, near the summit of Mt. Mitchell","dewPoint":10.97,"humidity":0.49,"cloudCover":0.46,"moonPhase":0.91,"pressure":1015.08,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":6,"visibility":9.37,"highTemp":35.65,"midTemp":30.035,"lowTemp":24.42,"precipitationIntensity":0.0002,"precipitationProbability":0.23,"precipitationType":"snow","windBearing":322,"windSpeed":10.39}
{"id":"1757","timestamp":598147200,"title":"Two separate sets of large footprints found","observed":"The foot prints of two bigfoot creatures who had visited the ranch house my son and his family were renting. The day before these tracks appeared my daughter-in-law and I had hiked about a mile up the gulch looking for deer tracks. In backtracking the tracks of the two creatures we found that they had come upon our tracks at the head of the gulch and had followed them back to the  house and that the larger of the two had gone all around the house, barn and fields below the house. The smaller one stayed out by the rabbit hutches and had curiously curled feet.  The larger creatures prints measured 17 inches and the smaller one's prints measured 14 1/2 inches around the curved foot. We took pictures of the prints and the thing that struck us most about prints was that the creatures had to have been massive as it was very cold and the snow and ice on the ground was frozen so hard that we could jump up and down without breaking through to the ground, but every print of both creatures went completely through the ice.  We did not see the creatures them selves, only their prints.","classification":"Class B","county":"Silver Bow","state":"Montana","latitude":46.05292,"longitude":-112.571,"latlng":"-112.571,46.05292","locationDetails":"At Bull Run Gulch just northwest of Walkerville, Montana, a suburb of Butte, Montana.","dewPoint":3.96,"humidity":0.73,"cloudCover":0.22,"moonPhase":0.23,"pressure":1041.91,"weatherSummary":"Partly cloudy starting in the afternoon, continuing until evening.","uvIndex":1,"visibility":9.99,"highTemp":19.43,"midTemp":11.16,"lowTemp":2.89,"windBearing":216,"windSpeed":3.29}
{"id":"13494","timestamp":1136419200,"title":"Sundown sighting near Tishomingo State Park","observed":"At about 5pm January 5, 2006, I was returning home from a trip to Florence Alabama via the Natchez Trace Parkway. About fifty yards north of mile marker 307, a creature darted across the road between my car and another coming the opposite way. It was solid black and looked to be between 4 1/2 feet tall and 5 feet tall and was running on 2 legs. I could not clearly make out any features in part because it was near sunset and in part because of the speed at which it ran. It appeared to running alongside the road heading down the southbound lane and very quickly turned and crossed the road. It stumbled slightly at the edge of the road and swung its arms to regain balance then continued across the road and into the tree line. I don't care to speculate how fast it was moving but I'm sure it was faster than a human, maybe about as fast as a deer can run. I stopped when I got to where it crossed but I did not see anything else. My wife who was with me did not spot it and if the people in the oncoming car spotted it, they made no indication.","classification":"Class A","county":"Tishomingo","state":"Mississippi","latitude":34.60905,"longitude":-88.19894,"latlng":"-88.19894,34.60905","locationDetails":"Natchez Trace Parkway, approximately fifty yards north of mile marker 307.","dewPoint":33.86,"humidity":0.68,"cloudCover":0.43,"moonPhase":0.21,"pressure":1016.63,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":2,"visibility":9.04,"highTemp":51.42,"midTemp":43.535,"lowTemp":35.65,"windBearing":342,"windSpeed":9.13}
{"id":"27261","timestamp":1195344000,"title":"Couple witness rocks thrown and possible vocalizations between two animals on either side of a fishing dock near Williamsville","observed":"My wife and I were night fishing off the docks of chaonia landing at lake wappapello in late fall early winter 2007. At around midnight we heard rocks being thrown into the lake from across the bank.  we went to the end of the dock to see what was going on. coming down the bank along the waters edge rocks were being thrown into the water about every 50 feet or so, big rock the size of bowling balls. the bank I'm speaking of is actually an island with water on three sides of it for about 5-6 miles, and it ends right in front of the boat docks we were fishing. coming straight towards us along the bank something was throwing these boulders into the water, when out of the trees came a rock straight at us and landed in the water 6 feet in front of us followed by a very deep growl and grunt.  the distance from the end of the dock and the opposite bank is maybe 50 feet. we stood there looking into the trees desperately trying to see whatever was growling at us yet it stayed just inside the tree line.  the lights from the docks light up the whole opposite bank from point to point.  up and down the bank this creature went tossing rocks and growling and screaming.  then we noticed another creature on our side of the bank coming down towards us throwing rocks into the water howling after each rock hit the water.  the two were doing this in unison up and down the bank for over an hour while we were trapped on the dock in fear.  the one caught on the island worked his way into a huge angry fit. the two seemed to be letting the other one know where the other was.  there is so much we witnessed, heard saw that i cant possibly write all down here. for nearly two hours we stood terrified as we realized what we were experiencing. we have not really told our story to any other than family. its too unbelievable.","classification":"Class B","county":"Wayne","state":"Missouri","latitude":36.57869,"longitude":-90.21339,"latlng":"-90.21339,36.57869","locationDetails":"if you look at the location of chaonia landing you'll note it sits in the middle of three points of land surrounded by the waters of lake wappapello. these two creatures were across the water from each other trying to find a path back together. eventually they went off in the direction they came continueing to call to each other.","dewPoint":45.96,"humidity":0.79,"cloudCover":0.45,"moonPhase":0.28,"pressure":1019.67,"weatherSummary":"Mostly cloudy starting in the afternoon.","uvIndex":2,"visibility":7.16,"highTemp":64.8,"midTemp":61.935,"lowTemp":59.07,"windBearing":112,"windSpeed":2.6}
{"id":"1158","timestamp":-416966400,"title":"Child encounters a man-like creature in a shed.","observed":"As a child I was between 10 or 12 years old, at the time the incident happened. we were visiting my grandmothers house as we often did on the weekends. A bunch of the grandchildren including myself were playing hide & seek it was nearing sun down I kept getting caught early in the game & decided to venture outside of the fenced area and up the gravel road about 200 yards to an old corn crib in a field next to the road. If my memory serves me right the crib was next to empty, the door was facing away from the road and it was starting to get dark, I entered the crib in a hurry not paying any attention to what may be in the crib, while looking through the cracks in the crib towards the house to see if anyone had seen me enter, I heard a heavy breathing behind me, upon turning around what I saw was indescribable for a kid my age, this huge man like creature was standing over me just staring at me he was hairy and huge it made no sounds and smelled some what like a hog pen which everyone raised in that area and time. After wetting my pants and running like a bat outof hell back to the house crying and scared to death, I told my uncle what I had seen, only he did not take me serious and started making fun of me, because I had peed my pants. I will swear to this day what saw was a bigfoot.","classification":"Class A","county":"Washington","state":"Missouri","latitude":38.039,"longitude":-90.7517,"latlng":"-90.7517,38.039","locationDetails":"Between DeSoto & Potosi on old Missouri Highway 21.","dewPoint":52.63,"humidity":0.57,"cloudCover":0.65,"moonPhase":0.37,"pressure":1021.42,"weatherSummary":"Mostly cloudy throughout the day.","uvIndex":3,"visibility":9.82,"highTemp":81.64,"midTemp":70.22,"lowTemp":58.8,"windBearing":175,"windSpeed":6.51}
{"id":"30159","timestamp":627350400,"title":"Recollection of a possible nighttime encounter on a four-wheeler near Sullivan","observed":"It was winter of 1989.  What I saw scared the **** out of me.  Me, my sister and her friend found the keys to my brothers 4-wheeler and decided to sneak it out @ approx 10:30 pm on a snowy winter night. Nobody knew we were going to do this, so there is no way anyone could have been waiting for us in a costume or anything.  Plus nobody knew I even knew how to operate a 4 wheeler (including myself).   We headed out to the woods behind our parents house and half way down a steep hill the 4 wheeler took off flying and when I figured out what gear to put it in the 4 wheeler stopped and my sister and her friend jumped off.  I recall smelling something \"dead\" then I heard something that sounded like Monkeys (yes multiple) fighting.  When I looked towards the trees I see this huge monster walking out.  This thing was at least 7.5 or 8 ft tall and standing straight up with huge long arms and legs. As it was walking towards us it made a deep growling angry noise.  I took off on the 4- wheeler and my sister and her friend were running as fast as they could to catch up.  I looked back a few times and recall thinking- this thing is walking but one of it's steps was equal to 20 of mine.  We were in a panic we were all screaming and the louder our screams the deeper it's growl got. By the time my sisters friend had grabbed her arm and yanked her onto the 4 wheeler, it was within it's arms reach of us but never tried reaching out to hurt us. It was obvious he or she wanted us out of there.  I was only about 13 at the time so I wasn't wise enough to call someone to come research it.  I believe our parents just thought we were making it up.  And of course, I was way to scared to go back and track foot prints or anything.","classification":"Class B","county":"Washington","state":"Missouri","latitude":38.11468,"longitude":-91.06547,"latlng":"-91.06547,38.11468","locationDetails":"Do not post this information.  My parents have since sold a portion of this property and we do not want the new owners to be bothered.","dewPoint":14.35,"humidity":0.48,"cloudCover":0.23,"moonPhase":0.7,"pressure":1026.39,"weatherSummary":"Partly cloudy until afternoon.","uvIndex":2,"visibility":9.47,"highTemp":40.9,"midTemp":36.305,"lowTemp":31.71,"windBearing":293,"windSpeed":0.96}
{"id":"27800","timestamp":1274745600,"title":"Large unknown animal on all fours seen crossing a road near Patterson","observed":"WE WERE DRIVING ALONG HIGHWAY 35 THROUGH WAYNE COUNTY MO.  A SECTION OF THE HIGHWAY WITH THE TREELINES CLOSE TO BOTH SIDES OF THE HIGHWAY.  THERE WERE WAIST HIGH WEEDS LEADING FROM THE TREELINE TO THE ROAD.  AS WE APPROACHED A SMALL BRIDGE WE SAW A LARGE BLACK FIGURE COME FROM THE LEFT OUT OF THE TREE LINE AND THROUGH THE WEEDS.  IT WAS ABOUT 50 YARDS IN FRONT OF US SO WE SLOWED DOWN NOT TO HIT IT.  IT CROSSED THE ROAD IN A GALLUP, RUNNING DIAGONALLY AWAY FROM US. THE LARGE FIGURE, RUNNING ON ALL FOURS, HAD A LOT OF CURLY MATTED NASTY LOOKING HAIR.   IT HAD ALL KINDS OF DIRTY AND STRAW AND OTHER THINGS STUCK IN THE MATTED MESS.  ITS FRONT ARMS WERE LONG, MUCH LONGER THAN ITS SQUATTY REAR LEGS.  THE CREATURE HAD POWERFUL SHOULDERS AND HIPS.   I WOULD SAY IT LOOKED MALNOURISHED AND THAT IT HAD MANGE.  AS SOON AS IT WAS THERE IT WAS GONE.  THE ONLY WORDS WE COULD MUSTER WAS \"WHAT THE HELL WAS THAT\"?  I URGED MY FRIEND TO STOP THE CAR TO LOOK BUT HIS FOOT HIT THE ACCELERATOR AND WE DROVE OFF.  HE WOULDN'T SAY BUT HIS EYES WERE SO WIDE I COULD TELL HE WAS SPOOKED.  I WOULDN'T HAVE GOTTEN OUT.  IT WAS THE FREAKIEST THING I HAVE EVER SEEN.  IT WAS LIKE NO OTHER ANIMAL I HAVE EVER SEEN.  SOME HAD SUGGESTED IT WAS A FERREL HOG.   BUT IT WAS NO HOG,  I WOULD ACCEPT MAYBE A SICKLY BLACK BEAR,  BUT I SAW NO EARS OR SNOUT. JUST A MOUND OF LONG BLACK MATTED HAIR","classification":"Class B","county":"Wayne","state":"Missouri","latitude":37.18847,"longitude":-90.52135,"latlng":"-90.52135,37.18847","dewPoint":65.98,"humidity":0.76,"cloudCover":0.11,"moonPhase":0.43,"pressure":1015.83,"weatherSummary":"Clear throughout the day.","uvIndex":11,"visibility":7.79,"highTemp":86.2,"midTemp":76.61,"lowTemp":67.02,"precipitationIntensity":0.0018,"precipitationProbability":0.34,"precipitationType":"rain","windBearing":119,"windSpeed":1.68}
{"id":"39764","timestamp":1360972800,"title":"Possible night screams heard near Burnsville","observed":"I was out last night walking our dogs; I walk them one at a time which usually takes about 15 minutes.  I heard what sounded like what I've heard the investigators on FINDING BIGFOOT do when \"callling\" to a bigfoot.  It was coming from about 1 mile away from the Tombigbee Water Way.  We're on the west side of the waterway.  We're in a rural area and are accustomed to hearing a variety of animal noises but, I've never heard this sound before.  We hear coyotes all the time and I suppose it's possible this could have been a coyote but, it struck me as being a sound like I've heard the investigators making on tv.  I heard it twice during the time I was out with the dogs and even mentioned it to my husband when I came in. Please understand that I did NOT see anything.  I only heard what sounded like what I've heard on the television show which sounded nothing like what I'm used to hearing out here.","classification":"Class B","county":"Tishomingo","state":"Mississippi","latitude":34.735,"longitude":-88.26655,"latlng":"-88.26655,34.735","locationDetails":"Removed to protect privacy of witness.","dewPoint":18.8,"humidity":0.55,"cloudCover":0.29,"moonPhase":0.22,"pressure":1022.78,"weatherSummary":"Partly cloudy until evening.","uvIndex":3,"visibility":9.9,"highTemp":40.01,"midTemp":31.41,"lowTemp":22.81,"windBearing":330,"windSpeed":7.37}
{"id":"25662","timestamp":1187136000,"title":"Hiker spots a bigfoot in the mountains east of Butte","observed":"I live in Butte, Montana. This is a city mostly on a hill, but stretches down into a valley. On the east side, there is a great stretch of mountains known as the east ridge. This is where I was when I saw a sasquatch. In the middle of the hill, south of the Lady of the Rockies, there are two smaller hills jutting out of the middle of the hill. I was on the northern side of the southernmost small peak, heading down to go back to my vehicle. I was heading through some trees when I looked to the north at the other hill. This hill comes up further out from the main mountain than the hill that I was on. The peak is therefore more west, and then heading east it slopes down, flattens out, then heads back up the main mountain. I was looking through these trees I was heading through up at the flattened part of that hill. I was looking right at this tree. I'd say it was a good ten feet tall. I'd say I was about 200-300 yards away from this tree. He must have seen me, because when he walked out from behind that tree, I could tell he was looking right at me. And something about the way he timed it tells me he wanted to scare me. I'd say he was about 8 feet tall, judging from the distance, and he walked just like the saquatch in the old video of him walking through that small clearing in the forest. You all know the one. Probably the most popular one out there. His arms swayed back and forth, hanging limply from his shoulders. He walked about 15 feet then disappeared behind another tree. I have no doubt in my mind of what I saw.","classification":"Class A","county":"Silver Bow","state":"Montana","latitude":45.9754,"longitude":-112.4554,"latlng":"-112.4554,45.9754","locationDetails":"On the East Ridge, south of The Lady of the Rockies. About in the middle of the hill.","dewPoint":29.09,"humidity":0.32,"cloudCover":0.09,"moonPhase":0.09,"pressure":1015.38,"weatherSummary":"Clear throughout the day.","uvIndex":8,"visibility":4.32,"highTemp":87.61,"midTemp":69.43,"lowTemp":51.25,"precipitationIntensity":0.0025,"precipitationProbability":0.84,"precipitationType":"rain","windBearing":86,"windSpeed":0.4}
{"id":"30860","timestamp":1313884800,"title":"Daylight sighting by camper at Black Mountain Campground near Blue Ridge Parkway","observed":"My two friends and I were camping near Busick, NC, just east of the Smokey Mountain National Park.   We were northeest of Asheville, near the Blue Ridge Parkway.    (Busick is so small that google earth does not have a marker for it.)   On the first of the two nights we were there, we heard wierd yells going through the woods right after dark.   Later, while we were sitting near the campfire playing dominos, we heard the same yell and heard rustling in the woods nearby.   We couldn't distinguish what it was because there were some people singing christian hymns at a small theatre nearby.   Later that night, when I was asleep, my friends(they were brothers) were talking about the upcoming wedding of one of them this coming spring and the younger brother says that he saw it move through the woods very close to our camp.   He told me about it the next day and I got kind of scared, since I may have seen a bigfoot in New Mexico back in 1994 while in the boy scouts.   The next day the two brothers went on a long hike and I stayed in camp since I was experiencing foot problems and had no hiking boots.    I got really bored so I decided to walk down what seemed to be a game trail into the woods for a few hundred yards.   I noticed that there were a lot of trees that were broken, like something had bended them.   None of these trees were very thick, but there were a few that I knew I could not snap.   I started to get a little scared, like something wasn't right.   I was only about a 1/4 mile from the campground, and I saw it.   It scared the s**t out of me.   I only saw it for about 10-15 seconds(maybe, I was so scared it could've been 5 seconds or it could have been a minute), and the best way to describe it would be that it looked like the bigfoot from Harry and the Hendersons only it was heavier and a little bit darker.   I was probably about 15-30 feet from it when I saw it.   We stared at each other for the duration of my sighting, and then it walked away as if I wasn't anything to worry about.    I stood in that spot for a little while and then walked back to the campsite, stopping every now and then to look around for the thing.   I told my friends about it and after describing the thing the one brother who saw it the night before said that it was probably the same thing he saw.","classification":"Class A","county":"Yancey","state":"North Carolina","latitude":35.75278,"longitude":-82.22121,"latlng":"-82.22121,35.75278","locationDetails":"Pisgah National Forest, Black Mountain Campground","dewPoint":67.54,"humidity":0.81,"cloudCover":0.32,"moonPhase":0.74,"pressure":1014.78,"weatherSummary":"Light rain in the evening.","uvIndex":9,"visibility":7.25,"highTemp":84.9,"midTemp":76.275,"lowTemp":67.65,"precipitationIntensity":0.0049,"precipitationProbability":0.22,"precipitationType":"rain","windBearing":247,"windSpeed":2.21}
{"id":"13276","timestamp":1135123200,"title":"Motorist has nightime sighting near Harmony","observed":"I was coming home after work about 9:30 to 10 pm heading north on ridge road.  It recently rained. Something rain across the road on two legs.  It was about 50 to 100 yards away.  It appeared to be about as tall as the hood of my car. It stopped momentarily as my headlight hit, and looked at my car, and then it turned and continued to cross the road and disappeared into the woods. I was thinking, \"what the hell was that?\" I live  nearby and hunt throughout the surrounding woods. I know it wasn't a bear or any thing we normally see in the area.","classification":"Class B","county":"Warren","state":"New Jersey","latitude":40.76345,"longitude":-75.11044,"latlng":"-75.11044,40.76345","locationDetails":"forested wetland at the base of a ridge on southeast side and agricultural field on west. whatever it was it crossed west to east","dewPoint":13.72,"humidity":0.63,"cloudCover":0.35,"moonPhase":0.69,"pressure":1021.6,"weatherSummary":"Mostly cloudy starting in the afternoon.","uvIndex":2,"visibility":9.47,"highTemp":30.45,"midTemp":26.745,"lowTemp":23.04,"windBearing":265,"windSpeed":6.49}
{"id":"17550","timestamp":1175299200,"title":"Nighttime sighting by motorist near Mansfield","observed":"Some time in early December my friend had an encounter with something he could not explain.  It took place in Mansfield, NJ in Warren County.  It was around 9:30 - 10:00 pm.  He called me up to tell me what he saw.  It turns out that on Feb. 6th I was on my way home on the same road in the same location.  It was around 10:20 pm and I was doing about 50 mph.  I saw something run across the road extremely fast.  It was around the same height as the hood of my car and it was black in color.  It ran so fast I didnt even need to hit the breaks.  Being an avid outdoors man I can usually identify animals, but I was not able to identify this one.  It was defiantly on two legs and covered in black hair.  No bear can run that fast and it defiantly wasnt a coyote or fox.  I drove home as fast as I could; I was shocked by the encounter and called my friend to tell him.  Everything I explained was what my friend had experienced as well.","classification":"Class A","county":"Warren","state":"New Jersey","latitude":40.8192,"longitude":-74.85561,"latlng":"-74.85561,40.8192","dewPoint":22.95,"humidity":0.43,"cloudCover":0.44,"moonPhase":0.44,"pressure":1023.39,"weatherSummary":"Partly cloudy throughout the day.","uvIndex":5,"visibility":9.84,"highTemp":54.28,"midTemp":47.155,"lowTemp":40.03,"precipitationIntensity":0.0015,"precipitationProbability":0.79,"precipitationType":"rain","windBearing":76,"windSpeed":2.78}
{"id":"27743","observed":"it was spring 1981 and I was driving around some country roads with a friend listening to music when the tape jammed. I pulled over to fix it but left the car running & headlights on. I looked up from the tape & saw the bushes moving on the opposite side of the road,I assumed it was deer. I was wrong. I started to fix the tape again when my buddy said \"what the hell is that\" I looked up to see a very large gray haired creature stepping out of the bushes. It walked on 2 legs like a man,was around 5 or 600 lbs & stood over 7ft tall. I'm basing the height on my buddy with me who was 6ft 8in tall. It walked out into the road about 15 yards in front of us & just stopped & looked at us for a few seconds then just walked across the road into the woods & started up a hill. it had human like hands,feet &face covered in long gray hair.","classification":"Class A","county":"Warren","state":"New Jersey"}
{"id":"49883","timestamp":1443744000,"title":"Recollection of a possible late night stalking on Waterloo Road in Allamuchy","observed":"It was August of 1977 and I had missed my ride home from Hacketstown NJ to Byram NJ. The road to get back to Byram is Waterloo Rd. It was about 9:30-10:00 PM so I decided to hitch hike it on Waterloo hoping that someone would give me a lift back to HWY-206. It was very dark and as I was walking past Stephens State Park and then the old Saxton Falls area, I could hear something that sounded like it was on 2 feet stalking me in the woods on the ridge side of Waterloo Rd. It got very interesting when I started sprinting, it also started sprinting keeping up with me for what seemed like at least a mile. When I would walk, it would walk. It was loud as it went thru the woods as I stayed on the road hoping for a car to pick me up. Eventually I did get a ride near a few houses after passing an old Tavern on the river side of Waterloo Rd.","classification":"Class B","county":"Warren","state":"New Jersey","latitude":40.89452,"longitude":-74.79077,"latlng":"-74.79077,40.89452","locationDetails":"Waterloo Road, near the Sussex - Warren County border.","dewPoint":44.65,"humidity":0.81,"cloudCover":0.36,"moonPhase":0.67,"pressure":1022.25,"weatherSummary":"Light rain starting in the afternoon and breezy in the evening.","uvIndex":2,"visibility":8.63,"highTemp":51.18,"midTemp":49.13,"lowTemp":47.08,"precipitationIntensity":0.0164,"precipitationProbability":0.82,"precipitationType":"rain","windBearing":42,"windSpeed":12.24}
{"id":"4904","timestamp":958521600,"title":"Professor and students discover series of large footprints crossing high mountain trail","observed":"My summer ecology class was hiking to Middle Fork Lake. As with most classes, some students walked faster than others. I was with the stragglers, a few of whom were suffering from the cold and thin air. The trail had only been opened, as I recall, the previous day, and ours was the first group of the season to make the ascent. Lots of snow remained in shaded areas and in many places on the trail, and it was obvious no one had walked ahead of us, although a couple of older men on four wheelers passed us at one point. We were getting fairly close, within a half mile or so, to the lake; the slope was very steep. I remember our little group went past a switchback and we were uphill from a stream. Somewhere in this stretch, crossing the trail at a right angle, was a series of very large, apparently bipedal, tracks. In shape and contour, the tracks appeared human. No details, such as toe impressions, remained or could be readily detected, but every indication was that the tracks had been made by bare feet, not boots. The students immediately starting exclaiming, Bigfoot, bigfoot! Doing my best to downplay the tracks, I told the students that they were probably those of a hiker and that they had become enlarged as a result of melting and refreezing. Privately, I didnt believe that story for a second. As far as I was concerned, the impressions were the record of something extremely unusual. The tracks were huge, at least sixteen inches or more in length and quite wide. The depth of the tracks in the snow and soil was far beyond what I could duplicate; it was obvious, even to the students, that whatever or whoever made the tracks had immense weight (I told them the hiker was probably carrying a very heavy pack). The distance between the tracks was on the order of four feet or more, an interval that was all the more impressive considering the extreme steepness of the mountain in that area. It did not seem possible to me for any human to duplicate such a feat (so to speak) as was performed by the mysterious maker of those tracks, especially considering the conditions of snow and slope. In addition, the tracks were not headed to Middle Fork Lake. Of course, that doesnt prove anything, but I found it strange that anyone would hike up the mountain, avoiding the trail, and heading to something besides the lake. As best as I could determine, the tracks appeared to be going in the direction of Bull-of-the-Woods Mountain.","classification":"Class B","county":"Taos","state":"New Mexico","latitude":36.599,"longitude":-105.4113,"latlng":"-105.4113,36.599","locationDetails":"We were on the trail to Middle Fork Lake. Approximately 36.5990 N, 105.4113 W.","dewPoint":15.31,"humidity":0.23,"cloudCover":0.18,"moonPhase":0.48,"pressure":1001.39,"weatherSummary":"Breezy until evening.","uvIndex":14,"visibility":9.96,"highTemp":63.61,"midTemp":47.77,"lowTemp":31.93,"windBearing":261,"windSpeed":15.27}
{"id":"16207","timestamp":1159747200,"title":"Possible vocalizations, knocks heard by hunters in the Gallegos peak area","observed":"From sept 30th-oct 4th,2006 I was hunting with a friend [name withheld by request] in northern New Mexico Mtns. at about 9,500ft. On the evening of the 2nd I was heading back to camp when I heard a strang sound, like a scream/howl. Now I have hunted the mtns for many years for elk, bear, deer, mtn lions, and turkey, and never heard anything like this before.When I got back to camp my friend, who had started supper made the comment that something strange had happened to him. He said that he heard two sticks being hit together just before he started to camp. I did not tell him about the sounds I heard that night. The next morning I left about an hour before sun-up and headed back toward the same area that I hunted last evening. After sitting for about an hour and a half I got up and moved down an old road to check an elk crossing when I heard the same scream/howl again. I tried to pinpoint the area but never heard it again. When I met my friend at lunch he said he had heard the sticks being hit together again. I asked him to point to the area and he pointed to an area about 200 yards from the area I had heard the scream/howl. I asked him if he heard any screams and he said no.","classification":"Class B","county":"Taos","state":"New Mexico","latitude":36.19625,"longitude":-105.5596,"latlng":"-105.5596,36.19625","locationDetails":"about 5 miles up forest rd 442 at the Gallegos peak area.","dewPoint":26.49,"humidity":0.31,"cloudCover":0.04,"moonPhase":0.34,"pressure":1016.05,"weatherSummary":"Clear throughout the day.","uvIndex":7,"visibility":10,"highTemp":74.57,"midTemp":60.215,"lowTemp":45.86,"windBearing":247,"windSpeed":2.52}
{"id":"26460","observed":"We were getting up early to hitch up our travel trailer and start home to Oklahoma.  My wife had gotten up first and then I got up and went into the bathroom.  My wife opened the door and said that someone was standing outside the entry door to the bedroom of the trailer.  I went back to the room and saw a large shadow in the window.  The window is privacy glass so they couldn't see inside.  I could see a chest, a head and about half of the arm.   I reached into the night stand a took out my pistol thinking that it was someone.  I then started toward the back of the trailer to the main entry door.  While I was doing this my wife thought to take photos.  She took 3 photos which does show the shadow of whatever it was very well.  When I was at the other end of the trailer I opened the door and turned on the outside light at the same time.  There was nothing there, I did hear what sounded like someone walking very quickly in the distance.  I went around the trailer but couldn't see anyone.  It was at this time that I realized that the window on the door is too high for someone to have been standing there.  I took pictures to show how high it is.  We waited until daylight to go back outside, I looked around the front and side of the trailer and noticed what appeared to be large tracks in the gravel.  I took pictures of these.  My friend who is a photographer took a copy of the pictures showing the shadow in the window and enlarged them while trying to keep the clarity and it is possible to make out some of the features.  His exact words are \" it kind of looks like Harry from Harry and the Hendersons\".  I don't know what it was but it was very strange and the photos are quite interesting.","classification":"Class A","county":"Taos","state":"New Mexico","locationDetails":"Withheld by request"}
{"id":"28886","timestamp":1298160000,"title":"Couple driving home has night time sighting near Tres Piedras","observed":"On Feb .20, 2011 my mother and father were on there way back to Antonito, Co from Espanola, New Mexico. It was probably between 10:00p.m.and 11:p.m when they were driving down  road 285 headed north a big,tall, black human looking thing was standing in the road upon the car coming up closer the black thing which stood over six feet tall, very husky, walked very fast like a gorilla walk across the road. The thing popped out from the east side of road 285 crossing to the west side of the road . It was a very scary situation according to my parents. They suggest that anybody, especially female drivers to PLEASE BE CAREFUL.","classification":"Class A","county":"Taos","state":"New Mexico","latitude":36.65339,"longitude":-105.9678,"latlng":"-105.9678,36.65339","locationDetails":"It was just North of the road on Hwy 285 from the flashing light of Tres Piedras, New Mexico right where there is a wall of rocks on each side of the road. by the Per-light.","dewPoint":14.86,"humidity":0.61,"cloudCover":0.69,"moonPhase":0.59,"pressure":1004.69,"weatherSummary":"Light snow (< 1 in.) in the morning and evening and breezy until afternoon.","uvIndex":4,"visibility":8.52,"highTemp":33.17,"midTemp":21.325,"lowTemp":9.48,"precipitationIntensity":0.0021,"precipitationProbability":0.98,"precipitationType":"snow","windBearing":249,"windSpeed":12.76}
{"id":"5697","timestamp":82684800,"title":"Three boys encounter sasquatch in eroded terrain","observed":"This is the second in a set of chronological reports that I am submitting regarding a series of encounters I had between 1970 and 1983 in Nevada, California, and Washington States. I grew up several miles Northwest of Reno, Nevada in the foothills of the Sierra's.  My father was a geologist who preferred sparsely populated areas, so we lived, camped, fished, gold panned, rockhounded, and hunted Indian and goldrush artifacts in some relatively remote places. This second encounter occured in August of 1972 in Lemmon Valley, Nevada.  Lemmon Valley is Northwest of Reno on US 395.  Though the area I am about to describe is now covered with housing developments, in 1972 there were only two developed areas in the valley.  Stead Air Force Base (deactivated in 1959)[N.B. below] was on the West side of the valley and the community of Lemmon Valley was on the East side.  The community of Lemmon Valley was, in reality, simply a strip of built up properties along Lemmon Valley road - just housing and few small businesses extending for about five miles toward the back of the valley and for a couple of hundred yards at most to either side of the road.  US 395 cut across the South and higher end of the valley at the base of Peavine Mountain's North slope.  Toward the back of the valley, the North or lower end, were a few small ranches.  Only a couple of improved dirt roads cut across the center of the valley connecting the community of Lemmon Valley to Stead. The climate was high desert.  Roughly 5000 feet in elevation with negligible year-round rainfall, but sometimes several feet of snow in the winter.  The humidity was generally less than ten percent and often as low as five.  Other than those planted near developed properties, there were no trees in the floor of the valley.  Scrub pine begins on the higher ridges about five miles West of the valley and thickens to fully developed arid pine forest as the elevation increases.  The dominant vegetation is sagebrush, mixed with a wide variety of large weeds and coarse grasses.  Jackrabbits, prairie dogs, and smaller rodents were very common, as were a wide variety of lizards and snakes.  Coyotes are common, but rarely seen.  Cougar and black bear are rare, but sometimes sighted in the area.  Deer stick to the surrounding higher elevations with more trees.  Other indigenous animals include hawks, falcons, and few burrowing owls.  Quail, and other ground nesting birds are also plentiful.  There is also a variety of large insect species (cicada, locusts, etc..) to round out the ecosystem.  At first glance, the area may not look like it supports much in the way of life, but it actually does.  Snow melt is the primary source of open water in the late spring and early summer and a small lake forms toward the back of the valley.  By late August this has usually dried up and the only sources of water are near human habitation. As I mentioned in my first report, the North face of Peavine Mountain was deforested in the late 1800's.  It has also eroded significantly over the last century as a natural result of the vegetation loss and due to hydraulic mining.  The runoff from the mountain was clearly heavy at some time in the past, because two deep washes cut through half the length of the valley flowing North from Peavine Mountain. These washes were eight to ten feet deep in places with vertical walls and averaged five to eight feet in width.  Walking down one was much like walking through a school hallway with slight curves.  Their depth would increase and decrease as they intersected the natural fingers and draws running down from the ridges that bounded the valley.  They were difficult to climb in and out of except at a few places where they shallowed out to a couple of feet as they intersected a draw.  Because they were shaded and contained a little more moisture than the surrounding terrain, they formed a small microclimate where certain species of lizard and an occassional scorpion could be found.  The sagebrush also grew a little taller (about three feet) along their edges.  Below, the floors of the washes were almost perfectly level, shaded, and protected from the wind.  Very little vegetation grew in the floors of the washes and was usually limited to tumbleweeds and some patches of coarse grass.  From the floor of the valley these washes were virtually invisible.  You could only tell where they were from a stripe of sagebrush running along their edges that was a little greener, thicker, and taller than the rest of the sagebrush in the valley.  You couldn't see them or see down into them until you were right on top of them. This encounter took place in the early afternoon in mid-August of 1972.  It was bright, sunny, and hot, about 85 degrees Fahrenheit, at the time.  The wind was less than five miles per hour.  I was twelve.  I was with my brother, who was ten, and a friend, David, who was also twelve.  For years, my brother and I had spent the summers exploring the surrounding hills and valley.  We knew all the best places to catch each type of lizard, the best places to look for arrowheads, where the trash dumps from the 1800's were (good for old bottles), and the best places to find old shell casings and such from when the airbase had been active.  We didn't often make it out as far as the dry washes, but when we did we made a point of exploring them because of the unique things like scorpions you could find in them.  We had just moved from Stead to the Lemmon Valley side of the valley and David, a new neighbor, was with us for the first and, as it turned out, only time. We had decided to go all the way out to the closest wash to show it to David, and were angling toward one of the shallow points where it would be easier to get into.  As we walked along we were searching the ground for horned toads, arrowheads, and anything else that might be interesting.  We were about twenty feet from the wash when we stumbled across an area with jasper and obsidian chips on the ground and started looking around in earnest for arrowheads and other stone tools.  My brother and I were seriously competitve when it came to hunting arrowheads. I was facing North, focusing on a piece of jasper I had just found, and had my back to my brother and David when I got a sudden feeling something was wrong.  I don't know whether I heard one of them gasp or just go abruptly quiet, but I knew there was a problem.  I had a sense of where my brother was a few feet behind me and turned to look at him.  As I turned clockwise from North to South I saw first David, about twenty-five feet away from me and a couple of feet from the rim of the wash, then what I perceived to be a giant black man about eight feet from David and about three feet away from the wash, and finally my brother, who was only about five feet behind me.  The giant black man was about thirty-five feet from me, standing still facing me with his arms at his sides looking directly at me (I guess he must have figured I was the lead male).  David was in shock, rooted to the ground, staring directly at him with his mouth wide open and his lower jaw level with his collarbones.  My brother was poised to run and looking from the \"man\", to me, and then to David in a panic.  As soon as I saw the man I took a step to run also, but realized David wasn't going anywhere and we'd need to help him if the \"man\" tried to do anything (we weren't that far from Reno and there are a lot of weird people who drift through that town - a man out of place in the desert is immediately considered dangerous).  I settled my weight and looked the \"man\" in the eye waiting for him to indicate his intentions. This all took about a second.  At this point my brother turned to me and screamed, \"That's not a man!  That's not a man!\"  Not breaking eye contact with the \"man\" I snapped back at him, \"Yes it is!\"  My brother immediately yelled \"No, it's not!\" and I snapped right back \"Then what is it?\"  which shut him up.  At that moment, in that situation, it was critically important to me that the \"man\" be nothing more than a man.  I also knew my brother and I could probably get away, but David was at risk and I intuitively sensed that it was important to control the fear, both by keeping the \"man\" just a man and by calming my brother. As I focused on the \"man\" I recognized that he was not overtly threatening but seemed stern and annoyed.  He didn't move a muscle and he didn't make a sound.  From his manner I gathered that he was not threatening us, but was determining if we were a threat to him - that we had disturbed him and he just wanted us to go away and leave him alone.  My brother and I would have been happy to oblige but David was still standing like a statue and we weren't leaving him behind so we all just stood there and stared at each other. I could see the \"man\" from the lower shins on up, and this is where it gets a little strange.  He was at least eight and a half feet tall, three and a half feet to four feet broad at the shoulder, and had a comparatively narrow waist.  His arms hung down to the top of his knees.  Not only was this \"man\" huge and slightly disproportionate, but in the middle of the afternoon, in the middle of August, to my perception, he was wearing a black down ski parka with the peaked hood up, matching black down ski pants, and black gloves.  Down ski-wear was a brand new fad with the skiers that came through Reno back then.  I thought to myself that it was strange that he had this brand new ski outfit, let alone one that fit his frame.  I thought he must have stolen it (I had already subconsciously assumed this guy was a hobo because we were at least a mile from the nearest road, there wasn't a vehicle in sight, and I couldn't think of a good reason for him to have apparently been hiding in the wash).  As I thought about it, the hobo assumption made sense.  The ski-suit was probably the only thing he had to wear and, at night, sleeping out in the open in the high desert it tended to get a little chilly, August or not.  There was even a little dirt on it in places, indicating he'd been lying on the ground in it. The \"man's\" bearing, though, didn't come across the way a homeless person's would.  He stood tall with his shoulders relaxed, but back.  His posture indicated a sense of self-worth that was almost regal and his gaze didn't flinch (as an afterthought, there was nothing about his eyes to give me the impression that he lacked human intelligence).  Even under the ski suit you could tell that he had a massively muscled upper body, and the ratio of shoulders to waist were those of a world-class athlete.  For a moment I considered that I was looking at fur-covered muscle and immediately killed the thought, then started to look a little closer anyway.  This was when he simply broke eye contact, turned, stepped down into the wash at the shallow point where he was standing and walked away down the wash without looking back (this was a little strange in retrospect because there was absolutely no indication in body language or eye movement to telegraph that he had decided our encounter was over - he simply turned and left without acknowledgement).  Within a couple of steps he disappeared around a slight curve in the wall of the wash as it cut through the next finger off of the ridge.  We had stood looking at each other for maybe forty-five seconds. I didn't move for a couple of seconds after he disappeared, waiting to give him time to go before moving to check on David.  I'd never seen anybody so afraid that they were frozen on the spot before and I was concerned about him.  As I walked up to David, looking cautiously down the wash as I got a better angle on it, my brother followed me and said in a voice that seemed to beg me to believe him, \"That wasn't a man.\"  Standing in front of David, I looked him in the eye and said, \"Yes it was.  It was just a big, black hobo.\"  That ended the discussion.  I asked David if he was ok.  He just shook his head yes and didn't say anything.  My brother moved up to the edge of the wash to see as far down it as he could and I asked if he could see the guy.  He couldn't and we started to leave when curiosity got the better of us and my brother asked, \"What do you think he was doing down there?\"  I thought about it for a second and decided I wanted to know, too, so we walked along the edge of the wash for a hundred yards or so to make sure he wasn't hiding close enough to threaten us (the guy wasn't carrying anything and I was worried that we would find his camp about the time he came back to it to get his belongings).  We walked back down to the shallow spot in the wash and jumped down into it.  I briefly recognized that the \"man\" had simply stepped down the three feet I had just jumped, but didn't say anything. We walked both up and down the wash a hundred feet or so looking for a campsite.  We didn't find one.  No firepit, no food wrappers, no trash, no drug paraphenalia, no signs that a human had been camping there.  The floor of the wash was granite sand so there really weren't any footprints that I could recognize to indicate where he may have been.  We did find a spot where someone had taken pieces of tumbleweed and sticker bush and embedded them in the wall of the wash.  Tumbleweed and pieces of bush were also arranged on the floor of the wash at the same spot.  Those embedded in the wall of the wash were arranged in a tall half-oval with the peak about four and a half feet high.  Those on the floor of the wash were also arranged in a half oval that joined the first.  It was about the right size for the guy to sit cross-legged in with his back against the wall of the wash. At that time I had never heard of Bigfoot, so it wasn't even an option for me to consider within the framework of the encounter.  Even though several things about the encounter were strange I convinced myself that we had been confronted by a man.  What else could it have been?  About ten days later, though, something happened that forced me to admit that there was something in the valley that was manlike but wasn't a man.  I'll submit that as my third report soon.","classification":"Class A","county":"Washoe","state":"Nevada","latitude":39.679,"longitude":-119.6665,"latlng":"-119.6665,39.679","locationDetails":"Described in context above.","dewPoint":26.36,"humidity":0.29,"cloudCover":0.41,"moonPhase":0.21,"pressure":1014.1,"weatherSummary":"Partly cloudy starting in the afternoon.","uvIndex":9,"visibility":9.68,"highTemp":74.49,"midTemp":58.43,"lowTemp":42.37,"windBearing":248,"windSpeed":3.23}
